Repository: meetings/core
Catalog: pkg/dicole_security/msg/messages-*.po
Languages: fi

source: Access admin area
fi: Pääsy ylläpitotoimintoihin

source: Add collection
fi: Lisää kokoelma

source: Add new security settings
fi: Lisää uusia käyttöoikeuksia

source: Add securities
fi: Lisää käyttöoikeuksia

source: Add settings
fi: Lisää asetus

source: Advanced security settings
fi: Tarkemmat käyttöoikeudet

source: Archetype description
fi: Perustyypin kuvaus

source: Archetype name
fi: Perustyypin nimi

source: Are you sure you want to remove the selected collections?
fi: Haluatko varmasti poistaa valitut kokoelmat?

source: Assign any security
fi: Aseta mikä tahansa käyttöoikeus

source: Collection details
fi: Kokoelman tiedot

source: Collection name
fi: Kokoelman nimi

source: Collection saved
fi: Kokoelma tallennettiin onnistuneesti

source: Confirmation
fi: Vahvistus

source: Description
fi: Kuvaus

source: Edit
fi: Muokkaa

source: Error
fi: Virhe

source: First name
fi: Etunimi

source: General collection information
fi: Kokoelman yleistiedot

source: Global rights updated
fi: Yleiset käyttöoikeudet päivitettiin onnistuneesti

source: Global security settings
fi: Yleiset käyttöoikeudet

source: Group levels
fi: Ryhmän tasot

source: Group name
fi: Ryhmän nimi

source: Group security settings
fi: Ryhmän käyttöoikeudet

source: Groups name
fi: Ryhmien nimet

source: Groups' rights
fi: Ryhmien oikeudet

source: Last name
fi: Sukunimi

source: List collections
fi: Näytä kokoelmat

source: List of collections
fi: Kokoelmien listaus

source: List securities
fi: Näytä käyttöoikeudet

source: Login name
fi: Käyttäjätunnus

source: Module
fi: Moduuli

source: Receiver and target types
fi: Vastaanottaja- ja periyttäjätyypit

source: Receiver type
fi: Vastaanottajatyyppi

source: Remove
fi: Poista

source: Remove collections
fi: Poista kokoelmia

source: Remove groups' rights
fi: Poista ryhmien oikeuksia

source: Remove securities
fi: Poista käyttöoikeuksia

source: Remove selected collections
fi: Poista valitut kokoelmat

source: Remove users' rights
fi: Poista käyttäjien oikeuksia

source: Rights will be applied to all users. Proceed to the next step.
fi: Oikeudet asetetaan kaikille käyttäjille. Siirry seuraavaan vaiheeseen.

source: Rights will target the whole system. Proceed to the next step.
fi: Oikeudet kohdistuvat koko järjestelmään. Siirry seuraavaan vaiheeseen.

source: Save
fi: Tallenna

source: Securities added
fi: Käyttöoikeudet lisättiin onnistuneesti

source: Security Collections Manager
fi: Käyttöoikeuskokoelmien hallinta

source: Security collections
fi: Käyttöoikeuskokoelmat

source: Security level description
fi: Käyttöoikeustason kuvaus

source: Security level name
fi: Käyttöoikeustason nimi

source: Security settings added
fi: Käyttöoikeudet lisättiin onnistuneesti

source: Select collections
fi: Valitse kokoelmat

source: Select global rights
fi: Valitse yleiset oikeustasot

source: Select global securities
fi: Valitse yleiset käyttöoikeudet

source: Select groups
fi: Valitse ryhmät

source: Select groups which receive these rights
fi: Valitse oikeustasot vastaanottavat ryhmät

source: Select receivers
fi: Valitse vastaanottajat

source: Select targets
fi: Valitse periyttäjät

source: Select the collections
fi: Valitse kokoelmat

source: Select the groups which the rights will target
fi: Valitse ryhmät, jonka mukaan oikeustasot asetetaan

source: Select the users which the rights will target
fi: Valitse käyttäjät, jonka mukaan oikeustasot asetetaan

source: Select the users who receive these rights
fi: Valitse oikeustasoja vastaanottavat käyttäjät

source: Select users
fi: Valitse käyttäjät

source: Selected collections
fi: Valitse kokoelmat

source: Selected groups
fi: Valitut ryhmät

source: Selected levels
fi: Valitut tasot

source: Selected receivers
fi: Valitut vastaanottajat

source: Selected targets
fi: Valitut periyttäjät

source: Selected users
fi: Valitut käyttäjät

source: Show list
fi: Näytä lista

source: System administrator
fi: Järjestelmän ylläpitäjä

source: System moderator
fi: Järjestelmän moderaattori

source: System user defaults
fi: Järjestelmäkäyttäjän oletusarvot

source: Target type
fi: Periyttäjätyyppi

source: Type
fi: Tyyppi

source: User can assign any security in the global security managers
fi: Käyttäjä voi asettaa mitä tahansa yleisiä käyttöoikeuksia

source: User levels
fi: Käyttäjätasot

source: User name
fi: Käyttäjätunnus

source: User security settings
fi: Käyttäjien käyttöoikeudet

source: User sees the admin tab
fi: Käyttäjä näkee ylläpitotoimintojen välilehden

source: Users' rights
fi: Käyttäjän oikeudet

source: World levels
fi: Julkisuustasot

source: User
fi: Käyttäjä

source: Group
fi: Ryhmä

source: System
fi: Järjestelmä

source: Everybody
fi: Kaikki

source: Allow
fi: Hyväksy

source: Deny
fi: Hylkää

source: Receiving user
fi: Vastaanottava käyttäjä

source: Receiving group
fi: Vastaanottava ryhmä

source: Target user
fi: Kohdekäyttäjä

source: Target group
fi: Kohderyhmä

source: List settings
fi: Listaa asetukset

source: Local users
fi: Paikalliset käyttäjät

source: System roles
fi: Roolit järjestelmässä

source: Access personal area
fi: Pääsy henkilökohtaiselle alueelle

source: User sees the personal tab
fi: Käyttäjällä on mahdollisuus nähdä henkilökohtainen välilehti

source: Are you sure you want to remove the selected rights?
fi: Olet varma, että haluat poistaa valitut oikeudet

source: Remove rights
fi: Poista oikeudet

source: Remove settings
fi: Poista asetukset

source: Rights will be applied globally. Proceed to the next step.
fi: Oikeudet annetaan kenelle tahansa. Jatka seuraavaan askeleeseen.

source: Rights will be applied to all local users. Proceed to the next step.
fi: Oikeudet annetaan paikallisille käyttäjille. Jatka seuraavaan askeleeseen.

source: Select the rights you want to remove
fi: Valitse oikeudet, jotka haluat poistaa

source: Manage admin only settings
fi: Hallitse ylläpitäjille tarkoitettuja asetuksia

source: User can manage admin only settings
fi: Käyttäjä voi hallita vain ylläpitäjille tarkoitettuja asetuksia
