Repository: meetings/core
Catalog: pkg/dicole_summary/msg/messages-*.po
Languages: fi

source: Personal summary
fi: Henkilökohtainen yhteenveto

source: Group summary
fi: Ryhmän yhteenveto

source: Summary
fi: Yhteenveto

source: Add freeform summaries
fi: Lisää vapaamuotoinen laatikko

source: Deny group summary use
fi: Kiellä yhteenvedon käyttö

source: Freeform summaries
fi: Vapaamuotoiset laatikot

source: Group summary managing
fi: Ryhmän yhteenvedon hallinta

source: Manage freeform boxes
fi: Vapaamuotoisten laatikoiden hallinta

source: Manage Group summary
fi: Ryhmän yhteenvedon hallinta

source: Summary config
fi: Yhteenvedon asetukset

source: Freeform summary details
fi: Vapaamuotoisen laatikon tiedot

source: New freeform summary details
fi: Uuden vapaamuotoisen laatikon tiedot

source: Group summary box moving
fi: Ryhmän yhteenvedon laatikoiden siirto

source: Move boxes
fi: Laatikoiden siirto

source: Actions
fi: Toiminnot

source: Revert to default summary layout
fi: Palauta oletusarvoinen yhteenvedon järjestys

source: Set your summary layout as default layout
fi: Aseta oman yhteenvetosi järjestys oletukseksi

source: Summary page navigation item
fi: Yhteenvedon navigaatioelementin ikoni

source: Wether to show the summary page navigation item
fi: Näytetäänkö yhteenvedon navigaatioelementin ikoni

source: Store this as default summary layout
fi: Tallenna tämä yhteenvedon vakiosijoutteluksi

source: Dicole community platform (invite system name)
fi: Dicole community platform
