Repository: meetings/core
Catalog: pkg/dicole_group_pages/msg/messages-*.po
Languages: fi

source: Add page
fi: Lisää sivu

source: Front page
fi: Etusivu

source: Configuration saved.
fi: Asetukset tallennettu.

source: Configure wiki
fi: Wikin asetusten määritys

source: Content
fi: Sisältö

source: Create wiki pages
fi: Wikisivujen luonti

source: Deny wiki moderation
fi: Poista wikisivujen muokkaus käytöstä

source: Deny wiki use
fi: Poista wiki käyttöoikeus

source: Edit wiki pages
fi: Wikisivujen muokkaus

source: Edit page
fi: Muokkaa sivua

source: Failed to create page: %1
fi: Sivun: %1 luonti epäonnistui

source: Failed to save page: %1
fi: Sivun: %1 tallennus epäonnistui

source: Go to start page
fi: Siirry aloitussivulle

source: Group does not have a front page!
fi: Ryhmällä ei ole etusivua!

source: Wiki configuration
fi: wikin asetukset

source: Wiki front page
fi: Wikin etusivu

source: Wiki system for collaborative document writing.
fi: Wiki-järjestelmä on yhteisöllisen kirjoittamisen työkalu.

source: Wiki moderator
fi: Wikin ylläpitäjä

source: Wiki user
fi: Wiki käyttäjä

source: Last modified
fi: Viimeinen muokkaus

source: List pages
fi: Listaa sivut

source: Lock wiki pages
fi: Wikisivujen lukinta

source: Lock page
fi: Lukitse sivu

source: No pages found.
fi: Sivuja ei ole saatavilla.

source: Page %1 information
fi: Sivun %1 tiedot

source: Page has been created.
fi: Sivu luotiin onnistuneesti.

source: Page has been saved.
fi: Sivu tallennettiin onnistuneesti.

source: Page information
fi: Sivun tiedot

source: Page is locked!
fi: Sivu on lukittu!

source: Page listing
fi: Sivujen listaus

source: Page with this name exists already!
fi: Samanniminen sivu on jo olemassa!

source: Page you requested does not exist!
fi: Hakemaasi sivua ei ole saatavilla!

source: Read wiki
fi: Wikin lukeminen

source: Recently changed wiki pages
fi: Viimeksi päivitetyt wikisivut

source: Save
fi: Tallenna

source: Select base version:
fi: Valitse pohjaversio:

source: Settings
fi: Asetukset

source: Title
fi: Otsikko

source: Unlock page
fi: Poista sivun lukitus

source: User can configure wiki tool in this group
fi: Käyttäjä voi muokata wiki-työkalua tässä ryhmässä

source: User can create wiki pages in this group
fi: Käyttäjä voi luoda wikisivuja tässä ryhmässä

source: User can edit wiki pages in this group
fi: Käyttäjä voi muokata wikisivuja tässä ryhmässä

source: User can lock and unlock wiki pages in this group
fi: Käyttäjä voi lukita ja vapauttaa wikisivuja tässä ryhmässä

source: User can read wiki in this group
fi: Käyttäjä voi lukea wikisivuja tässä ryhmässä

source: Show page
fi: Näytä sivu

source: Page %1 has been locked.
fi: Sivu %1 on lukittu.

source: Page %1 has been unlocked.
fi: Lukitus on poistettu sivulta %1.

source: Remove page
fi: Poista sivu

source: This page and its version history will be completely removed. Are you sure you want to remove this page?
fi: Tämä sivu ja sen koko versiohistoria poistetaan kokonaan. Oletko varma, että haluat poistaa tämän sivun?

source: Front page cannot be removed.
fi: Wikin etusivua ei voi poistaa.

source: Error removing page %1.
fi: Sivun %1 poistaminen epäonnistui.

source: Page %1 successfully removed.
fi: Sivu %1 on onnistuneesti poistettu.

source: User can remove wiki pages in this group
fi: Käyttäjä voi poistaa wikisivuja tässä ryhmässä

source: Remove wiki pages
fi: Wikisivujen poisto

source: This page was last modified %1 by %2
fi: Tätä sivua muokkasi viimeksi %2 ajankohtana %1

source: Configuration
fi: Ominaisuudet

source: Last author
fi: Viimeisin muokkaaja

source: Page preview
fi: Sivun esikatselu

source: This is a preview page! It is not yet saved!
fi: Tämä on esikatselu! Sivua ei ole vielä tallennettu!

source: Somebody has changed this page after you started editing it!
fi: Joku on muuttanut sivua sen jälkeen kun aloit muokkaamaan sitä!

source: Preview
fi: Esikatselu

source: Forum designated for wiki discussions
fi: Wikisivuja varten tarkoitettu keskustelualue

source: Discussion
fi: Keskustelu

source: Number of messages in discussion: %1
fi: Viestien lukumäärä keskustelussa: %1

source: Last post by: %1 - %2
fi: Viimeisin viesti: %1 - %2

source: Start discussion
fi: Aloita keskustelu

source: Select discussion forum
fi: Valitse keskustelualue

source: Front page not yet created.
fi: Wikin etusivua ei ole vielä määritelty.

source: Wiki rights
fi: Wikin oikeudet

source: Version history
fi: Versiohistoria

source: Show current page
fi: Näytä tämänhetkinen sivu

source: Changes from version %d to version %d
fi: Muutokset versiosta %d versioon %d

source: Requested version does not exists!
fi: Pyydettyä versiota ei ole olemassa!

source: Limit feed access by IP addresses (each on a separate line)
fi: Rajoita syötteen käyttö IP osoitteiden mukaan (yksi per rivi)

source: Recent changes
fi: Viimeisimmät muutokset

source: Conflicts during merging of concurrent edits. Edit not saved yet!
fi: Ongelmia yhdenaikaisten muokkausten yhdistämisessä! Sivua ei ole vielä tallennettu!

source: >>>>>>>>>> BEGINNING OF A CONFLICT
fi: >>>>>>>>>> ONGELMAKOHDAN ALKU

source: >>>>>>>>>> You wrote:
fi: >>>>>>>>>> Sinä kirjoitit:

source: >>>>>>>>>> %s wrote:
fi: >>>>>>>>>> %s kirjoitti:

source: >>>>>>>>>> END OF A CONFLICT
fi: >>>>>>>>>> ONGELMAKOHDAN LOPPU

source: Export all pages to a file
fi: Vie kaikki sivut tiedostoon

source: Old wiki
fi: Vanha wiki

source: Old wiki rights
fi: Vanhan wikin oikeudet
