Repository: meetings/core
Catalog: pkg/dicole_login/msg/messages-*.po
Languages: fi, sv

source: Domain
fi: Toimialue
sv: Domän

source: Login failure. Please check your username and password.
fi: Kirjautuminen epäonnistui. Ole hyvä ja tarkasta käyttäjänimesi ja salasanasi.
sv: Inloggning misslyckades. Var god och kolla ditt login-namn och lösenord.

source: Login
fi: Kirjaudu
sv: Logga in

source: Password
fi: Salasana
sv: Lösenord

source: Username
fi: Käyttäjänimi
sv: Användarnamn

source: Session was not found, this probably means the session timed out. Please login again to proceed.
fi: Istuntoa ei löytynyt. Tämä todennäköisesti tarkoittaa, että istunto on vanhentunut. Ole hyvä ja kirjaudu uudelleen. Toistuvissa ongelmatapauksissa kannattaa kokeilla poistaa selaimen evästeet (cookiet) ennen kirjautumista. Apua saa osoitteesta antti@dicole.com.
sv: Ingen session hittades, detta betyder antagligen att det uppstod ett avbrott. Var god och logga in på nytt för att fortsÃ€tta.

source: Thank you for using our system. Always remember to log out after you are done to ensure your own privacy.
fi: Kiitos, että käytit järjestelmää. Muista aina kirjautua ulos käytön jälkeen varmistaaksesi oman turvallisuutesi.
sv: Tack för att du anvÃ€nde vårt system. För att skydda din integritet, kom alltid ihåg att logga ut efter du avslutat sessionen.

source: Invalid login, please try again.
fi: Kirjautuminen epäonnistui, ole hyvä ja yritä uudelleen.
sv: Ogiltig login, var god försök pånytt.

source: Radius server is not responding, please try again.
fi: Radius-palvelin ei vastaa, ole hyvä ja yritä uudelleen.
sv: Radius servern svarar ej, var god försök pänytt.

source: Register
fi: Rekisteröinti
sv: Registrera

source: Retrieve lost account
fi: Palauta unohtunut käyttäjätili
sv: Återställ förlorat konto

source: Account email
fi: Tunnuksen sähköpostiosoite
sv: Kontots e-post

source: Your registered email address
fi: Rekisteröimäsi sähköpostiosoite
sv: Er registrerade e-postadress

source: Submit
fi: Lähetä
sv: Skicka

source: Retrieve lost username and password
fi: Palauta unohtunut tunnus ja salasana
sv: Återsäll förlorat inloggningsnamn och lösenord

source: User account information has been sent to email address: %1
fi: Käyttäjätilin tiedot on lähetetty osoitteeseen: %1
sv: Kontots information har skickats till adressen: %1

source: No user account registered with the provided email address: %1
fi: Käyttäjätilejä ei löytynyt annetulla sähköpostiosoitteella: %1
sv: Inget konto har registrerats med den givna e-postadressen: %1

source: Please provide your registered email address.
fi: Anna rekisteröimäsi tunnuksen sähköpostiosoite.
sv: Var god ge er registrerade e-postadress.

source: User account information from %1
fi: Käyttäjätilin tiedot osoitteesta %1
sv: Användarinformation från %1

source: Local
fi: Paikallinen
sv: Lokal

source: Error connecting to database, please contact system administrator.
fi: Tietokantayhteys epäonnistui, ota yhteys järjestelmänvalvojaan.
sv: Ett fel uppkom vid anslutandet till databasen, var god kontakta systemets administrator.

source: New user creation failed.
fi: Uuden käyttäjän luominen epäonnistui.
sv: Skapandet av ny användare misslyckades.

source: Confirm lost account
fi: Varmenna unohtunut tunnus
sv: Bekräfta förlorat konto

source: New password
fi: Uusi salasana
sv: Nytt lösenord

source: Confirm password
fi: Uusi salasana uudelleen
sv: Bekräfta lösenordet

source: Recovery key
fi: Palautusavain
sv: Återställningsnyckel

source: Failed to save recovery information.
fi: Palautusinformaation tallennus epäonnistui.

source: Failed to validate recovery key.
fi: Palautusavaimen tarkistus epäonnistui.

source: Failed to update account recovery information.
fi: Palautusinformaation päivitys epäonnistui.

source: Failed to change password.
fi: Salasanan vaihto epäonnistui.
sv: Ändring av lösenord misslyckades.

source: Password changed.
fi: Salasana vaihdettu.
sv: Lösenord ändrat.

source: New password saved.
fi: Uusi salasana on tallennettu.
sv: Nytt lösenord sparat.

source: Passwords do not match
fi: Salasanat eivät täsmää
sv: Lösenorden stämmer inte överens

source: Save new password
fi: Tallenna uusi salasana
sv: Spara nytt lösenord

source: This user account is disabled. Please contact your system administrator.
fi: Tämä käyttäjätili on pois käytöstä. Ota yhteys ylläpitoon.
sv: Detta konto har satts ur funktion. Var god kontakta systemets administrator.

source: Email and name are required.
fi: Sähköposti ja nimi ovat pakollisia.

source: Email has already been taken. Try logging in with your previous account or use a different email.
fi: Sähköpostiosoite on jo varattu. Kokeile kirjautua olemassaolevalla tunnuksellasi tai rekisteröidy jollakin muulla osoitteella.

source: Login failed, please check your username and password.
fi: Kirjautuminen epäonnistui. Tarkista käyttäjätunnuksesi ja salasanasi.

source: Login with Facebook
fi: Kirjaudu Facebookilla

source: Remember
fi: Muista
