Repository: meetings/core
Catalog: pkg/dicole_awareness/msg/messages-*.po
Languages: fi, sv

source: Online members
fi: Paikalla olevat jäsenet
sv: Medlemmar online

source: Adds a summary of online group members.
fi: Lisää yhteenvedon ryhmän paikalla olevista jäsenistä
sv: Tillägger ett sammandrag av gruppmedlemmar som är online

source: Online group members
fi: Paikalla olevat jäsenet
sv: Gruppmedlemmar online

source: No online members.
fi: Ei paikalla olevia jäseniä.
sv: Inga medlemmar online.

source: Unknown
fi: Tuntematon
sv: Okänd

source: Offline
fi: Offline-tila
sv: Offline-läge

source: Online
fi: Online-tila
sv: Online-läge

source: Away
fi: Poistunut
sv: Borta

source: Not Available
fi: Ei tavoitettavissa

source: Do Not Disturb
fi: Älä häiritse
sv: Stör ej

source: Invisible
fi: Näkymätön
sv: Osynlig

source: Skype Me
fi: Soita minulle
sv: Ring mig

source: Skype menu for user
fi: Skype -valikko käyttäjälle
sv: Skype-meny för användare

source: Call user
fi: Soita käyttäjälle
sv: Ring användare

source: Add user to contact list
fi: Lisää käyttäjä kontakteihin
sv: Lägg till användare till kontakter

source: Start a text chat with user
fi: Aloita tekstikeskustelu käyttäjän kanssa
sv: Inled textchat med användare

source: Show the Skype profile of user
fi: Näytä käyttäjän profiili
sv: Visa användarens Skype-profil

source: Send a file to user
fi: Lähetä tiedosto käyttäjälle
sv: Skicka en fil till användare

source: Online users
fi: Paikalla olevat käyttäjät
sv: Användare som är online

source: %1 seconds ago
fi: %1 sekunttia sitten
sv: %1 sekunder sedan

source: No online users.
fi: Ei käyttäjiä paikalla.
sv: Inga användare online.

source: %1 day(s)
fi: %1 päivä(ä)

source: %1 day(s) ago
fi: %1 päivä(ä) sitten

source: %1 days ago
fi: %1 päivää sitten

source: 1 day ago
fi: 1 päivä sitten

source: %1 hour(s)
fi: %1 tunti(a)

source: %1 hour(s) ago
fi: %1 tunti(a) sitten

source: %1 hours ago
fi: %1 tuntia sitten

source: 1 hour ago
fi: 1 tunti sitten

source: %1 minute(s)
fi: %1 minuutti(a)

source: %1 minute(s) ago
fi: %1 minuutti(a) sitten

source: %1 minutes ago
fi: %1 minuuttia sitten

source: 1 minute ago
fi: 1 minuutti sitten

source: %1 second(s)
fi: %1 sekunti(a)

source: Gives raports of usage
fi: Tuottaa raportteja käytöstä
sv: Användarrapport

source: Mail information
fi: Viestin tiedot
sv: Information om e-postmeddelandet

source: Mail members
fi: Lähetä sähköpostia jäsenille
sv: Skicka e-post åt användarna

source: Message sent to you succesfully.
fi: Viesti lähetettiin sinulle.
sv: Meddelandet har skickats åt dig

source: Messages were sent succesfully.
fi: Viestit lähetettiin.
sv: Meddelandena har skickats.

source: Now
fi: Nyt
sv: Nu

source: Raports
fi: Raportit
sv: Rapporter

source: Sender address
fi: Lähettäjän osoite
sv: Avsändarens adress

source: Sender name
fi: Lähettäjän nimi
sv: Avsändarens namn

source: Send mail
fi: Lähetä viesti
sv: Skicka e-post

source: Send mail to group users
fi: Lähetä posti ryhmän käyttäjille
sv: Skicka e-post åt gruppens användare

source: Send test mail to self
fi: Lähetä testiviesti itselle
sv: Skicka test e-post åt dig själv

source: Some messages could not be sent: %1
fi: Joidenkin viestien lähetyksessä ilmeni ongelmia: %1
sv: Det uppkom problem med att skicka några meddelande: %1

source: User can send mail to group users
fi: Käyttäjä voi lähettää sähköpostia ryhmien käyttäjille
sv: Användare kan skicka e-post åt gruppernas användare

source: You must fill all fields.
fi: Kaikki kentät tulee täyttää.
sv: Du måste fylla alla fält

source: Activity
fi: Aktiivisuus
sv: Aktivitet

source: Blog posts
fi: Blogiviestit
sv: Bloggposter

source: Daily usage
fi: Päivittäinen käyttö
sv: Daglig användning

source: Domain reports
fi: Käyttöraportit
sv: Domänrapporter

source: Group reports
fi: Ryhmän käyttöraportit
sv: Groupprapporter

source: Report
fi: Raportti
sv: Rapport

source: User based usage
fi: Käyttö käyttäjittäin
sv: Användning medlemsvis

source: Weekly usage
fi: Käyttö viikoittain
sv: Användning per vecka

source: Weekly Usage
fi: Käyttö viikoittain
sv: Användning per vecka

source: Wiki edits
fi: Wikin muokkaukset
sv: Ändringar i wiki

source: See domain reports
fi: Katso domainin raportit

source: See group reports
fi: Katso ryhmän raportit

source: Total
fi: Kaikki

source: User can see domain reports
fi: Käyttäjä voi nähdä domainin raportit

source: User can see group reports
fi: Käyttäjä voi nähdä ryhmän raportit

source: Show more users
fi: Näytä lisää käyttäjiä

source: Not available
sv: Inte tillgänglig
