Repository: meetings/core
Catalog: pkg/dicole_presentations/msg/messages-*.po
Languages: fi

source: Add a comment
fi: Lisää kommentti

source: Add a presentation
fi: Lisää esitys

source: Add presentation info
fi: Lisää esityksen tiedot

source: Add presentations
fi: Lisää esityksiä

source: Admin presentations
fi: Hallinnoi esityksiä

source: A place to showcase presentations
fi: Paikka jossa esitellä esityksiä

source: Are you sure you want to delete the presentation?
fi: Haluatko varmasti poistaa esityksen?

source: Best rated presentations
fi: Parhaiten arvioidut esitykset

source: Best rated presentations tagged with: %1
fi: Parhaiten arvioidut esitykset avainsanalla: %1

source: Bookmark
fi: Kirjanmerkki

source: Choose type
fi: Valitse laji

source: Comment presentations
fi: Kommentoi esityksiä

source: Confirmaition
fi: Vahvistus

source: Could not process URL. Sorry.
fi: Osoitetta ei pystytty käsittelemään. Pahoittelumme.

source: Custom
fi: Mukautettu

source: Edit presentation
fi: Muokkaa esitystä

source: Embed
fi: Lisää

source: Embed code
fi: HTML resurssin koodi

source: Embed custom HTML
fi: Vapaavalintainen HTML resurssi

source: Feature
fi: Nosta esille

source: Featured presentations
fi: Esillenostetut esitykset

source: Featured presentations tagged with: %1
fi: Esillenostetut esitykset avainsanalla: %1

source: Fetch
fi: Nouda

source: Fetch it from the internet
fi: Nouda internetistä

source: Filter by type
fi: Suodata lajin mukaan

source: How would you like to add a presentation?
fi: Miten haluaisit lisätä esityksen?

source: Latest presentations
fi: Viimeisimmät esitykset

source: Latest presentations tagged with: %1
fi: Viimeisimmät esitykset avainsanalla: %1

source: length
fi: pituus

source: Length %1
fi: Pituus %1

source: Map
fi: Kartta

source: No presentations found.
fi: Esityksiä ei löytynyt.

source: No such presentation.
fi: Kaivattua esitystä ei löydy

source: Presentation created.
fi: Esitys luotu.

source: Presentation info
fi: Esityksen tiedot

source: Presentation removed.
fi: Esitys poistettu.

source: Presentations
fi: Esitykset

source: Presentations rights
fi: Esityksen oikeudet

source: Presentation updated
fi: Esitys päivitetty

source: presented by
fi: Esittäjä

source: Presented by %1
fi: Esittäjänä %1

source: Preview: %1
fi: Esikatselu: %1

source: Preview image
fi: Esikatselukuva

source: Rate presentations
fi: Arvioi esityksiä

source: Refetch
fi: Nouda uudelleen

source: Show more presentations
fi: Näytä lisää esityksiä

source: Slideshow
fi: Kuvaesitys

source: Source URL
fi: Lähdeosoite

source: Supported services
fi: Tuetut palvelut

source: Tags:
fi: Avainsanat:

source: Unfeature
fi: Poista esillenosto

source: Unsupported URL
fi: Osoite ei ole tuettu

source: User can add presentations
fi: Käyttäjä voi lisätä esityksiä

source: User can admin presentations
fi: Käyttäjä voi hallinnoida esityksiä

source: User can comment presentations
fi: Käyttäjä voi kommentoida esityksiä

source: User can rate presentations
fi: Käyttäjä voi arvioida esityksiä

source: User can view presentations
fi: Käyttäjä voi selata esityksiä

source: View presentations
fi: Selaa esityksiä

source: You must fill the name.
fi: Sinun tulee täyttää nimi.

source: Add a media resource
fi: Lisää mediaresurssi

source: Add media resource info
fi: Lisää mediaresurssin tiedot

source: Are you sure you want to delete the media resource?
fi: Oletko varma, että haluat poistaa mediaresurssin?

source: Best rated media resources
fi: Arvostetuimmat mediaresurssit

source: Best rated media resources tagged with: %1
fi: Parhaiten arvioidut mediaresurssit avainsanoilla: %1

source: Edit media resource
fi: Muokkaa mediaresurssia

source: Featured media resources
fi: Esittelyssä olevat mediaresurssit

source: Featured media resources tagged with: %1
fi: Esittelyssä olevat mediaresurssit avainsanoilla: %1

source: How would you like to add a media resource?
fi: Miten haluat lisätä mediaresurssin?

source: Latest media resources
fi: Uusimmat mediaresurssit

source: Latest media resources tagged with: %1
fi: Uusimmat mediaresurssit avainsanoilla: %1

source: Media resource created.
fi: Mediaresurssi luotu.

source: Media resource featured.
fi: Mediaresurssi nostettu esittelyyn.

source: Media resource info
fi: Mediaresurssin tiedot

source: Media resource not featured anymore.
fi: Mediaresurssi poistetu esittelystä.

source: Media resource removed.
fi: Mediaresurssi poistettu.

source: Media resource updated
fi: Mediaresurssi päivitetty

source: No media resources found.
fi: Mediaresursseja ei löytynyt.

source: No such media resource.
fi: Pyydettyä mediaresurssia ei löytynyt.

source: Show more media resources
fi: Näytä lisää mediaresursseja

source: Best rated media
fi: Arvostetuimmat mediaresurssit

source: Featured media
fi: Esitellyt mediaresurssit

source: Latest media
fi: Uusimmat mediaresurssit

source: A place to showcase media resources
fi: Työkalu mediaresurssien hallintaan

source: %1 comments
fi: %1 kommenttia

source: by %1
fi: käyttäjältä %1

source: Contribute to presentations
fi: Kontribuoi mediaosioon

source: Latest media objects summary list
fi: Viimeisimpien medioiden yhteenvetolaatikko

source: Listing of 5 latest media objects
fi: Viimeisimmät mediat

source: No media found.
fi: Mediaa ei löytynyt.

source: Upload a new file
fi: Lähetä uusi tiedosto koneeltasi

source: Uploaded by %1
fi: Lähettäjänä %1

source: Upload from your computer
fi: Lähetä tiedosto koneeltasi

source: New media
fi: Uudet mediat

source: Featured media summary
fi: Esillenostetun median yhteenvetolaatikko

source: Featured media (summary title)
fi: Esillenostettu media

source: You must fill both name and description.
fi: Sekä nimi että kuvaus on täytettävä.

source: Are you sure you want to delete the media object "%1"?
fi: Oletko varma, että haluat poistaa mediaobjektin "%1"?

source: Add content
fi: Lisää sisältöä

source: Add content info
fi: Lisää sisällön tietoja

source: Content created.
fi: Sisältö luotu.

source: Content featured.
fi: Sisältö esillenostettu.

source: Content info
fi: Sisällön tiedot

source: Content not featured anymore.
fi: Sisältö poistettu esittelystä.

source: Content removed.
fi: Sisältö poistettu.

source: Content updated
fi: Sisältö päivitetty

source: How would you like to add content?
fi: Kuinka haluaisit lisätä sisältöä?

source: No content found.
fi: Sisältöä ei löytynyt.

source: No such content.
fi: Sisältöä ei löytynyt.

source: Preview
fi: Esikatselu

source: Delete
fi: Poista

source: Edit content
fi: Muokkaa sisältöä

source: Image
fi: Kuva

source: Uploaded by
fi: Lähettäjänä

source: 1 material
fi: 1 materiaali

source: %1 materials
fi: %1 materiaalia

source: Browse materials
fi: Seaa materiaaleja

source: Filter results
fi: Rajaa tuloksia

source: Go
fi: Hae

source: Materials
fi: Materiaalit

source: Material tagsearch summary
fi: Materiaalihaku yhteenvedossa

source: Open
fi: Avaa

source: Or choose one from the list:
fi: Tai valitse avainsana listasta:

source: Other:
fi: Muut:

source: Related pages
fi: Aiheeseen liittyvät sivut

source: Search materials (summary title)
fi: Etsi materiaaleja

source: Type an additional keyword:
fi: Kirjoita lisättävä avainsana:

source: Back to search results
fi: Takaisin hakutuloksiin

source: Bookmark added succesfully.
fi: Kirjanmerkki lisätty.

source: Bookmark removed succesfully.
fi: Kirjanmerkki poistettu.

source: Document
fi: Dokumentti

source: start a new search
fi: aloita uusi haku

source: Unbookmark
fi: Poista kirjanmerkki

source: Who has bookmarked this
fi: Tämän kirjanmerkkeihinsä lisänneet
