Repository: meetings/core
Catalog: pkg/dicole_cafe/msg/messages-*.po
Languages: fi

source: %1 on Twitter
fi: %1 Twitterissä

source: Active users
fi: Aktiiviset käyttäjät

source: Font size
fi: Kirjasimen koko

source: Hot in Blogs
fi: Nyt Blogeissa

source: Hot in Twitter
fi: Nyt Twitterissä

source: Hot in Wiki
fi: Nyt Wikissä

source: Hot Media
fi: Nyt Medioissa

source: Show scrollbar buttons
fi: Näytä vieritysnappulat

source: Show scrollbars
fi: Näytä vierityspalkit

source: Open original
fi: Avaa alkuperäinen

source: Show active users
fi: Näytä aktiiviset käyttäjät
