Repository: meetings/core
Catalog: pkg/dicole_blogs/msg/messages-*.po
Languages: fi, sv

source: %1 Comments
fi: %1 kommenttia
sv: %1 Kommentarerer

source: Best rated posts
fi: Arvostetuimmat viestit
sv: Högst bedömda poster

source: Blog following tool
fi: Työkalu keskusteluiden seuraamiseen
sv: Verktyg för uppföljning av bloggar

source: Blogs
fi: Keskustelut
sv: Bloggens rättigheter

source: Blogs rights
fi: Keskustelut -osion oikeudet

source: Choose view
fi: Näkymä
sv: Välj vy

source: Comment blogs
fi: Keskusteluiden kommentointi
sv: Kommentera bloggar

source: Demote
fi: Alenna
sv: Degradera

source: Discuss
fi: Keskustele
sv: Diskutera

source: Edit post
fi: Muokkaa viestiä
sv: Redigera inlägget

source: Entry removed
fi: Viesti poistettu
sv: Inlägget raderat

source: Entry updated
fi: Viesti päivitetty
sv: Inlägget uppdaterad

source: Feature blogs
fi: Esittele
sv: Befordrade bloggar

source: Featured post
fi: Esittelyssä
sv: Befordrad post

source: Featured posts
fi: Esitellyt viestit
sv: Befordrade poster

source: Filter by tag
fi: Suodata avainsanalla
sv: Filtrera enligt tags

source: Posts by %1
fi: Käyttäjän %1 viestit
sv: Poster av %1

source: Posts by contacts
fi: Kontaktieni viestit
sv: Poster av dina kontakter

source: Manage others comments to blogs
fi: Hallitse muiden keskusteluihin kirjoittamia kommentteja
sv: Hantera andras kommentarer till bloggar

source: Most promoted posts
fi: Nostetuimmat viestit
sv: Mest befordrade poster

source: My posts
fi: Omat viestini
sv: Mina poster

source: New posts
fi: Uudet viestit
sv: Nya poster

source: No, I changed my mind
fi: Ei, muutin mieleni
sv: Nej, jag har ändrat mig

source: Popular tags
fi: Usein käytetyt avainsanat
sv: Populära tags

source: Post
fi: Lähetä
sv: Posta

source: Write a post
fi: Kirjoita viesti
sv: Skriv en post

source: Promote
fi: Nosta
sv: Befordra

source: Promote blogs
fi: Keskusteluiden nostaminen
sv: Befordra bloggar

source: Publish
fi: Julkaise
sv: Publicera

source: Rate blogs
fi: Keskusteluiden arvostelu
sv: Bedöm bloggar

source: Read blogs
fi: Keskusteluiden lukeminen
sv: Läs bloggar

source: Read more
fi: Lue lisää
sv: Läs mera

source: Remove comments from blogs
fi: Kommenttien poistaminen keskusteluista
sv: Radera kommentarer från bloggar

source: Search by tag
fi: Etsi avainsanan perusteella
sv: Sök enligt tag

source: Suggested tags
fi: Suositeltuja avainsanoja
sv: Föreslagna tags

source: Syndication feed (RSS 2.0)
fi: Syöte (RSS 2.0)

source: Tags
fi: Avainsanat

source: User can comment blogs
fi: Käyttäjä voi kommentoida keskusteluja
sv: Användare kan kommentera bloggar

source: User can feature blogs
fi: Käyttäjä voi esitellä keskusteluja
sv: Användare kan framhäva bloggar

source: User can promote and demote blogs
fi: Käyttäjä voi nostaa ja alentaa keskusteluja
sv: Användare kan befordra och degradera bloggar

source: User can rate blogs
fi: Käyttäjä voi arvioida keskusteluja
sv: Användare kan bedöma bloggar

source: User can read the blogs
fi: Käyttäjä voi lukea keskusteluja
sv: Användare kan läsa bloggarna

source: User can remove comments from blogs
fi: Käyttäjä voi poistaa kommentteja keskusteluista
sv: Användare kan radera kommentarer från bloggar

source: Yes, I am sure that I want to delete the message permanently
fi: Kyllä, olen varma, että haluan poistaa tämän viestin lopullisesti
sv: Ja, jag är säker att jag vill radera detta meddelande permanent

source: You are about to delete a message
fi: Olet juuri poistamassa viestiä
sv: Du håller på att radera ett meddelande

source: You must fill both title and content.
fi: Sekä otsikko, että sisältö on täytettävä.
sv: Du måste ange både titel och innehåll.

source: You must have at least one tag.
fi: Tarvitset ainakin yhden avainsanan.
sv: Du måste ha åtminstone en tag.

source: New post
fi: Uusi viesti
sv: Ny post

source: Add tag
fi: Lisää avainsana
sv: Lägg till tag

source: tagged with: %1
fi: avainsanoin: %1
sv: taggad med: %1

source: Blogs featured post summary
fi: Keskustelut: esittelyssä olevan viestin yhteenveto
sv: Sammandrag av utvalda blogposter

source: Blogs new comments summary
fi: Keskustelut: uusien kommenttien yhteenveto
sv: Sammandrag av nya kommentarer till bloggar

source: Blogs new posts summary
fi: Keskustelut: uusien viestin yhteenveto
sv: Sammandrag av nya blogposter

source: Comment by %1
fi: Kommentti käyttäjältä %1
sv: Kommentar av %1

source: Comment to %1
fi: Kommentti viestiin %1
sv: Kommentar till %1

source: Latest blog comments
fi: Uusimmat kommentit keskusteluissa
sv: Senaste kommentarer till bloggar

source: Latest blog entries and comments.
fi: Uusimmat viestit ja kommentit
sv: Senaste blogginlägg och kommentarer.

source: Latest blog posts
fi: Uusimmat viestit
sv: Senaste bloggposter

source: No blog comments found.
fi: Ei kommentteja.
sv: Inga kommentarer till bloggar hittades.

source: No blog posts found.
fi: Ei keskusteluviestejä.
sv: Inga bloggposter hittades.

source: Unknown user
fi: Tuntematon käyttäjä
sv: Okänd användare

source: Show more posts
fi: Näytä lisää viestejä
sv: Visa mera poster

source: The message you requested does not exist.
fi: Pyytämääsi viestiä ei löytynyt.
sv: Meddelandet du sökte finns inte.

source: %1 post(s)
fi: %1 viesti(ä)
sv: %1 post(er)

source: Active seeds
fi: Aktiiviset aiheet
sv: Aktiva frön

source: Add popular tags
fi: Lisää suosittuja avainsanoja
sv: Lägg till populära tags

source: Add seed to summary
fi: Lisää aihe yhteenvetoon
sv: Lägg till frö till sammandrag

source: Add suggested tags
fi: Lisää suositeltuja avainsanoja
sv: Lägg till föreslagna tags

source: All seeds
fi: Kaikki aiheet
sv: Alla frön

source: Be the first to add one!
fi: Lisää sinä ensimmäinen!
sv: Var den första att lägg till en!

source: Browse all posts
fi: Selaa kaikkia viestejä
sv: Bläddra alla poster

source: Browse my own posts
fi: Selaa omia viestejä
sv: Bläddra egna poster

source: Browse posts by contacts
fi: Selaa kontaktien viestejä
sv: Bläddra poster av kontakter

source: Change seed
fi: Vaihda aihetta
sv: Byt frö

source: Closed seeds
fi: Suljetut aiheet
sv: Stängda frön

source: Closing comment
fi: Sulkukommentti
sv: Avslutande kommentar

source: Create a seed
fi: Luo uusi aihe
sv: Skapa ett frö

source: Create seeds
fi: Luo aiheita
sv: Skapa frön

source: Custom creator string
fi: Mukautettu organisoijan kuvaus
sv: Custom creator sträng

source: Edit seed
fi: Muokkaa aihetta
sv: Redigera frö

source: Edit seeds
fi: Muokkaa aiheita
sv: Redigera frön

source: Enable promoting
fi: Mahdollista nostaminen
sv: Möjliggör främjande

source: Enable rating
fi: Mahdollista arvosteleminen
sv: Möjliggör värdering

source: Most recent post on %1
fi: Viimeisin viesti %1
sv: Senaste post om %1

source: Move posts between seeds
fi: Siirrä viestejä aiheesta toiseen
sv: Flytta poster mellan frön

source: Move post to seed "%1"
fi: Siirrä viesti aiheeseen "%1"
sv: Flytta post till frö "%1"

source: My own posts
fi: Omat viestini
sv: Mina egna poster

source: No posts found.
fi: Ei viestejä.
sv: Inga poster hittades.

source: No seeds found.
fi: Ei aiheita.
sv: Inga frön hittades.

source: Organized by %1
fi: Organisoija: %1
sv: Organiserad av %1

source: Post seed assigned.
fi: Viestin aihe asetettu.
sv: Posta frö .

source: Post to seed "%1"
fi: Kirjoita viesti aiheeseen "%1"
sv: Posta till frö "%1"

source: Remove post from seed
fi: Poista viesti aiheesta
sv: Radera post från fröt

source: Remove seed
fi: Poista aihe
sv: Radera frö

source: Remove seed from summary
fi: Poista aihe yhteenvedosta
sv: Radera frÃ¶ frÃ¥n Översikten

source: Reopen seed
fi: Avaa aihe uudelleen
sv: Återöppna frö

source: Seed
fi: Aihe
sv: Frö

source: Seed added to summary.
fi: Aihe lisätty yhteenvetoon.
sv: Fröt lades till Översikten.

source: Seed closed.
fi: Aihe suljettu.
sv: Frö avslutat.

source: Seed created
fi: Aihe luotu
sv: Frö skapat

source: Seed guide
fi: Aiheiden ohje
sv: Guide över frön

source: Seed has been closed and no further contributions will be accepted.
fi: Aihe on suljettu eikä enempää kontribuutioita enää hyväksytä.
sv: Fröet avslutat, ytterligare inlägg är inte möjliga.

source: Seed information
fi: Aiheen tiedot
sv: Information om fröt

source: Seed promoted.
fi: Aihe nostettu esiin.
sv: Frö har blivit främjat.

source: Seed promotion removed.
fi: Aiheen esiinnosto poistettu.
sv: Främjandet av fröt har avlägsnats.

source: Seed removed.
fi: Aihe poistettu.
sv: Frö raderat.

source: Seed removed from summary.
fi: Aihe poistettu yhteenvedosta.
sv: Frö raderat från sammandrag.

source: Seed reopened.
fi: Aihe avattu uudelleen.
sv: Frö återöppnat.

source: Seed updated
fi: Aihe päivitetty
sv: Frö updaterat

source: Select new seed
fi: Valitse uusi aihe
sv: Välj ett nytt frö

source: Select seed to post to
fi: Valitse aihe, johon haluan kirjoittaa
sv: Välj frö att posta till

source: Show seeds
fi: Näytä aiheet
sv: Visa frön

source: Unpromote seed
fi: Poista aiheen esiinnosto
sv: Avlägsna befording av frö

source: User can create seeds
fi: Käyttäjä voi luoda aiheita
sv: Användare kan skapa frön

source: User can edit other's seeds
fi: Käyttäjä voi muokata muiden aiheita
sv: Användare kan redigera andras frön

source: User change post seeds
fi: Käyttäjä voi vaihtaa viestien aiheita
sv: Användare kan byta frön

source: Views
fi: Näkymät
sv: Vyer

source: Write a post without a seed
fi: Kirjoita viesti ilman aihetta
sv: Skriv en post utan ett frö

source: You are moving post titled "%1" into a new seed. Please select one of the options below:
fi: Olet siirtämässä viestiä nimeltä "%1" uuteen aiheeseen. Ole hyvä ja valitse aihe allaolevista vaihtoehdoista:
sv: Du håller på att flytta post med namnet "%1" till ett nytt frö. Var god välj ett av alternativen nedan:

source: You can not edit a post in a closed seed.
fi: Et voi muokata suljetussa aiheessa olevaa viestiä.
sv: Du kan inte ändra en post som ligger i ett stängt frö.

source: You can not post to a closed seed.
fi: Et voi kirjoittaa viestiä suljettuun aiheeseen.
sv: Du kan inte posta till ett stängt frö.

source: You must fill both title and description.
fi: Sekä otsikko, että kuvaus on annettava.
sv: Du måste fylla i både namn och beskrivning.

source: Seeds tagged with: %1
fi: Aiheet avainsanoin: %1
sv: Frön taggade med: %1

source: All seeds tagged with: %1
fi: Kaikki aiheet avainsanoin: %1
sv: Alla frön taggade med: %1

source: Closed seeds tagged with: %1
fi: Suljetut aiheet avainsanoin: %1
sv: Stänga frön taggade med: %1

source: Featured posts tagged with: %1
fi: Esitellyt viestit avainsanoin: %1
sv: Befordrade poster taggade med: %1

source: Posts by %2 tagged with: %1
fi: Käyttäjän %2 viestit avainsanoin: %1
sv: Poster av %2 taggade med: %1

source: Posts by contacts tagged with: %1
fi: Kontaktien viestit avainsanoin: %1
sv: Poster av kontakter taggade med: %1

source: Most promoted posts tagged with: %1
fi: Nostetuimmat viestit avainsanoin: %1
sv: Mest befordrade poster taggade med: %1

source: My own posts tagged with: %1
fi: Omat viestini avainsanoin: %1
sv: Mina egna poster taggade med: %1

source: New posts tagged with: %1
fi: Uudet viestit avainsanoin: %1
sv: Nya poster taggade med: %1

source: Close seed
fi: Sulje aihe
sv: Stäng frö

source: Create
fi: Luo
sv: Skapa

source: Promoted
fi: Esittelyssä
sv: Befordra

source: Promote seed
fi: Nosta aihe esiin
sv: Befordra frö

source: Add attachment
fi: Lisää liite
sv: Lägg till bilaga

source: Attachments
fi: Liitteet
sv: Bilagor

source: The file you requested does not exist.
fi: Pyytämääsi tiedostoa ei löytynyt.
sv: Filen du sökte finns inte till.

source: No tags.
fi: Ei avainsanoja.
sv: Inga tags.

source: (Drag & drop links and images to the editor window)
fi: (Voit raahata linkkejä ja kuvia kirjoituslaatikkoon)
sv: (Dragga & droppa länkar och bilder till redigeringsrutan)

source: Save & continue editing
fi: Tallenna ja jatka muokkausta
sv: Spara & fortsätt redigera

source: Publish & continue editing
fi: Julkaise ja jatka muokkausta
sv: Publicera & fortsätt redigera

source: Add missing tags
fi: Lisää puuttuvia avainsanoja
sv: Lägg till tags som fattas

source: Add tags to post
fi: Lisää avainsanoja viestiin
sv: Lägg till tags till post

source: Add tags to posts
fi: Lisää avainsanoja viesteihin
sv: Lägg till tags till poster

source: Click to add popular tags
fi: Lisää usein käytettyjä avainsanoja painamalla
sv: Klicka för att lägga till populära tags

source: Click to add suggested tags
fi: Lisää suositeltuja avainsanoja painamalla
sv: Klicka för att lägga till föreslagna tags

source: Save tag changes
fi: Tallenna avainsanojen muutos
sv: Spara ändringar till tags

source: Tags of post "%1"
fi: Viestin "%1" avainsanat
sv: Tags i posten "%1"

source: Tags updated.
fi: Avainsanat päivitetty.
sv: Tags uppdaterade.

source: The user whose files you requested does not exist.
fi: Tiedoston omistajaa ei löytynyt.
sv: Användaren vars filer du sökte finns inte.

source: User add tags to posts
fi: Käyttäjä voi lisätä avainsanoja viesteihin
sv: Användare kan lägga till tags till poster

source: User can change post seeds
fi: Käyttäjä voi vaihtaa viestien aiheita
sv: Användare kan ändra postade frön

source: Add tags to post "%1"
fi: Lisää avainsanoja viestiin "%1"
sv: Lägg till tags till posten "%1"

source: Post information
fi: Viestin tiedot
sv: Information om posten

source: tagged with: %1
fi: avainsanoin: %1
sv: taggad med: %1

source: Write a message
fi: Kirjoita viesti
sv: Skriv ett meddelande

source: tagged with:
fi: avainsanalla:
sv: taggad med:

source: Posts by contacts
fi: Kontaktieni viestit
sv: Poster av kontakter

source: Delete message
fi: Poista viesti
sv: Radera meddelande

source: Featured posts
fi: Esittelyssä
sv: Befordrade poster

source: Posts
fi: Viestit

source: Posts tagged with: %1
fi: Viestit avainsanoin: %1
sv: Poster taggade med: %1

source: Featured posts
fi: Esitellyt viestit
sv: Befordrade poster

source: Best rated posts tagged with: %1
fi: Arvostetuimmat viestit avainsanoin: %1
sv: Högst bedömda poster taggade med: %1

source: My posts tagged with: %1
fi: Omat viestini avainsanoin: %1
sv: Mina poster taggade med: %1

source: Click to add tags popular elsewhere
fi: Lisää muualla usein käytettyjä avainsanoja painamalla
sv: Välj taggar populära annanstans

source: Click to add tags popular in this seed
fi: Lisää tässä aiheessa usein käytettyjä avainsanoja painamalla
sv: Välj taggar populära i detta frö

source: Contribute to blogs
fi: Kontribuoi blogiosioon
sv: Bidrag till bloggarna

source: Manage blogs
fi: Hallinnoi keskusteluja
sv: Hantera bloggar

source: Post to blogs
fi: Kirjoita keskusteluun
sv: Skriv blogginlägg

source: User can post to blogs
fi: Käyttäjä voi kirjoittaa keskusteluun
sv: Användaren kan skriva bloggposter

source: Seeds
fi: Aiheet
sv: Frön

source: Feature post
fi: Nosta esiin
sv: Nosta esiin

source: Unfeature post
fi: Poista esille nosto
sv: Poista esille nosto

source: Reseed
fi: Vaihda aihetta
sv: Vaihda aihetta

source: Posts by tag
fi: Viestit avainsanalla
sv: Poster med tag

source: Reposter saved.
fi: Uudelleenlähettäjä tallennettu.

source: Topics by tag
fi: Aiheet avainsanalla
sv: Frön med tag

source: Exclude posts from mail digest
fi: Poista viestit sähköopstimuistutuksesta

source: Exclude posts from summary
fi: Poista viestit yhteenvetolaatikosta

source: Source:
fi: Lähde:

source: Conversations
fi: Keskustelut

source: Latest conversation comments
fi: Uusimmat keskusteluiden kommentit

source: Latest conversations
fi: Uusimmat keskustelut

source: No conversation comments found.
fi: Keskustelukommentteja ei löytynyt.

source: No conversations found.
fi: Keskusteluja ei löytynyt.

source: Edit message
fi: Muokkaa viestiä

source: Posts
fi: Viestit

source: No comments
fi: Ei kommentteja

source: One comment
fi: Yksi kommentti

source: Related events
fi: Liitetyt tapahtumat

source: Move to an another topic
fi: Siirrä toiseen aiheeseen
