Repository: meetings/core
Catalog: pkg/dicole_comments/msg/messages-*.po
Languages: fi

source: comment_approval_email_subject_template
fi: Hyväksyttävä kommentti: [% sender_first_name %] kommentoi [% object_name %][% IF group_name %] alueella [% group_name %][% END %] ([% server_name %])

source: comment_approval_email_text_template
fi: [% sender_name %] kommentoi [% object_name %]! Tässä kommentin sisältö:[% comment_content_text %]Hyväksy kommentti täältä:[% object_url %]

source: comment_approval_email_html_template
fi: <p>[% sender_name | html %] <a href="[% comment_url | html %]">kommentoi</a> <a href="[% object_url | html %]">[% object_name | html %]</a>! Tässä kommentin sisältö:</p>[% comment_content_html %]<p><b>Hyväksy kommentti <a href="[% comment_url | html %]">täältä</a>!</b></p>

source: Submit comment
fi: Lähetä kommentti

source: Comment content
fi: Kommentin sisältö

source: Write your comment:
fi: Kirjoita kommenttisi:

source: Confirm comment delete
fi: Poista kommentti

source: Cancel comment delete
fi: Peruuta

source: Latest comments
fi: Viimeisimmät kommentit

source: blog post \"%1\"
fi: viesti \"%1\"

source: Group latest comments summary
fi: Ryhmän kaikkien viimeisten kommenttien yhteenveto

source: media object \"%1\"
fi: mediaobjekti \"%1\"

source: No comments found.
fi: Ei kommentteja.

source: page \"%1\"
fi: sivu \"%1\"

source: your media object \"%1\"
fi: sinun mediaobjektisi \"%1\"

source: your post \"%1\"
fi: sinun viestisi \"%1\"

source: Hide more
fi: Näytä vähemmän

source: Show more
fi: Näytä enemmän

source: Group latest discussion topic summary
fi: Ryhmän viimeisten keskustelunaiheiden yhteenveto

source: Latest discussion topics
fi: Uusimmat keskustelut

source: Earlier discussions
fi: Aikaisemmat

source: More recent discussions
fi: Uudemmat

source: Comment to media %1
fi: Kommentti mediaan %1

source: Comment to page %1
fi: Kommentti sivuun %1

source: Group latest comments summary with faces
fi: Ryhmän viimeisimmät kommentit profiilikuvien kera

source: blog post "%1"
fi: viestiä "%1"

source: event "%1"
fi: tapahtumaa "%1"

source: media object "%1"
fi: mediaobjektia "%1"

source: page "%1"
fi: sivua "%1"

source: There are no discussions available.
fi: Ei keskustelunaiheita.

source: your media object "%1"
fi: sinun mediaobjektiasi "%1"

source: your post "%1"
fi: sinun viestiäsi "%1"

source: Be the first to comment!
fi: Kommentoi ensimmäisenä!

source: Delete comment
fi: Poista kommentti

source: Publish comment
fi: Julkaise kommentti

source: Publish comments
fi: Kommenttien julkaisu

source: User can publish comments in the group
fi: Käyttäjällä on oikeus julkaista kommentteja ryhmän sisällä

source: Your comment is waiting for approval and will be published shortly.
fi: Kommenttisi odottaa hyväksyntää ja julkaistaan piakkoin.

source: Commenting is closed.
fi: Kommentointi on suljettu.

source: Comment to event %1
fi: Kommentti tapahtumaan %1
