Repository: meetings/core
Catalog: pkg/dicole_domain_user_manager/msg/messages-*.po
Languages: fi

source: Domain User Manager
fi: Domainin käyttäjähallinta

source: Add user
fi: Lisää käyttäjä

source: Changes were saved.
fi: Muutokset on tallennettu.

source: Confirmation
fi: Varmennus

source: Edit
fi: Muokkaa

source: English
fi: Englanti

source: Email
fi: Sähköposti

source: Error during delete: %1
fi: Virhe poistettaessa: %1

source: Expiration date
fi: Voimassaolo päättyy

source: Failed adding user: %1
fi: Virhe käyttäjää luotaessa: %1

source: Failed modifying user: %1
fi: Virhe käyttäjää muokatessa: %1

source: Finnish
fi: Suomi

source: First name
fi: Etunimi

source: Language
fi: Kieli

source: Last name
fi: Sukunimi

source: List of users
fi: Käyttäjälista

source: List of domain users
fi: Domainin käyttäjälista

source: List of users in the domain
fi: Domainin käyttälista

source: List users
fi: Listaa käyttäjät

source: Login name
fi: Käyttäjänimi

source: Modify user details
fi: Muokkaa käyttäjän tietoja

source: New user details
fi: Uuden käyttäjän tiedot

source: Password
fi: Salasana

source: Remove selected users
fi: Poista valitut käyttäjät

source: Remove users
fi: Poista käyttäjiä

source: Save
fi: Tallenna

source: Selected users removed.
fi: Valitut käyttäjät poistettu.

source: Show list of users
fi: Näytä käyttäjälista

source: Show
fi: Näytä

source: Unlimited
fi: Rajoittamaton

source: User details
fi: Käyttäjätiedot

source: User has been saved.
fi: Käyttäjä tallennettu.

source: User Manager
fi: Käyttäjähallinta

source: Verify password
fi: Varmista salasana

source: Manage users
fi: Käyttäjien hallintaoikeus

source: User can add, edit and remove other users
fi: Käyttäjä voi lisätä, muokata ja poistaa muita käyttäjiä

source: Are you sure you want to remove the selected users?
fi: Oletko varma, että haluat poistaa valitut käyttäjät?

source: Registration
fi: Rekisteröityminen

source: Register
fi: Rekisteröityminen

source: Register new account
fi: Rekisteröi uusi tunnus

source: User registration is not allowed.
fi: Käyttäjän rekisteröinti ei ole mahdollista.

source: Login name %1 already exists. Choose another login name.
fi: Käyttäjätunnus nimeltä %1 on jo olemassa. Valitse toinen käyttäjätunnus.

source: Registration done. We have sent you an email containing your login information.
fi: Rekisteröinti suoritettu. Teille on lähetetty sähköpostia, joka sisältää kirjautumistiedot.

source: Registration failed: %1
fi: Rekisteröinti epäonnistui: %1

source: Registration information
fi: Rekisteröintitiedot

source: Registration information from %1
fi: Rekisteröintitiedot palvelusta %1

source: Error sending email: %1
fi: Virhe lähetettäessä sähköpostia: %1

source: User with email address %1 already exists. Choose a different email address.
fi: Käyttäjä jonka sähköpostiosoite on %1 on jo olemassa. Anna eri sähköpostiosoite.

source: Reset of all user default personal rights was successful.
fi: Kaikkien käyttäjien peruskäyttöoikeudet on palautettu oletusarvoihin.

source: Import users
fi: Tuo käyttäjiä

source: File to upload
fi: Palvelimelle siirrettävä tiedosto

source: Upload
fi: Siirrä palvelimelle

source: Import new users from an Excel sheet
fi: Tuo uusia käyttäjiä Excel taulukosta

source: %1 user(s) imported.
fi: %1 käyttäjä(ä) tuotu järjestelmään.

source: Upload a valid Excel file.
fi: Valitse toimiva Excel taulukko.

source: The following rows failed: %1
fi: Seuraavien Excel taulukon rivien tuonti ei onnistunut: %1

source: Failed importing users: %1
fi: Käyttäjien tuonti epäonnistui: %1

source: Upload Excel sheet
fi: Siirrä Excel taulukko

source: Users registered in the system
fi: Järjestelmään rekisteröityneet käyttäjät

source: Number of logins
fi: Kirjautumisten määrä

source: Last login
fi: Viimeisin kirjautuminen

source: Name
fi: Nimi

source: Description
fi: Kuvaus

source: Groups user belongs to
fi: Ryhmät joihin käyttäjä kuuluu

source: Theme
fi: Teema

source: Default
fi: Oletus

source: URL of a custom starting page
fi: Vaihtoehtoisen aloitussivun URL

source: Login disabled
fi: Kirjautuminen disabloitu

source: You are not allowed to view this domain
fi: Käyttöoikeutesi eivät riitä domainin hallinnointiin

source: You are not allowed to edit this domain
fi: Käyttöoikeutesi eivät riitä domainin hallinnointiin

source: You are not allowed to view this user
fi: Käyttöoikeutesi eivät riitä käyttäjän hallinnointiin

source: You are not allowed to edit this user
fi: Käyttöoikeutesi eivät riitä käyttäjän hallinnointiin

source: Existing user %1 with email address %2 added to this domain, please inform the user in question
fi: Olemassaoleva käyttäjä %1 sähköpostiosoitteella %2 lisättiin domainiin, ole hyvä ja ilmoita lisäyksestä käyttäjälle

source: Access domain management
fi: Pääsy domainhallintaan

source: Domain management
fi: Domainhallinta

source: Domain manager
fi: Domainin hallitsija

source: No groups.
fi: Ei ryhmiä.

source: Account registration
fi: Tunnuksen luonti

source: Domain administrator email address
fi: Domain-hallinnoijan sähköpostiosoite

source: Restrict access to listed IP addresses
fi: Rajoita pääsy vain listattuihin IP -osoitteisiin

source: IP addresses (one per line)
fi: IP -osoitteet (yksi per rivi)

source: Hide community
fi: Piilota yhteisö

source: Error during remove
fi: Virhe poiston yhteydessä

source: Failed to add user with email address %1 to domain.
fi: Käyttäjän domainiin lisääminen ei onnistu osoitteella %1

source: Manage domain users
fi: Hallitse domainin käyttäjiä

source: Management area
fi: Hallinta-alue

source: User already in domain.
fi: Käyttäjä on jo domainissa.

source: User can add, edit and remove other users in the domain
fi: Käyttäjä voi lisätä, muokata ja poistaa käyttäjiä domainissa

source: Users registered in the domain
fi: Domainiin rekisteröidyt käyttäjät

source: Alternative login URL
fi: Vaihtoehtoinen login URL

source: CSV ids of initial groups
fi: CSV idt aloitusryhmistä

source: Custom footer HTML
fi: Footer HTML

source: Email content for invites
fi: Kutsuviestien sisältö

source: Hide my area
fi: Piilota oma alue

source: Limit of invites per user
fi: Kutsuviestien määrä

source: Subject of invite email
fi: Kutsuviestien otsikko

source: Hours before invites replenish (0: never)
fi: Kutsuviestin palautumisen raja tunneissa (0: ei koskaan)

source: Alternative front page
fi: Vaihtoehtoinen etusivu

source: Disable user
fi: Poista käyttäjä käytöstä

source: Domain notifcations sender email address
fi: Muistutusten lähettäjän sähköpostiosoite

source: Email content (html) for comment notifications
fi: Emailin sisältö (html) kommenttimuistutuksille

source: Email content (text) for comment notifications
fi: Emailin sisältö (text) kommenttimuistutuksille

source: Enable user
fi: Ota käyttäjä käyttöön

source: Hide general settings
fi: Piilota yleiset asetukset

source: Login users in after registering
fi: Kirjaa käyttäjä sisään heti rekisteröitymisen jälkeen

source: Subject of comment notification email
fi: Emailin otsikko kommenttimuistutuksille

source: Custom favicon url
fi: Vapaavalintainen favicon URL

source: Disable email digests
fi: Kytke sähköpostikoosteet pois päältä

source: Disable email notifications
fi: Kytke sähköpostimuistutukset pois päältä

source: Domain admin
fi: Domainin ylläpitäjä

source: Enable caching for certain tag lists
fi: Käytä välimuistia tietyissä avainsanalistossa

source: Google maps API key for domain
fi: Google maps API avain

source: Link to required terms of service
fi: Linkki vaadittuihin käyttöehtoihin

source: Facebook Connect disabled
fi: Facebook Connect kytketty pois päältä

source: Link to general instructions for the service
fi: Linkki järjestelmän yleisiin ohjeisiin

source: Facebook Connect enabled
fi: Facebook Connect kytketty päälle

source: Custom body start HTML
fi: Body start HTML
