Repository: meetings/core
Catalog: pkg/dicole_domains/msg/messages-*.po
Languages: fi

source: You are not allowed to login from this domain. Please try one of the following domains: %1
fi: Sinulla ei ole oikeutta kirjautua tästä verkkotunnuksesta. Yritä jostakin seuraavista: %1

source: Domain not yet configured.
fi: Verkkotunnusta ei ole vielä määritelty.

source: Add domain
fi: Lisää verkkotunnus

source: Default
fi: Oletus

source: Domain details
fi: Verkkotunnuksen tiedot

source: Domain has been saved.
fi: Domain on tallennettu.

source: Domain Manager
fi: Verkkotunnushallinta

source: Domain name
fi: Verkkotunnus

source: List domains
fi: Listaa verkkotunnukset

source: List of domains
fi: Lista verkkotunnuksista

source: Location of logo
fi: Logon sijainti

source: Manage domains
fi: Hallitse verkkotunnuksia

source: Modify domain details
fi: Muokkaa verkkotunnuksen tietoja

source: Remove domains
fi: Poista verkkotunnuksia

source: Selected domains removed.
fi: Valitut verkkotunnukset on poistettu.

source: Show list of domains
fi: Näytä lista verkkotunnuksista

source: Theme
fi: Teema

source: User can add, edit and remove domains
fi: Käyttäjä voi lisätä, muokata ja poistaa verkkotunnuksia

source: Are you sure you want to remove the selected domains?
fi: Oletko varma, että haluat poistaa merkityt verkkotunnukset?

source: New domain details
fi: Uuden verkkotunnuksen tiedot

source: Groups that belong to this domain
fi: Ryhmät jotka kuuluvat tähän verkkotunnukseen

source: Users who belong to this domain
fi: Käyttäjät jotka kuuluvat tähän verkkotunnukseen

source: Users
fi: Käyttäjät

source: Groups
fi: Ryhmät

source: Cancel
fi: Peruuta

source: Edit
fi: Muokkaa

source: Organization
fi: Organisaatio

source: Identification number
fi: Y-tunnus

source: Customer number
fi: Asiakasnumero

source: Address
fi: Osoite

source: Contact person
fi: Yhteyshenkilö

source: Phone number
fi: Puhelinnumero

source: Postal number
fi: Postinumero

source: City
fi: Kaupunki

source: Country
fi: Maa

source: Services and notes
fi: Palvelut ja lisätiedot

source: Last payment
fi: Viimeinen maksusuoritus

source: Email
fi: Sähköposti

source: Users last month
fi: Käyttäjiä viime kuussa

source: Account registration enabled
fi: Tunnusten rekisteröinti mahdollista

source: New accounts default to disabled
fi: Uudet rekisteröidut tunnukset poiskytkettyjä

source: Domain admins
fi: Verkkotunnuksen ylläpitäjät

source: This site has IP address restrictions and you are not allowed to access this site. Blocked IP: %1
fi: Tällä sivulla on IP osoitteiden suhteen rajoituksia, joiden johdosta pääsysi tälle sivulle on estetty. Estetty IP: %1

source: Custom navigation
fi: Räätälöity navigaatio

source: Custom new user actions
fi: Räätälöity toiminta uudelle käyttäjälle

source: Default language
fi: Oletuskieli

source: URL after logout
fi: Uloskirjautumisen jälkeinen URL

source: Default timezone
fi: Oletusaikavyöhyke

source: URL after login
fi: Sisäänkirjautumisen jälkeinen URL

source: Users this month
fi: Käyttäjiä tässä kuussa

source: Users month before last
fi: Käyttäjiä toissa kuussa
