Repository: meetings/core
Catalog: pkg/dicole_networking/msg/messages-*.po
Languages: fi

source: Add and remove contacts of a user
fi: Lisää ja poista käyttäjän kontakteja

source: Add contact
fi: Lisää kontakti

source: Address 1
fi: Osoite 1

source: Address 2
fi: Osoite 2

source: Blog:
fi: Blogi:

source: Blog URL
fi: Blogin osoite

source: Contact & personal
fi: Henkilökohtaiset ja yhteystiedot

source: Contact & personal information
fi: Henkilökohtaiset ja yhteystiedot

source: Contacts of %1
fi: Käyttäjän %1 kontaktit

source: Edit contact & personal information
fi: Muokkaa henkilökohtaisia ja yksityistietoja

source: Edit education information
fi: Muokkaa koulutustietoja

source: Edit employer information
fi: Muokkaa työnantajatietoja

source: Edit networking profile
fi: Muokkaa verkostoitumisprofiilia

source: Edit networking profile of a user
fi: Muokkaa käyttäjän verkostoitumisprofiilia

source: Educational information
fi: Koulutustiedot

source: Employer
fi: Työnantaja

source: Employer name
fi: Tyonantajan nimi

source: Explore network
fi: Selaa verkostoa

source: Facebook account
fi: Facebook osoite

source: Ideas
fi: Ideat

source: Invite new members
fi: Kutsu uusia jäseniä

source: Twitter account
fi: Twitter tunnus

source: Linkedin account
fi: Linkedin tunnus

source: Manage user contacts
fi: Käyttäjän kontaktien hallinta

source: My contacts
fi: Omat kontaktit

source: Navigation
fi: Navigointi

source: Networking
fi: Verkosto

source: Networking tool
fi: Verkostoitumistyökalu

source: Never
fi: Ei koskaan

source: Organizational title
fi: Nimike organisaatiossa

source: People you might know
fi: Ihmisiä, joita saatat tuntea

source: Personal motto
fi: Henkilökohtainen motto

source: Phone:
fi: Puhelin:

source: Professional description
fi: Ammatillinen kuvaus

source: Professional information
fi: Ammatilliset tiedot

source: profile
fi: ihminen

source: profiles
fi: ihmistä

source: Remove contact
fi: Poista kontakti

source: Sampling of contacts
fi: Otos kontakteista

source: Show all contacts
fi: Näytä kaikki kontaktit

source: Show all posts
fi: Näytä kaikki viestit

source: Skill profile
fi: Osaamisprofiili

source: Skype account
fi: Skype tunnus

source: Statistics
fi: Käyttötietoja

source: Tags of interest
fi: Kiinnostuksen alaiset avainsanat

source: Upload portrait
fi: Lähetä kuva

source: View contacts of a user
fi: Näe käyttäjän kontaktit

source: View networking profiles
fi: Näe käyttäjien profiilit

source: View user contacts
fi: Näytä käyttäjän kontaktit

source: My profile
fi: Oma profiili

source: Add and remove personal contacts
fi: Lisää ja poista omia kontakteja

source: Edit personal networking profile
fi: Oman profiilin muokkaus

source: Edit personal networking profile of a user
fi: Käyttäjän profiilin muokkaus

source: Manage personal contacts
fi: Henkilökohtaisten kontaktien hallinta

source: Networking rights
fi: Verkostotyökalun oikeudet

source: View contacts
fi: Näytä kontaktit

source: View contacts of users
fi: Näytä käyttäjien kontaktit

source: View profiles
fi: Näytä profiilit

source: Add personal tags
fi: Lisää henkilökohtaisia avainsanoja

source: Edit personal tags
fi: Muokkaa henkilökohtaisia avainsanoja

source: No people found.
fi: Henkilöä ei löytynyt.

source: Personal tags
fi: Henkilökohtaiset avainsanat

source: Personal tags updated.
fi: Henkilökohtaiset avainsanat päivitetty.

source: Save changes
fi: Tallenna muutokset

source: Requested user was not found.
fi: Haettua käyttäjää ei löytynyt.

source: Add more members
fi: Lisää käyttäjiä

source: Admins
fi: Ylläpitäjät

source: Last active users
fi: Aktiiviset käyttäjät

source: Most active members
fi: Aktiivisimmat käyttäjät

source: New members
fi: Uudet käyttäjät

source: Requsted user was not found.
fi: Haettua käyttäjää ei löytynyt.

source: Show all users
fi: Näytä kaikki käyttäjät

source: Skills and interests
fi: Osaaminen ja kiinnostuksen kohteet

source: Last visitors
fi: Viimeksi paikalla

source: Show more keywords
fi: Näytä lisää avainsanoja

source: With keywords
fi: Avainsanoilla

source: %1 people
fi: %1 ihmistä

source: 1 person
fi: 1 henkilö

source: Edit profile information
fi: Muokkaa profiilin tietoja

source: Invite by adding e-mail addresses (separate with commas)
fi: Kutsu sähköpsotin perusteella (erottele pilkulla)

source: Invite new users
fi: Kutsu uusia käyttäjiä

source: Invite the users
fi: Kutsu käyttäjät

source: Level for invited users
fi: Uusie käyttäjien käyttäjätaso

source: Show profile information
fi: Näytä profiilin tiedot

source: LinkedIn-page
fi: LinkedIn-sivu

source: Manage users (action)
fi: Hallitse käyttäjiä

source: Show user listing
fi: Näytä käyttäjälistaus

source: Browse people
fi: Selaa ihmisiä

source: Degree
fi: Tutkinto

source: Education
fi: Koulutus

source: Error while converting image.
fi: Virhe muokattaessa kuvaa.

source: Image to upload
fi: Siirrettävä kuva

source: Image to upload in GIF or JPG format
fi: Palvelimelle siirrettävä kuva GIF tai JPG muodossa

source: Image uploaded.
fi: Kuva siirretty.

source: Other degree
fi: Muu tutkinto

source: School
fi: Koulu

source: Show profile
fi: Näytä profiili

source: Target degree
fi: Tavoiteltu tutkinto

source: People (navigation)
fi: Ihmiset

source: About
fi: Muita tietoja

source: Bookmarked media
fi: Kirjanmerkeissä oleva media

source: Bookmarked pages
fi: Kirjanmerkeissä olevat sivut

source: Check to send privately
fi: Ruksaa lähettääksesi yksityisesti

source: Leave a message
fi: Jätä viesti

source: Send message
fi: Lähetä viesti

source: New search by name
fi: Hae nimellä uudelleen

source: People search
fi: Ihmisten haku

source: Search by name
fi: Hae nimellä
