Repository: meetings/core
Catalog: pkg/dicole_files/msg/messages-*.po
Languages: fi, sv

source: Add folder
fi: Lisää kansio
sv: Tillägg mapp

source: Adding document failed: %1
fi: Dokumentin lisäys epäonnistui: %1
sv: Tilläggning av dokument misslyckades: %1

source: Adding folder failed: %1
fi: Kansion lisäys epäonnistui: %1
sv: Tillägning av mapp misslyckades: %1

source: Adding hyperlink failed: %1
fi: Linkin lisäys epäonnistui: %1
sv: Tilläggning av hyperlänk misslyckades: %1

source: Add new document
fi: Lisää uusi dokumentti
sv: Tillägg nytt dokument

source: Add new folder
fi: Lisää uusi kansio
sv: Tillägg ny mapp

source: Add new hyperlink
fi: Lisää uusi linkki
sv: Tillägg ny hyperlänk

source: Cancel
fi: Peruuta
sv: Avbryt

source: Changes saved.
fi: Muutokset tallennettu.
sv: Ändringarna har sparats.

source: Checked items
fi: Merkityt kohteet

source: Choose license
fi: Valitse lisenssi
sv: Välj licens

source: Clipboard is empty.
fi: Leikekirja on tyhjä.

source: Close
fi: Sulje
sv: Stäng

source: Contributor
fi: Muu tekijä

source: Copy
fi: Kopioi
sv: Kopiera

source: Coverage
fi: Kattavuus

source: Creation date
fi: Luontiaika

source: Creator
fi: Tekijä

source: Custom license
fi: Oikeudet
sv: licens

source: Cut
fi: Leikkaa
sv: Klipp

source: Delete
fi: Poista
sv: Radera

source: Description
fi: Kuvaus
sv: Beskrivning

source: Document content
fi: Dokumentin kuvaus
sv: Dokumentets innehåll

source: Document name
fi: Dokumentin nimi
sv: Dokumentets namn

source: Documents
fi: Dokumentit
sv: Dokument

source: Download as Tar/gz archive
fi: Lataa Tar/gz pakattuna tiedostona
sv: Ladda ner som Tar/gz arkiv

source: Download as Zip archive
fi: Lataa Zip pakattuna tiedostona
sv: Ladda ner som Zip arkiv

source: Download
fi: Lataa
sv: Ladda ner

source: Download RDF/XML metadata
fi: Lataa RDF/XML metadata
sv: Ladda ner RDF/XML metadata

source: Edit content
fi: Muokkaa sisältöä
sv: Redigera innehåll

source: Edit Dublin Core metadata
fi: Muokkaa Dublin Core metadataa
sv: Redigera Dublin Core metadata

source: Edit
fi: Muokkaa
sv: Redigera

source: Edit file
fi: Muokkaa tiedostoa
sv: Redigera fil

source: Edit metadata
fi: Muokkaa metadataa
sv: Redigera metadata

source: file_name
fi: tiedoston_nimi
sv: fil_namn

source: Files
fi: Tiedostot
sv: Filer

source: File to upload
fi: Ladattava tiedosto
sv: File som laddas upp

source: Folder name
fi: Kansion nimi
sv: Mappens namn

source: Format
fi: Formaatti
sv: Formattera

source: Hyperlink location
fi: Linkin osoite
sv: Hyperlänkens

source: Hyperlink name
fi: Linkin nimi
sv: Hyperlänkens namn

source: Language
fi: Kieli
sv: Språk

source: License
fi: Oikeudet
sv: Licens

source: Location: %1
fi: Sijainti: %1

source: Modified
fi: Muokattu

source: Modifying file failed: %1
fi: Tiedoston muokkaus epäonnistui: %1

source: Name
fi: Nimi
sv: Namn

source: New document
fi: Uusi dokumentti
sv: Nytt dokument

source: New hyperlink
fi: Uusi linkki
sv: Ny hyperlänk

source: No files or directories selected.
fi: Tiedostoja tai kansioita ei ole valittu.
sv: Inga filer eller bibliotek valda.

source: Number of files
fi: Tiedostojen lukumäärä
sv: Antal filer

source: Open
fi: Avaa
sv: Öppna

source: Password
fi: Salasana
sv: Lösenord

source: Pasted the contents of clipboard.
fi: Tiedot liitetty leikepöydältä.

source: Paste
fi: Liitä
sv: Klistra

source: Properties
fi: Ominaisuudet
sv: Egenskaper

source: Publisher
fi: Tekijä

source: Rename location
fi: Nimeä kohde uudelleen

source: Rename
fi: Nimeä kohde uudelleen

source: Renaming location failed: %1
fi: Sijainnin nimeäminen epäonnistui: %1

source: Return to home
fi: Palaa kotiin

source: Resource identifier
fi: Identifiointitunnus

source: Resource type
fi: Resurssityyppi

source: Rights
fi: Oikeudet
sv: Rättigheter

source: Root directory cannot be deleted.
fi: Juurihakemistoa ei voida poistaa.

source: Save
fi: Tallenna
sv: Spara

source: Saving changes failed: %1
fi: Muutosten tallennus epäonnistui: %1
sv: Sparandet av ändringarna misslyckades: %1

source: Security violation. No rights to delete location %1
fi: Turvallisuusvirhe. Ei oikeuksia poistaa kohdetta %1

source: Security violation. No rights to read location %1
fi: Turvallisuusvirhe. Ei oikeuksia lukea kohdetta %1

source: Security violation. No rights to write to location %1
fi: Turvallisuusvirhe. Ei oikeuksia kirjoittaa kohteeseen %1

source: Select action for:
fi: Valitse toiminto:

source: Selected files and directories copied to clipboard.
fi: Valitut tiedosto ja kansiot kopioitu leikepöydälle.

source: Selected files and directories deleted.
fi: Valitut tiedostot ja kansiot poistettu.

source: Selected files and directories moved to clipboard.
fi: Valitut tiedostot ja kansiot siirretty leikepöydälle.

source: Selected item
fi: Valittu kohde

source: Select file
fi: Valitse tiedosto
sv: Välj fil

source: Select license
fi: Valitse lisenssi
sv: Välj licens

source: Select
fi: Valitse
sv: Välj

source: Server
fi: Palvelin

source: Share %1 already exists.
fi: Jako %1 on jo olemassa.

source: Share path
fi: Jaon polku

source: Show file view
fi: Näytä tiedostot

source: Size
fi: Koko
sv: Storlek

source: Source
fi: Lähde

source: Stream media files
fi: Toista mediatiedostot

source: Subject and keywords
fi: Aihe ja avainsanat

source: Title
fi: Otsikko
sv: Titel

source: Tree of files and directories
fi: Puunäkymä tiedostoihin ja kansioihin

source: Tree view
fi: Puunäkymä

source: Uncompress
fi: Pura pakkaus

source: Upload failed: %1
fi: Tiedoston siirtäminen palvelimelle epäonnistui: %1
sv: Uppladdning misslyckades: %1

source: Upload file
fi: Siirrä tiedosto palvelimelle
sv: Ladda upp fil

source: Upload new file
fi: Siirrä palvelimelle uusi tiedosto
sv: Ladda upp ny fil

source: Upload
fi: Siirrä tiedosto palvelimelle
sv: Ladda upp

source: Username
fi: Käyttäjänimi
sv: Login-namn

source: View file
fi: Katso tiedosto

source: View
fi: Katso

source: Workgroup
fi: Työryhmä
sv: Arbetsgrupp

source: Read files of a user
fi: Lue käyttäjän tiedostoja

source: User can delete files of a user
fi: Käyttäjä voi poistaa toisen käyttäjän tiedostoja
sv: Användare kan radera en användares filer

source: Read user files
fi: Käyttäjän tiedostojen luku

source: Delete group files
fi: Ryhmän tiedostojen poisto
sv: Radera filer

source: Group files allows a group to keep a shared document manager.
fi: Ryhmän tiedostot -työkalun avulla ryhmä voi jakaa tiedostoja yhteisen dokumentinhallinnan avulla.

source: User can use group files tool
fi: Käyttäjä voi käyttää ryhmän tiedostot -työkalua
sv: Användare kan använda gruppfil-verktyg

source: User can write and create new group files
fi: Käyttäjä voi kirjoittaa ja luoda uusia ryhmän tiedostoja
sv: Användare kan skriva och skapa nya gruppfiler

source: Write group files
fi: Ryhmän tiedostojen kirjoitus
sv: Skriv gruppfiler

source: Delete user files
fi: Ryhmän tiedostojen poisto
sv: Radera filer

source: Deny reading files of a user
fi: Estä toisen käyttäjän tiedostojen lukeminen

source: User can delete existing group files
fi: Käyttäjä voi poistaa ryhmän tiedostoja
sv: Användare kan radera existerande gruppfiler

source: Personal files allows a user to keep a personal file storage.
fi: Tiedostot -työkalun avulla käyttäjä voi pitää henkilökohtaista tiedostoaluetta.

source: User can read files of a user
fi: Käyttäjä voi lukea toisen käyttäjän tiedostoja
sv: Användare kan läsa en användares filer

source: Use group files
fi: Ryhmän tiedostot -työkalun käyttö
sv: Använd gruppfiler

source: Write user files
fi: Käyttäjän tiedostojen kirjoitus
sv: Skriv användarfiler

source: Read group files
fi: Ryhmän tiedostojen luku

source: Read files of a group
fi: Ryhmän tiedostojen luku

source: User can read group files
fi: Käyttäjä voi lukea ryhmän tiedostoja
sv: Användare kan läsa gruppfiler

source: User can write and create new files for a user
fi: Käyttäjä voi kirjoittaa ja luoda uusia tiedostoja toiselle käyttäjälle
sv: Användare kan skriva och skapa nya filer åt en användare

source: No files found.
fi: Ei tiedostoja.
sv: Inga filer hittades.

source: Latest files
fi: Viimeisimmät tiedostot
sv: Senaste filer

source: Uploaded by
fi: Siirtänyt palvelimelle
sv: Uppladdad av

source: Edit metadata after upload
fi: Muokkaa metatietoja siirron jälkeen
sv: Redigera metadata efter uppladdning

source: Edit metadata after save
fi: Muokkaa metatietoja tallennuksen jälkeen
sv: Redigera metadata efter sparning

source: Descend to previous folder
fi: Siirry edelliselle tasolle
sv: Förflytta dig till föregående mapp

source: Add files for a group
fi: Ryhmän tiedostojen lisäys
sv: Tillägg filer för en grupp

source: Add files for a user
fi: Käyttäjän tiedostojen lisäys
sv: Tillägg filer för en användare

source: Add group files
fi: Ryhmän tiedostojen lisäys
sv: Tillägg gruppfiler

source: Add user files
fi: Käyttäjän tiedostojen lisäys
sv: Tillägg användarfiler

source: Deny adding files for a group
fi: Estä ryhmän tiedostojen lisäys
sv: Neka tilläggning av filer för en grupp

source: Deny adding files for a user
fi: Estä käyttäjän tiedostojen lisäys
sv: Neka tilläggning av filer för en användare

source: Deny adding, writing and deleting files of a group
fi: Estä ryhmän tiedostojen lisäys, kirjoitus ja poisto
sv: Neka tilläggning, skrivning och radering av en grupps filer

source: Deny adding, writing and deleting files of a user
fi: Estä käyttäjän tiedostojen lisäys, kirjoitus ja poisto
sv: Neka tilläggning, skrivning och radering av en användares filer

source: Deny reading, writing, adding and deleting files of a user
fi: Estä käyttäjän tiedostojen luku, lisäys, kirjoitus ja poisto
sv: Neka läsning, skrivning, tilläggning och radering av en användares filer

source: Deny reading, writing, deleting and adding files of a group
fi: Estä ryhmän tiedostojen luku, lisäys, kirjoitus ja poisto
sv: Neka läsning, skrivning, tilläggning och radering av en grupps filer

source: User can add files for a user
fi: Käyttäjä voi lisätä tiedostoja toiselle käyttäjälle
sv: Användare kan tillägga filer för en användare

source: User can add new group files
fi: Käyttäjä voi lisätä ryhmälle tiedostoja
sv: Användare kan tillägga nya gruppfiler

source: Read, write, add and delete files of a group
fi: Ryhmän tiedostojen luku, kirjoitus, lisäys ja poisto
sv: Läs, skriv, tillägg och radera en grupps filer

source: Read, write, add and delete files of a user
fi: Käyttäjän tiedostojen luku, kirjoitus, lisäys ja poisto
sv: Läs, skriv, tillägg och radera en användares filer

source: Files rights
fi: Tiedostoalueen oikeudet
sv: Fil-rättigheter

source: Browse Dicole Files
fi: Selaa Dicolen tiedostoja
sv: Bläddra Dicole Filer

source: Image location:
fi: Kuvan sijainti:
sv: Bildens läge:

source: Image selector
fi: Kuvan valitsin

source: Image URL:
fi: Kuvan URL:
sv: URL:

source: In line
fi: Rivillä

source: Left
fi: Vasemmalla
sv: Vänster

source: Right
fi: Oikealla
sv: Höger

source: Link selector
fi: Linkin valitsin

source: Link URL:
fi: Linkin URL:
sv: URL:

source: Image description:
fi: Kuvan kuvaus:
sv: Beskrivning av bilden:

source: Browse local files
fi: Selaa paikallisia tiedostoja
sv: Bläddra lokala filer

source: Latest files.
fi: Viimeisimmät tiedostot.
sv: Senaste filer.
