Repository: meetings/core
Catalog: pkg/dicole_navigation/msg/messages-*.po
Languages: fi, sv

source: Admin area
fi: Ylläpitoalue
sv: Adminområde

source: Group area
fi: Ryhmäalue
sv: Groupområde

source: My Area
fi: Oma alue
sv: Mitt område

source: My groups
fi: Omat ryhmät
sv: Mina grupper

source: Other groups
fi: Muut ryhmät
sv: Övriga grupper

source: Personal area
fi: Oma alue
sv: Personligt område

source: Settings
fi: Asetukset
sv: Inställningar

source: Summary
fi: Yhteenveto
sv: Översikt

source: Tools
fi: Työkalut
sv: Verktyg

source: Log out
fi: Kirjaudu ulos
sv: Logga ut

source: Feedback
fi: Palaute

source: Change area
fi: Vaihda aluetta
sv: Växla område

source: Logout
fi: Kirjaudu ulos
sv: Logga ut

source: My area
fi: Oma alue
sv: Mitt område

source: Visited blogs
fi: Vieraillut blogit
sv: Lästa bloggar

source: Visited general areas
fi: Vieraillut yleiset alueet
sv: Besökta allmänna områden

source: Visited groups
fi: Vieraillut ryhmät
sv: Besökta grupper

source: Other areas
fi: Muut alueet
sv: Andra områden

source: My weblog
fi: Oma blogi
sv: Min blogg

source: Admin (action)
fi: Ylläpito
sv: Admin

source: Write weblog
fi: Kirjoita blogiin
sv: Blogga

source: Blog (action)
fi: blogaa
sv: Blogg

source: Write to my weblog
fi: Kirjoita omaan blogiin
sv: Skriv i min blogg

source: Write to weblog
fi: Kirjoita blogiin
sv: Skriv i blogg

source: Domain managing
fi: Domainhallinta
sv: Domänhantering

source: Look settings
fi: Ulkonäön asetukset
sv: Utseendeinställningar

source: Custom CSS
fi: Räätälöity CSS

source: Logged in as
fi: Kirjautuneena
sv: Loggad in som

source: Login (header)
fi: Kirjautuminen
sv: Inloggning

source: Login (submit)
fi: Kirjaudu
sv: Logga in

source: Log in to participate
fi: Kirjaudu osallistuaksesi
sv: Logga in för att delta

source: Join area
fi: Liity alueelle

source: Remember me on this machine
fi: Muista minut tällä koneella

source: Login (action)
fi: Kirjaudu

source: Connect with Facebook
fi: Yhdistä tunnuksesi Facebook-tunnukseesi

source: Login with your Facebook account
fi: Kirjaudu sisään Facebook-tunnuksellasi

source: You are not yet a member of area "%1". By joining the area your profile will be visible in the people -section and you can participate more!
fi: Et ole jäsen alueella "%1". Liityttyäsi profiilisi näkyy ihmiset -osiossa ja voit vaikuttaa enemmän!

source: Join this group!
fi: Liity joukkoon!

source: Personal
fi: Henkilökohtainen

source: %%groupname%%
sv: %%gruppnamn%%
