Repository: meetings/core
Catalog: pkg/dicole_feedreader/msg/messages-*.po
Languages: fi

source: Access denied.
fi: Pääsy evätty.

source: Add feed
fi: Lisää syöte

source: Attached image
fi: Liitekuva

source: Category
fi: Kategoria

source: Comments
fi: Kommentit

source: Confirmation
fi: Varmistus

source: Contributor
fi: Muu tekijä

source: Copyright
fi: Tekijänoikeus

source: Coverage
fi: Kattavuus

source: Custom title
fi: Oma otsikko

source: Description
fi: Kuvaus

source: Edit
fi: Muokkaa

source: Email this
fi: Lähetä sähköpostitse

source: Enclosure
fi: Liite

source: Error reading OPML file: %1
fi: Virhe luettaessa OPML tiedostoa: %1

source: Export feeds (OPML)
fi: Vie syötteet (OPML)

source: Feed details
fi: Syötteen tiedot

source: Feed reader
fi: Noutaja

source: Feed Reader
fi: Noutaja

source: Feed reader is a tool for reading Atom and RSS news feeds.
fi: Noutaja on työkalu, jolla voidaan lukea RSS ja Atom muotoisia uutisvirtoja ts. syötteitä.

source: Feeds
fi: Syötteet

source: Feed successfully removed.
fi: Syöte on poistettu onnistuneesti.

source: Feed URL
fi: Syötteen www-osoite

source: Feed XML
fi: Syötteen XML

source: Folder
fi: Kansio

source: Format
fi: Formaatti

source: From
fi: Syötteestä

source: Generator
fi: Generaattori

source: Identifier
fi: Identifiointitunnus

source: Imported %1 feed(s) from the OPML file.
fi: Tuotu %1 syötteitä määritellystä OPML -tiedostosta.

source: Import
fi: Tuo syötteitä

source: Import OPML file
fi: Tuo OPML -tiedosto

source: IM this
fi: Lähetä lyhytviestinä

source: Keywords separated with spaces
fi: Avainsanat eroteltuna välilyönneillä

source: Language
fi: Kieli

source: Lastest posts in folder %1
fi: Viimeiset viestit kansiossa %1

source: Last post
fi: Viimeinen viesti

source: Last updated
fi: Viimeksi päivitetty

source: Latest posts from all feeds based on category %1
fi: Viimeisimmät viestit kaikista syötteistä pohjautuen kategoriaan %1

source: Latest posts from all feeds
fi: Viimeisimmät viestit kaikista syötteistä

source: Maintain feed reader
fi: Noutajan hallinta

source: Manage feed reader
fi: Noutajan hallinta

source: Managing editor
fi: Päätoimittaja

source: No posts.
fi: Ei viestejä.

source: Notes
fi: Merkinnät

source: Number of readers
fi: Lukijoita

source: OPML file to upload
fi: Palvelimelle tuotava OPML -tiedosto

source: Provided URL is not a valid feed: %1
fi: Annettu www-osoite ei ole oikea syöte: %1

source: Public
fi: Julkinen

source: Publisher
fi: Julkaisija

source: Relation
fi: Suhde

source: Remove
fi: Poista

source: Rights
fi: Oikeudet

source: Source
fi: Lähde

source: Subject
fi: Aihe

source: Technorati this
fi: Technoratin tiedot

source: This feed will be removed from your list of feeds. Are you sure?
fi: Tämä syöte poistetaan syötteiden listasta. Oletko varma?

source: Title
fi: Nimike

source: Tree of feeds
fi: Syötteet

source: Type
fi: Laji

source: Unable to fetch user object with id %1.
fi: Käyttäjän objektia numero %1 ei voitu hakea.

source: Unable to parse Atom feed: %1
fi: Atom syötteen lukeminen epäonnistui: %1

source: Unable to parse RSS feed: %1
fi: RSS syötteen lukeminen epäonnistui: %1

source: Upload failed: %1
fi: Siirto palvelimelle epäonnistui: %1

source: Upload
fi: Siirrä

source: URL must begin with http:// or https://
fi: Verkko-osoitteen on oltava http:// tai https:// alkuinen

source: Webmaster
fi: Sivuston ylläpitäjä

source: Website
fi: Verkkosivu

source: %1 is not a valid number.
fi: %1 ei ole sopiva numero.

source: %1 - Readers: %2 - Updated: %3
fi: %1 - Lukijoita: %2 - Päivitetty: %3

source: Discovered feeds
fi: Löydetyt syötteet

source: Discover feeds
fi: Etsi syötteitä verkkosivulta

source: URL where to search for feeds
fi: Verkkosivun osoite, mistä syötteitä etsitään

source: Found %1 potential feeds. Click the feed title to add it.
fi: Löytyi %1 mahdollista syötettä. Klikkaa haluamasi syötteen otsikkoa lisätäksesi sen.

source: Version
fi: Versio

source: Back to add form
fi: Takaisin lisäyslomakkeeseen

source: Search
fi: Hae

source: New search
fi: Uusi haku

source: You may use these bookmarklets to subscribe to a website which has a feed available. To install the bookmarklet, add the bookmarklet link to your bookmarks. To use it, simply just click the bookmark when you are on a page you want to subscribe with.
fi: Voit käyttää näitä erikoisominaisuuksilla varustettuja kirjanmerkkejä tilataksesi helposti haluamasi verkkosivun. Verkkosivusta tulee olla saatavilla asianmukainen syöte. Asenna kirjanmerkki siirtämällä linkki selaimesi kirjanmerkkeihin. Käyttääksesi kirjanmerkkiä, klikkaa sitä kun olet haluamallasi sivulla.

source: Bookmarklets
fi: Kirjanmerkit

source: Subscribe with feed reader
fi: Tilaa noutajaan

source: Bookmarklet
fi: Kirjanmerkki

source: Available bookmarklets
fi: Saatavilla olevat kirjanmerkit

source: Modifications to feed were successfully saved.
fi: Muutokset syötteeseen tallennettiin onnistuneesti.

source: No feeds found on the given address.
fi: Syötteitä ei löytynyt annetusta osoitteesta.

source: Download playlist
fi: Lataa soittolista

source: Link
fi: Linkki

source: Show on summary page
fi: Näytä yhteenvetosivulla

source: Remove from summary page
fi: Poista yhteenvetosivulta

source: Group feedreader moderator
fi: Ryhmän noutajan ylläpitäminen

source: Group feedreader user
fi: Ryhmän noutajan lukeminen

source: Deny group feedreader use
fi: Estä ryhmän noutajan lukeminen

source: Deny group feedreader moderation
fi: Estä ryhmän noutajan ylläpitäminen

source: Feedreader rights
fi: Noutajan oikeudet

source: Add shared tool
fi: Lisää jaettu työkalu

source: Available blog feeds
fi: Saatavilla olevat työkalut

source: Tool
fi: Työkalu

source: Feed (%1) successfully added.
fi: Syöte (%1) on lisätty.

source: Refresh
fi: Päivitä

source: Error when updating feed (%1): %2
fi: Virhe päivitettäessä syötettä (%1): %2

source: Feed successfully updated.
fi: Syöte on onnistuneesti päivitetty.

source: You are adding a pre-defined feed. Please select a folder for the feed.
fi: Olet lisäämässä ennalta määriteltyä syötettä. Ole hyvä, ja valitse syötteellesi kansio.

source: Add shared weblog
fi: Lisää jaettu blogi

source: Deny user feedreader managing
fi: Estä noutajan hallinta

source: Read feed reader
fi: Noutajan lukeminen

source: Subscribe
fi: Tilaa

source: Blogs shared directly to this group
fi: Suoraan tälle ryhmälle jaetut blogit

source: Blogs shared directly to you
fi: Suoraan sinulle jaetut blogit

source: Publicly available blogs
fi: Julkisesti saatavilla olevat blogit

source: Subscribe comments
fi: Tilaa kommentit

source: Feed reader: independent extra summary boxes
fi: Noutajan itsenäiset yhteenvetolaatikot

source: Feed reader summary boxes to summary even if feed reader is not selected
fi: Näytä noutajan yhteenvetoon nostetut laatikot, vaikka noutaja ei olisi valittu

source: Latest news in groups feed reader.
fi: Viimeisimmät vistit ryhmän noutajassa

source: Latest news in your feed reader.
fi: Viimeisimmät viestit noutajassa

source: Latest posts
fi: Viimeisimmät viestit

source: Exclude from digest
fi: Älä sisällytä sähköpostikoosteeseen
