Repository: meetings/core
Catalog: pkg/dicole_metadata/msg/messages-*.po
Languages: fi

source: Add type
fi: Lisää tyyppi

source: Add type set
fi: Lisää tyyppikokoelma

source: Are you sure you want to remove the selected type sets?
fi: Oletko varma, että haluat poistaa valitut tyyppikokoelmat?

source: Are you sure you want to remove the selected types?
fi: Oletko varma, että haluat poistaa valitut tyypit?

source: Changes were saved.
fi: Muutokset tallennettiin.

source: Comment
fi: Kommentti

source: Confirmation
fi: Vahvistus

source: Copyright
fi: Tekijänoikeus

source: Definition
fi: Määritelmä

source: Edit
fi: Muokkaa

source: Edit type
fi: Muokkaa tyyppiä

source: Edit type details
fi: Muokkaa tyypin ominaisuuksia

source: Edit type set
fi: Muokkaa tyyppikokoelmaa

source: Edit type set details
fi: Muokkaa tyyppikokoelman ominaisuuksia

source: Error during delete: %1
fi: Poisto epäonnistui: %1

source: Failed adding type set: %1
fi: Tyyppikokoelman lisäys epäonnistui: %1

source: Failed adding type: %1
fi: Tyypin lisäys epäonnistui: %1

source: Failed editing type set: %1
fi: Tyyppikokoelman muokkaus epäonnistui: %1

source: Failed editing type: %1
fi: Tyypin muokkaus epäonnistui: %1

source: Icon
fi: Ikoni

source: List of custom type sets
fi: Mukautettujen tyyppikokoelmien listaus

source: List of global metadata sets
fi: Yleisten metatietokokoelmien listaus

source: List of global type sets
fi: Yleisten tyyppikokoelmien listaus

source: List of metadata fields
fi: Metatietokenttien listaus

source: List of types
fi: Tyyppien listaus

source: Machine-readable specification
fi: Konekielinen määritelmä

source: Metadata editor
fi: Metatietoeditori

source: Metadata sets
fi: Metatietokokoelmat

source: Metadata with id %1 does not exist.
fi: Metatietoa id-tunnisteella %1 ei ole saatavilla.

source: New type details
fi: Uuden tyypin ominaisuudet

source: New type set details
fi: Uuden tyyppikokoelman ominaisuudet

source: Remove selected type sets
fi: Poista valitut tyyppikokoelmat

source: Remove selected types
fi: Poista valitut tyypit

source: Save
fi: Tallenna

source: Save and add new
fi: Tallenna ja lisää uusi

source: Selected type sets removed.
fi: Valitut tyyppikokoelmat poistettu.

source: Selected types removed.
fi: Valitut tyypit poistettu.

source: Short name
fi: Lyhyt nimi

source: Show metadata fields
fi: Näytä metatietokentät

source: Show metadata sets
fi: Näytä metatietokokoelmat

source: Show type
fi: Näytä tyyppi

source: Show type details
fi: Näytä tyypin ominaisuudet

source: Show type set
fi: Näytä tyyppikokoelma

source: Show type set details
fi: Näytä tyyppikokoelman ominaisuudet

source: Show type sets
fi: Näytä tyyppikokoelmat

source: Show types
fi: Näytä tyypit

source: Show typesets
fi: Näytä tyyppikokoelmat

source: Status of the definition
fi: Määritelmän tila

source: Type details
fi: Tyypin ominaisuudet

source: Type has been saved.
fi: Tyyppi tallennettiin onnistuneesti.

source: Type set details
fi: Tyyppikokoelman ominaisuudet

source: Type set has been saved.
fi: Tyyppikokoelma tallennettiin onnistuneesti.

source: Type sets
fi: Tyyppikokoelmat

source: Typeset with id %1 does not exist.
fi: Tyyppikokoelmaa id-tunnisteella %1 ei ole saatavilla.

source: Use metadata editor
fi: Metatietoeditorin käyttöoikeus

source: User can use the metadata editor tool in this group
fi: Käyttäjä voi käyttää metadataeditoria tässä ryhmässä

source: Website
fi: Websivusto

source: Recommended
fi: Käyttö suositeltavaa

source: (c) Ionstream Oy / Dicole. All rights reserved.
fi: Tekijänoikeus Ionstream Oy / Dicole. Kaikki oikeudet pidetään.

source: Dicole general types
fi: Dicole yleistyypit

source: typeset.gentypes.desc
fi: Tämä on Dicole:n vakio viestityyppikokoelma, joka on suunniteltu satunnaisiin keskusteluihin, joita ei tarkemmin ohjata millään tietyllä tavalla.

source: Dicole PBL types
fi: Dicole ongelmälähtöisen oppimisen viestityypit

source: typeset.pbltypes.desc
fi: Ongelmalähtöinen oppiminen (englanniksi Problem Based Learning, PBL) on opetusmenetelmä, joka kannustaa opiskelijoita määrittelemään ongelmia ja rakentamaan syventävää tiatoa liittyen ongelmien ymmärtämiseen ja ratkaisemiseen.<br /><br /> Menetelmän peruslähtökohtana on auttaa opiskelijoita oppimaan tehokkaasti ryhmässä. Opiskelijat aloittavat aina keskustelun ongelmalla, johon nämä lähtevät yhteistoiminnallisesti rakentamaan ratkaisuja ja syventäviä osaongelmia.<br /><br /> Ongelmalähtöisen oppimisen avulla opiskelijat kannustetaan kriittiseen ja analyyttiseen lähestymistapaan tietoon näiden etsiessä informaatiota erilaisista lähteistä. Tavoitteena on sytyttää opiskelijoiden kiinnostus ja uteliaisuus käsiteltävänä olevaan aiheeseen ja edistää tiedonhakuun ja yhteistyöhön liittyviä kykyjä.<br /><br /> Alustavan ongelman kanssa työskentely usein tuo esiim uusia ongelmia, joiden ratkaiseminen on oleellista itse pääongelman ratkaisemisessa. Syventävät ongelmat syntyvät opiskelijoiden tarpeesta ymmärtää pääongelmaa. Nämä syventävät ongelmat ovat useimmiten tärkeimmässä osassa kokonaisuuden hahmottamisen kannalta. Osaongelmat voidaan ratkaista samalla menetelmällä osana koko ongelmanratkaisuprosessia.<br /><br /> Kun asetat opiskelijoille ongelmia ratkaistavaksi, käytä monipuolisempaa ja monialaisempaa lähestymistapaa opetettavaan aiheeseen. Faktatietoa hakevat kysymykset eivät aina johda ymmärryksen syventymiseen tai käsitteelliseen muutokseen. Uusi informaatio yleensä löytyy tilanteista, joissa joutuu ratkaisemaan ongelmia keskeneräisten tai ristiriitaisten teorioiden saralla.

source: DCMI Type Vocabulary
fi: DCMI -standardi tallenteiden luonteesta

source: DCMI Recommendation
fi: DCMI -yhteisön suosittelema

source: Copyright 2004-06-14 Dublin Core Metadata Initiative. All Rights Reserved. http://www.dublincore.org/copyright/
fi: Tekijänoikeus 2005-06-14 Dublin Core Metadata Initiative. Kaikki oikeudet pidetään. http://www.dublincore.org/copyright/

source: typeset.dmitypes.desc
fi: DCMI -standardi tallenteiden luonteesta ja lajeista antaa yleisluontoiset määritteet erilaisten resurssien kuvaamiseen.

source: Collection
fi: Kokoelma

source: Image
fi: Kuva

source: Text
fi: Teksti

source: Dataset
fi: Tiedosto

source: Event
fi: Tapahtuma

source: Interactive Resource
fi: Interaktiivinen tallenne

source: Moving Image
fi: Liikkuva kuva

source: Physical Object
fi: Fyysinen esine

source: Service
fi: Palvelu

source: Sound
fi: Äänitallenne

source: Software
fi: Tietokoneohjelma

source: Still Image
fi: Piirros tai valokuva

source: Announcement
fi: Tiedote

source: Hyperlink
fi: Verkkolinkki

source: Normal
fi: Normaali

source: Plan
fi: Suunnitelma

source: Question
fi: Kysymys

source: Solution
fi: Ratkaisu

source: Urgent
fi: Tärkeä

source: Clarification
fi: Selvennys

source: Deepening problem
fi: Syventävä ongelma

source: Expert source
fi: Asiantuntijalähde

source: Initial problem
fi: Alustava ongelma

source: My experiment
fi: Oma kokeilu

source: My theory
fi: Oma teoria

source: Organize and evaluate
fi: Organisointi ja arviointi

source: Summary
fi: Yhteenveto

source: Verified information
fi: Varmennettu tieto

source: types.gentypes.announcement
fi: Sinulla on uutta informaatiota, josta haluaisit tiedottaa muille.

source: types.gentypes.hyperlink
fi: Sinulle on linkki hyödylliseen verkkoresurssiin.

source: types.gentypes.idea
fi: Sinulla on idea, jonka haluaisit jakaa muiden kanssa.

source: types.gentypes.normal
fi: Normaali viesti. Käytä tätä viestityyppiä, jos mikään muu viestityyppi ei sovellu tilanteeseen.

source: types.gentypes.plan
fi: Sinulla on suunnitelma.

source: types.gentypes.question
fi: Sinulla on kysymys, jonka haluaisit esittää.

source: types.gentypes.solution
fi: Olet löytänyt ratkaisun ongelmaan.

source: types.gentypes.urgent
fi: sinulla on jotain kiireellistä tai tärkeätä asiaa.

source: types.gentypes.clarification
fi: Sinulla on kysymys esitetystä sisällöstä tai aiheesta ja tarvitset siihen liittyvää tarkennusta. Voit myös selventää tämän viestityypin avulla jotakin asiaa muille.

source: types.pbltypes.deepening
fi: Uusi syventävä ongelma on löytynyt pääongelmaa ratkaistaessa. Uusi ongelma tulee ratkaista osana alustavaa ongelmaa. Kuvaile ongelmasi lähtökohta, syyt ja mahdolliset seuraukset. Esitä tavoitteet ongelman ratkaisemiseksi.

source: types.pbltypes.expert
fi: Olet haastatellut käsiteltävän aihealueen tunnustettua asiantuntijaa, jonka tieto ja osaaminen voisi auttaa ongelman ratkaisemisessa. Asiantuntija voi olla myös jokin toinen taho, jolla on esitettävänä uutta tietoa liittyen ongelmanratkaisuun. Kerro, mitä asiantuntija on sanonut tai kirjoittanut. Muista mainita lähteesi ja lähteen ajankohta.

source: types.pbltypes.initial
fi: Ongelmalähtöisessä oppimisessa on tarkoitus aloittaa keskustelu alustavasta ongelmasta. Kerro kiinnostuksesi ongelmaa kohtaan, kuvaile ongelman lähtökohta ja rajaa ongelma selkesti. Aseta tavoitteet ongelman ratkaisemiseksi. Kuvaile ongelma todellisissa tilanteissa, mikäli mahdollista.

source: types.pbltypes.experiment
fi: Olet oppinut jotakin omien kokeilujesi kautta tai haluat jakaa tietoa muiden suorittamista kokeiluista. Olet mahdollisesti kokeillut jotakin teoriaa käytännössä tai sattumalta törmännyt uuteen tietoon, josta voisi olla hyötyä ongelman ratkaisussa. Kuvaile kokeesi, siihen liittyvät tapahtumat ja tulokset.

source: types.pbltypes.theory
fi: Sinulla on oma työskentelyteoria, selitys tai hypoteesi ongelmaan liittyen. Sinulla on mahdollisesti uutta teoreettista tietoa, joka on tulos kokeiluista, kerätystä informaatiosta tai muuten varmennetusta tiedosta. Muista, että teoriasi ei ole tarkoitus olla fakta. Väärät vastaukset kuten keskeneräinen teoria, väärät oletukset, ristiriitaiset ideat yms. ovat itse asiassa hyvä vastauksia ja osa hyvää jaettua ongelmanratkaisuprosessia.

source: types.pbltypes.organize
fi: On tärkeää organisoida ja arvioida ongelmanratkaisuprosessia itsessään. Tämän viestityypin avulla voit arvioida mihin keskustelu on menossa, mitä menetelmiä ryhmäsi on käyttänyt tai tulisi käyttää ja mihin suuntaaan ryhmäsi pitäisi seuraavaksi keskittyä. Voit myös kuvailla, mistä tarkempaa tietoa ja ymmärrystä voisi löytyä.

source: types.pbltypes.summary
fi: Yhteenvedon avulla yhdistät keskeiset ajatukset ja ryhmäsi kokoaman informaation liittyen johonkin ongelmaan tai osaongelmaan. Yritä liittää hajanainen informaatio selkeäksi, loogiseksi ja luontevaksi tekstiksi yhteenvetoa kirjoittaessasi. Yhteenvetosi voi pyrkiä ratkaisemaan alustavan ongelman, koota yhteenvedon ongelmanratkaisuprosessista tai kuvailla uuden ongelman, jonka ratkaisu on oleellista erillisessä keskustelussa.

source: types.pbltypes.information
fi: Olet koonnut uutta tietoa varmennetusta lähteestä, esimerkiksi kirjallisuutta, lehtiartikkeleita tai tutkimustuloksia yms. Muista sisällyttää tietolähteesi tarkka lähde ja arvio lähteen luotettavuudesta perusteluineen.

source: types.dcmitypes.collection
fi: A collection is an aggregation of items. The term collection means that the resource is described as a group; its parts may be separately described and navigated.

source: types.dcmitypes.dataset
fi: A dataset is information encoded in a defined structure (for example, lists, tables, and databases), intended to be useful for direct machine processing.

source: types.dcmitypes.event
fi: An event is a non-persistent, time-based occurrence. Metadata for an event provides descriptive information that is the basis for discovery of the purpose, location, duration, responsible agents, and links to related events and resources. The resource of type event may not be retrievable if the described instantiation has expired or is yet to occur. Examples - exhibition, web-cast, conference, workshop, open-day, performance, battle, trial, wedding, tea-party, conflagration.

source: types.dcmitypes.image
fi: An image is a primarily symbolic visual representation other than text. For example - images and photographs of physical objects, paintings, prints, drawings, other images and graphics, animations and moving pictures, film, diagrams, maps, musical notation. Note that image may include both electronic and physical representations.

source: types.dcmitypes.interactive
fi: An interactive resource is a resource which requires interaction from the user to be understood, executed, or experienced. For example - forms on web pages, applets, multimedia learning objects, chat services, virtual reality.

source: types.dcmitypes.movingimage
fi: A series of visual representations that, when shown in succession, impart an impression of motion. Examples of moving images are: animations, movies, television programs, videos, zoetropes, or visual output from a simulation.

source: types.dcmitypes.physical
fi: An inanimate, three-dimensional object or substance. For example -- a computer, the great pyramid, a sculpture. Note that digital representations of, or surrogates for, these things should use Image, Text or one of the other types.

source: types.dcmitypes.service
fi: A service is a system that provides one or more functions of value to the end-user. Examples include: a photocopying service, a banking service, an authentication service, interlibrary loans, a Z39.50 or Web server.

source: types.dcmitypes.software
fi: Software is a computer program in source or compiled form which may be available for installation non-transiently on another machine. For software which exists only to create an interactive environment, use interactive instead.

source: types.dcmitypes.sound
fi: A sound is a resource whose content is primarily intended to be rendered as audio. For example - a music playback file format, an audio compact disc, and recorded speech or sounds.

source: types.dcmitypes.stillimage
fi: A static visual representation. Examples of still images are: paintings, drawings, graphic designs, plans and maps.

source: types.dcmitypes.text
fi: A text is a resource whose content is primarily words for reading. For example - books, letters, dissertations, poems, newspapers, articles, archives of mailing lists. Note that facsimiles or images of texts are still of the genre text.

source: Copyright 2003-06-02 Dublin Core Metadata Initiative. All Rights Reserved. http://www.dublincore.org/copyright/
fi: Tekijänoikeus 2003-06-02 Dublin Core Metadata Initiative. Kaikki oikeudet pidetään. http://www.dublincore.org/copyright/

source: metadata.dublin.desc
fi: Dublin Core metadataformaatti on standardi erityyppisten informaatiolähteiden kuvaamiseen. Informaatiolähteellä tarkoitetaan "mitä tahansa, jolla on identiteetti ". Tätä määritelmää on käytetty Internet-standardissa RFC 2396, "Uniform Resource Identifiers (URI): Generic Syntax ", Tim Berners-Lee ym. Ei ole tiedossa mitään perustavanlaatuisia rajoituksia Dublin Core metatietoformaatin käytölle erilaisten resurssityyppien kuvaamisessa.

source: Title
fi: Nimike

source: Creator
fi: Tekijä

source: Subject and keywords
fi: Aihe ja avainsanat

source: Description
fi: Kuvaus

source: Publisher
fi: Julkaisija

source: Contributor
fi: Muu tekijä

source: Date
fi: Päivämäärä

source: Format
fi: Laji

source: Resource type
fi: Formaatti

source: Resource identifier
fi: Identifiointitunnus

source: Source
fi: Lähde

source: Language
fi: Kieli

source: Relation
fi: Suhde

source: Coverage
fi: Kattavuus

source: Rights management
fi: Oikeudet

source: A name given to the resource.
fi: Tekijän tai julkaisijan antama tallenteen nimi.

source: An entity primarily responsible for making the content of the resource.
fi: Henkilö tai yhteisö joka on ensisijaisesti vastuussa tallenteen sisällön luomisesta.

source: A topic of the content of the resource.
fi: Tallenteen sisällön aihealueen kuvaus.

source: An account of the content of the resource.
fi: Tallenteen sisällön kuvaus.

source: An entity responsible for making the resource available.
fi: Organisaatio, henkilö, joka on julkaissut tai asettanut tallenteen käytettäväksi.

source: An entity responsible for making contributions to the content of the resource.
fi: Henkilö, organisaatio tai palvelu, joka tekijä-kentässä mainittujen tekijöiden lisäksi on osallistunut merkittävästi tallenteen luomiseen, mutta jonka panos on ollut toissijainen verrattuna ns. päävastuullisen tekijän osuuteen.

source: Information about rights held in and over the resource.
fi: Tallenteeseen liittyvien oikeuksien ilmaus.

source: The extent or scope of the content of the resource.
fi: Tallenteen sisällön kattavuus.

source: A reference to a related resource.
fi: Viittaus muuhun tallenteeseen, joka liittyy kuvailtavaan tallenteeseen.

source: A language of the intellectual content of the resource.
fi: Tallenteen kieli.

source: A reference to a resource from which the present resource is derived.
fi: Tallenne, johon kuvailtava tallenne perustuu kokonaan tai osittain.

source: The physical or digital manifestation of the resource.
fi: Tallenteen fyysinen tai digitaalinen ilmiasu.

source: A date of an event in the lifecycle of the resource.
fi: Päivämäärä, joka liittyy tallenteen johonkin elinkaaren vaiheeseen.

source: An unambiguous reference to the resource within a given context.
fi: Tunnus, joka identifioi kuvailtavan tallenteen yksiselitteisesti.

source: The nature or genre of the content of the resource.
fi: Tallenteen luonne tai sisällön tyyppi

source: fields.dublin.title
fi: Tyypillisesti nimike on nimi jolla resurssi yleisesti tunnetaan.

source: fields.dublin.creator
fi: Esimerkiksi henkilö, organisaatio tai sisällöntuottaja. On suositeltavaa käyttää tekijän nimeä.

source: fields.dublin.subject
fi: Aihe esitetään yleensä asiasanoilla tai fraaseilla. Kontrolloitujen sanastojen tai luokitusten käyttäminen on suositeltavaa, koska yhteinen terminologia parantaa hakutulosta oleellisesti.

source: fields.dublin.description
fi: Kuvaus voi sisältää esimerkiksi tekstitallenteen tiivistelmän, sisällysluettelon tai sisällön graafisen kuvauksen. Tämä jaottelu voidaan ilmaista tarkenteiden avulla.

source: fields.dublin.publisher
fi: Julkaisija voi olla esimerkiksi kustannusyhtiö, yliopiston laitos tai muu yhteisö. On suositeltavaa käyttää julkaisijan nimeä.

source: fields.dublin.contributor
fi: Muu tekijä voi olla esimerkiksi toimittaja, kuvittaja, kääntäjä tai sisällöntuotantopalvelu. On suositeltavaa käyttää tekijän nimeä.

source: fields.dublin.date
fi: Yleensä aikamääre ilmaisee tallenteen julkistamisajan, luontiajan, voimassaoloajan tai ajanjakson, jolloin tallenne on käytettävissä. Suositeltavaa on määritellä päivämäärä ISO 8601 standardin mukaisesti, esimerkiksi muodossa VVVV-KK-PP.

source: fields.dublin.type
fi: Laji kertoo tallenteen sisällön yleisen luokan, funktion tai genren. Tallenteen luonne voi olla Dublin Core -yhteisön määrittelemän listan mukaan kokoelma, tiedosto, tapahtuma, kuva, interaktiivinen tallenne, palvelu, tietokoneohjelma, äänitallenne tai teksti. Sisällön tyyppi voi olla esimerkiksi runokokoelma tai tieteiskirja. On suositeltavaa, että DCMI -standardia tallenteiden luoteista hyödynnetään.

source: fields.dublin.format
fi: Yleensä formaatti ilmaisee tallenteen tiedostoformaatin (esim. text/html) tai vaihtoehtoisesti myös tallenteen kokotietoja (esimerkiksi kesto minuutteina tai tavukoko kilo- tai megatavuina). Formaattia voidaan käyttää kuvaamaan ohjelmistoja, laitteistoja tai muita tarvikkeita, joiden avulla formaatin sisältö voidaan esittää tai suorittaa. On suositeltavaa valita formaatti kontrolloidusta sanastosta (esimerkiksi MIME -standardi tiedostoformaattien kuvaamiseen).

source: fields.dublin.identifier
fi: Standardoitujen tai yleisesti hyväksyttyjen identifiointitunnusten käyttö on suositeltavaa. Esimerkkejä standardeista ovat URI-tunnukset (sisältäen URL), DOI ja ISBN.

source: fields.dublin.source
fi: Lähde toimii linkkinä toiseen tallenteeseen. Suositeltavaa on viitata lähteeseen jonkin standardin mukaan, esimerkiksi URI-tunnuksella.

source: fields.dublin.language
fi: Ilmaistaan kielikoodilla, esimerkiksi internet-standardit RFC 3066 ja ISO 639. Jos tallenteessa on käytetty useita kieliä voidaan tätä kenttää toistaa.

source: fields.dublin.relation
fi: Suhde toimii linkkinä toiseen tallenteeseen. On suositeltavaa viitata suhteessa olevaan URI-tunnuksella. Suhdetyypit ilmaistaan kenttätarkenteilla. Huom. Viittaus lähdejulkaisuun ilmaistaan lähde-kentässä.

source: fields.dublin.coverage
fi: Tyypillisesti kattavuus-kenttää käytetään tallenteen alueellisen tai ajallisen kattavuuden ilmaisemiseen. Alueellinen kattavuus viittaa johonkin alueeseen tai tilaan, joka voidaan määritellä paikan nimellä tai koordinaateilla (x ,y, z). Ajallinen kattavuus viittaa aikakauteen, jota teoksen sisältö käsittelee, ei siihen milloin teos on julkaistu. Aikamääritys tehdään joko aikakauden nimeä (esimerkiksi rauta-aika) käyttäen, TGN -standardia hyödyntäen tai aikamääre-kentässä määritellyllä tavalla.

source: fields.dublin.rights
fi: Oikeudet-kenttään voidaan tallentaa lyhyt maininta tallenteen käyttöoikeuksista tai linkki tarkempiin tekijänoikeustietoihin tai palveluun, joka antaa tietoja tallenteen käyttömahdollisuuksista.

source: Metadata rights
fi: Metadata oikeudet
