Repository: meetings/core
Catalog: pkg/dicole_settings/msg/messages-*.po
Languages: fi

source: Administrator is not allowed to change the password.
fi: Pääkäyttäjä ei saa vaihtaa salasanaansa.

source: Change password
fi: Vaihda salasana

source: Change your password
fi: Vaihda salasana

source: Enter passwords
fi: Anna salasana

source: New password
fi: Uusi salasana

source: New password saved.
fi: Uusi salasana tallennettu.

source: Old password is not correct.
fi: Vanha salasana virheellinen.

source: Old password
fi: Vanha salasana

source: Password
fi: Salasana

source: Save
fi: Tallenna

source: Verify password
fi: Varmenna salasana

source: Account settings
fi: Käyttäjätilin asetukset

source: User account settings
fi: Käyttäjätilin asetukset

source: Account settings modification failed: %1
fi: Käyttäjätilin asetusten muokkaus epäonnistui: %1

source: Starting page after login
fi: Kirjautumisen jälkeinen aloitussivu

source: Personal summary
fi: Henkilökohtainen yhteenveto

source: Timezone
fi: Aikavyöhyke

source: Change general settings
fi: Muuta yleisiä asetuksia

source: Daily
fi: Päivittäin

source: Deny change general settings
fi: Estä yleisten asetusten muuttaminen

source: Deny password change
fi: Estä salasanan vaihtaminen

source: Deny setting reminders
fi: Estä muistutusten muuttaminen

source: Email reminders
fi: Sähköpostimuistutukset

source: Monthly
fi: Kuukausittain

source: Old password authentication failed
fi: Vanhan salasanan tarkistaminen epäonnistui

source: Password modification failed
fi: Salasanan vaihtaminen epäonnistui

source: Password modification failed: %1
fi: Salasanan vaihtaminen epäonnistui: %1

source: Passwords don't match
fi: Salasanat eivät täsmää

source: Personal feed reader
fi: Henkilökohtainen noutaja

source: Set reminders
fi: Muistutusten muokkaaminen

source: Subscribe to email reminders
fi: Valitse sähköpostimuistutukset

source: Weekly
fi: Viikoittain

source: No reminders
fi: Ei muistutuksia

source: Default when joining a group
fi: Oletus liityttäessä ryhmään

source: Digest for group %1 (%2)
fi: Tiivistelmä ryhmän %1 tapahtumista (%2)

source: Digest for personal feed reader (%1)
fi: Tiivistelmä henkilökohtaisen noutajan tapahtumista (%1)

source: Digest for %1 (%2)
fi: %1 tiivistelmä (%2)

source: Confirm new password
fi: Vahvista uusi salasana

source: Connect to Facebook
fi: Yhdistä Facebook -tunnuksen kanssa

source: Disconnect from Facebook
fi: Poista yhteys Facebook -tunnukseen

source: Facebook account connected.
fi: Facebook tunnus yhdistetty.

source: Facebook account disconnected.
fi: Facebook tunnuksen yhteys poistettu.

source: Login settings
fi: Sisäänkirjautumisasetukset

source: -- Select --
fi: -- Valitse --
