Repository: meetings/core
Catalog: pkg/dicole_groups/msg/messages-*.po
Languages: fi

source: Add a group
fi: Lisää ryhmä

source: Add custom member security rights
fi: Lisää jäsenten mukautettuja käyttöoikeuksia

source: Add custom settings
fi: Lisää mukautettuja käyttöoikeuksia

source: Add groups
fi: Lisää ryhmiä

source: Administration
fi: Hallinto

source: Applying not yet implemented!
fi: Ryhmään hakemista ei ole vielä toteutettu!

source: Apply to group
fi: Hae ryhmän jäseneksi

source: Browse groups
fi: Selaa ryhmiä

source: Change group info
fi: Muuta ryhmän tietoja

source: Change group's tools
fi: Muuta ryhmän työkaluvalintoja

source: Change group's users
fi: Muuta ryhmän jäsenlistaa

source: Change member security rights
fi: Muuta jäsenten käyttöoikeuksia

source: Changes were saved.
fi: Muutokset tallennettu.

source: Class
fi: Luokka

source: Collection name
fi: Kokoelman nimi

source: Could not detect join policy: Can't join!
fi: Ryhmään liittyminen epäonnistui. Järjestelmä ei pystynyt selvittämään liittymiskäytäntöä.

source: Course
fi: Kurssi

source: Create a subgroup
fi: Luo alaryhmä

source: Custom member rights
fi: Mukautetut käyttöoikeudet

source: Custom member security settings
fi: Mukautetut käyttöoikeudet

source: Default member rights
fi: Oletuskäyttöoikeudet

source: Default member security settings
fi: Jäsenten oletuskäyttöoikeudet

source: Default members right settings
fi: Jäsenten oletuskäyttöoikeudet

source: Default rights updated
fi: Oletuskäyttöoikeudet on päivitetty

source: Deny group moderation
fi: Estä ryhmien moderointi

source: Description
fi: Kuvaus

source: Edit group information
fi: Muokkaa ryhmän tietoja

source: Edit group
fi: Muokkaa ryhmää

source: Edit groups
fi: Muokkaa ryhmiä

source: Edit group tools
fi: Muokkaa ryhmän työkaluja

source: Edit group users
fi: Valitse ryhmän jäsenet

source: Email
fi: Sähköposti

source: Failed modifying user: %1
fi: Käyttäjän: %1 muokkaus epäonnistui

source: First name
fi: Etunimi

source: Free join
fi: Kaikille avoin

source: General group information
fi: Ryhmän yleistiedot

source: Group admin
fi: Ryhmän ylläpitäjä

source: Group data saved
fi: Ryhmän tiedot tallennettu

source: Group information
fi: Ryhmän tiedot

source: Group info
fi: Ryhmän tiedot

source: Group listing
fi: Käyttäjäryhmät

source: Group moderator
fi: Ryhmän moderaattori

source: Groups tools
fi: Ryhmien työkalut

source: Groups users
fi: Ryhmien jäsenet

source: Group tools
fi: Ryhmän työkalut

source: Group type
fi: Ryhmän tyyppi

source: Group user defaults
fi: Ryhmän jäsenten oletusoikeudet

source: Group users
fi: Ryhmän jäsenet

source: Hidden
fi: Piilotettu

source: Join group
fi: Liity ryhmään

source: Join policy
fi: Liittymiskäytäntö

source: Join succesful!
fi: Liittyminen onnistui!

source: Last name
fi: Sukunimi

source: List custom member security rights
fi: Näytä mukautetut käyttöoikeudet

source: List all groups
fi: Näytä kaikki ryhmät

source: Login name
fi: Käyttäjätunnus

source: Modify group details
fi: Muokkaa ryhmän tietoja

source: Must apply
fi: Tulee hakea

source: Name
fi: Nimi

source: No active group found!
fi: Aktiivisia ryhmiä ei ole saatavilla!

source: Closed
fi: Suljettu

source: -- None --
fi: -- Ei mitään --

source: No
fi: Ei

source: No such group ( id '%1' ) found!
fi: Ryhmää ( identifikaatio: '%1' ) ei löytynyt!

source: No tools available since group has no area. Porceed to the next step please!
fi: Työkaluja ei ole saatavilla, sillä ryhmällä ei ole työskentelyaluetta. Ole hyvä ja etene seuraavaan vaiheeseen!

source: Organization
fi: Organisaatio

source: Other groups
fi: Muut ryhmät

source: Groups
fi: Ryhmät

source: Parent group
fi: Ylätason ryhmä

source: Part group
fi: Eroa ryhmästä

source: Part succesful!
fi: Eroaminen onnistui!

source: Project
fi: Projekti

source: Remove custom member security rights
fi: Poista mukautettuja jäsenten käyttöoikeuksia

source: Remove custom settings
fi: Poista mukautetut asetukset

source: Remove members right settings
fi: Poista jäsenen käyttöoikeusasetukset

source: Remove
fi: Poista

source: Save
fi: Tallenna

source: Section
fi: Osio

source: Securities added
fi: Käyttöoikeudet on lisätty

source: Select collections
fi: Valitse kokoelmat

source: Select default member rights
fi: Valitse jäsenten oletuskäyttöoikeudet

source: Select default member securities
fi: Valitse jäsenten oletuskäyttöoikeudet

source: Select default member security rights
fi: Valitse jäsenten oletuskäyttöoikeudet

source: Select default rights
fi: Valitse oletuskäyttöoikeudet

source: Selected collections
fi: Valitut kokoelmat

source: Selected tools
fi: Valitut työkalut

source: Selected users
fi: Valitut käyttäjät

source: Select group tools
fi: Valitse ryhmän työkalut

source: Select group users
fi: Valitse ryhmän jäsenet

source: Select users
fi: Valitse käyttäjät

source: Show custom settings
fi: Näytä mukautetut asetukset

source: Show group listing
fi: Näytä ryhmät

source: Tool name
fi: Työkalun nimi

source: User can add and remove group members
fi: Käyttäjä voi lisätä ja poistaa ryhmän jäseniä

source: User can add and remove group tools
fi: Käyttäjä voi lisätä ja poistaa ryhmän työkaluja

source: User can add groups to the system
fi: Käyttäjä voi lisätä ryhmiä järjestelmään

source: User can change group information
fi: Käyttäjä voi muuttaa ryhmän tietoja

source: User can change groups members' default security rights
fi: Käyttäjä voi muuttaa ryhmän jäsenten oletuskäyttöoikeuksia

source: User can edit all groups in the system
fi: Käyttäjä voi muokata järjestelmän kaikkia ryhmiä

source: User can give custom security rights to individual group members
fi: Käyttäjä voi antaa mukautettuja käyttöoikeuksia ryhmän jäsenille

source: User can list custom security rights to individual group members
fi: Käyttäjä voi nähdä jäsenten mukautetut käyttöoikeudet

source: User can list groups and show their information
fi: Käyttäjä voi listata ryhmiä ja nähdä ryhmien perustiedot

source: User can remove custom security rights from individual group members
fi: Käyttäjä voi poistaa jäsenten mukautettuja käyttöoikeuksia

source: Usergroup
fi: Käyttäjäryhmä

source: User groups tree
fi: Käyttäjäryhmät

source: User login name
fi: Käyttäjätunnus

source: User sees the settings dropdown in this group
fi: Käyttäjä voi nähdä asetukset -valikon sisällön

source: View settings dropdown
fi: Asetukset -valikon katselu

source: Visibility
fi: Näkyvyys

source: Visible
fi: Näkyvissä

source: Work area
fi: Työskentelyalue

source: Workgroup
fi: Työryhmä

source: Yes
fi: Kyllä

source: You already are a group member!
fi: Olet jo ryhmän jäsen!

source: You are not a group member!
fi: Et kuulu ryhmään!

source: You can't join this group!
fi: Et voi liittyä tähän ryhmään!

source: Recent groups
fi: Viimeisimmät ryhmät

source: Common group
fi: Yleinen ryhmä

source: Portrait
fi: Muotokuva

source: People who belong to this group
fi: Ryhmään kuuluvat henkilöt

source: List members
fi: Listaa ryhmän jäsenet

source: List of members
fi: Lista ryhmän jäsenistä

source: Group members
fi: Ryhmän jäsenet

source: Can not see group members
fi: Ei voi nähdä ryhmän jäseniä

source: See group members
fi: Voi nähdä ryhmän jäsenet

source: Controls
fi: Toiminnot

source: Weblog
fi: Blogi

source: Group roles
fi: Roolit ryhmässä

source: Group member visibility
fi: Ryhmän jäsenten näkeminen

source: Add root level groups
fi: Lisää pohjatason ryhmiä

source: Can not create subgroups
fi: Ei oikeutta luoda alaryhmiä

source: Can not see group info
fi: Ei oikeutta nähdä ryhmän tietoja

source: Change member rights
fi: Oikeus muuttaa jäsenten oikeuksia

source: Create subgroups
fi: Oikeus luoda alaryhmiä

source: Default group user
fi: Ryhmän käyttäjän oletusoikeudet

source: Edit info
fi: Muokkaa tietoja

source: Edit member rights
fi: Muokkaa jäsenten oikeuksia

source: Edit users
fi: Muokkaa jäsenistöä

source: General group rights
fi: Yleiset ryhmän oikeudet

source: Go to work area
fi: Siirry ryhmän työalueelle

source: Group administration
fi: Ryhmän hallinta

source: Groups info
fi: Ryhmän tiedot

source: Member rights
fi: Jäsenten oikeudet

source: Removing a group is not supported yet
fi: Ryhmän poistamista ei vielä tueta

source: See group info
fi: Oikeus nähdä ryhmän tiedot

source: Show group info
fi: Näytä ryhmän tiedot

source: User can add groups under this group
fi: Käyttäjä voi lisätä ryhmälle alaryhmiä

source: User can add root level groups
fi: Käyttäjä voi lisätä pohjatason ryhmiä

source: User can list public groups and show their information
fi: Käyttäjä voi selata julkisia ryhmiä

source: User can remove the group
fi: Käyttäjä voi poistaa ryhmän

source: User can see a list of group members
fi: Käyttäjä näkee listan ryhmän jäsenistä

source: User can see the groups info
fi: Käyttäjä näkee ryhmän tiedot

source: View group info
fi: Oikeus nähdä ryhmän tiedot

source: View group members
fi: Oikeus nähdä ryhmän jäsenet

source: You are not allowed to remove the group!
fi: Sinulla ei ole oikeutta poistaa ryhmää!

source: Remove group
fi: Poista ryhmä

source: Are you sure you want to part this group?
fi: Oletko varma, että haluat erota tästä ryhmästä?

source: You can not remove the group as long as it has subgroups!
fi: Et voi poistaa ryhmää niin kauan kuin sillä on alaryhmiä!

source: Group removed.
fi: Ryhmä poistettu.

source: Group created! Please choose tools for the workarea.
fi: Ryhmä luotu! Ole hyvä ja valitse työskentelyalueen työkalut.

source: Group created!
fi: Ryhmä luotu!

source: Other
fi: Muut

source: Are you sure you want to remove this group?
fi: Oletko varma, että haluat poistaa tämän ryhmän?

source: Community
fi: Yhteisö

source: Community area
fi: Yhteisöalue

source: People
fi: Ihmiset

source: Area joined
fi: Alueelle liittyminen onnistui

source: Read only group access
fi: Ryhmän lukuoikeus

source: Allows users to see group info as a group tool
fi: Antaa käyttäjien nähdä ryhmän tiedot työkaluna

source: Group info tool
fi: Ryhmän tiedot -työkalu

source: Can create root level groups
fi: Voi luoda pohjatason ryhmiä

source: band
fi: bändi

source: bands
fi: bändiä

source: Click to upload a photo
fi: Klikkaa lähettääksesi kuva

source: Create a new group
fi: Luo uusi ryhmä

source: Facebook-page
fi: Facebook-sivu

source: filter more
fi: Suodata lisää

source: Filter with keywords
fi: Suodata avainsanoilla

source: General info
fi: Yleiset tiedot

source: Group browser summary box
fi: Ryhmien selaus yhteenvedossa

source: Group description
fi: Ryhmän kuvaus

source: Group location
fi: Ryhmän sijainti

source: Group updated
fi: Ryhmä päivitetty

source: Group visibility
fi: Ryhmän näkyvyys

source: I accept the EULA
fi: Hyväksy EULA

source: Links
fi: Linkit

source: Localizations
fi: Kielikäännökset

source: Look
fi: Ulkonäkö

source: members
fi: jäsentä

source: MySpace-page
fi: MySpace-sivu

source: No results
fi: Ei hakutuloksia

source: Other webpage
fi: Muu verkkosivu

source: Register the group
fi: Rekisteröi ryhmä

source: Reports
fi: Raportit

source: See group admin extras
fi: Oikeus nähdä admin-komponentit

source: Twitter-page
fi: Twitter-sivu

source: with keywords
fi: avainsanoilla

source: 1 group
fi: 1 ryhmä

source: %1 groups
fi: %1 ryhmää

source: Admin
fi: Ylläpitäjä

source: Apply for fan
fi: Hae faniksi

source: Areas
fi: Alueet

source: Are you sure you want to remove the user?
fi: Oletko varma, että haluat poistaa käyttäjän tältä alueelta?

source: BAND
fi: BÄNDI

source: Cancel upload
fi: Keskeytä lähetys

source: Confirm
fi: Varmista

source: Download as list
fi: Lataa listana

source: Fans
fi: Fanit

source: Filter
fi: Rajaa

source: Filter bands
fi: Rajaa bändejä

source: Group info summary box
fi: Ryhmän tietojen yhteenvetolaatikko

source: Groups (summary title)
fi: Ryhmät

source: Group subgroup browsing tool
fi: Ryhmän alaryhmien selaustyökalu

source: Group (summary title)
fi: Ryhmä

source: Group summary tools
fi: Ryhmän yhteenvedon työkalut

source: Group tags
fi: Ryhmän avainsanat

source: Level
fi: Käyttäjätaso

source: member(s)
fi: jäsen(tä)

source: Members
fi: Jäsenet

source: Moderator
fi: Moderaattori

source: Modify the header
fi: Muokkaa otsikkoa

source: More groups
fi: Lisää ryhmiä

source: Most active bands
fi: Aktiivisimmat bändit

source: Newest groups
fi: Uusimmat ryhmät

source: New group administration
fi: Uusi ryhmän ylläpito

source: Please fill the fields marked with the star to complete the registration.
fi: Ole hyvä ja täytä tähdellä merkityt kentät edetäksesi.

source: Samples
fi: Näytteitä

source: Send e-mail
fi: Lähetä sähköposti

source: Show all bands
fi: Näytä kaikki bändit

source: Spotlight
fi: Valokeila

source: Upload a photo
fi: Lähetä kuva

source: %1 members
fi: %1 jäsentä

source: 1 area
fi: 1 alue

source: %1 areas
fi: %1 aluetta

source: Additional settings
fi: Lisäasetukset

source: Area description
fi: Alueen kuvaus

source: Area info
fi: Alueen tiedot

source: Area location
fi: Alueen sijainti

source: Area name
fi: Alueen nimi

source: Area summary tools
fi: Alueen yhteenvedon työkalut

source: Area tags
fi: Alueen avainsanat

source: Area visibility
fi: Alueen näkyvyys

source: Basic member rights
fi: Peruskäyttäjän oikeudet

source: Create area
fi: Luo alue

source: Filter areas
fi: Rajaa alueita

source: Forced user adding
fi: Käyttäjien lisääminen väkisin

source: More areas
fi: Lisää alueita

source: Most active areas
fi: Aktiivisimmat alueet

source: Show all areas
fi: Näytä kaikki alueet

source: Show more fans
fi: Näytä enemmän faneja

source: User rights exceptions
fi: Poikkeukset käyttäjien oikeuksissa

source: I accept the <a href=\"%1\">terms of service</a>
fi: Hyväksyn <a href=\"%1\">käyttöehdot</a>

source: Add and remove users
fi: Lisää ja poista käyttäjiä

source: Filter user list by name:
fi: Rajaa listaa nimen perusteella:

source: Filter user list by user level
fi: Rajaa listaa käyttäjätason perusteella

source: Start typing the name...
fi: Aloita kirjoittamaan nimeä...

source: User managing
fi: Jäsenten hallinta

source: users match the current filters.
fi: käyttäjää asetettuilla rajaehdoilla.

source: You have been invited to %1
fi: Sinut on kutsuttu alueelle %1

source: No areas found.
fi: Ei alueita.

source: Enter area
fi: Siirry alueelle

source: Optimal image size is 400x300px.
fi: Optimaalinen kuvan koko on 400x300px.

source: YouTube-page
fi: YouTube-sivu

source: Admin only settings
fi: Ylläpitäjien asetukset

source: Area settings
fi: Alueen asetukset

source: Area workspace disabled
fi: Alueen työskentelyelue poissa käytöstä

source: Front page (wiki automatic first page name)
fi: Etusivu

source: Group custom banner
fi: Ryhmän oman banderolli

source: Send test email to self
fi: Lähetä testiviesti itselle

source: Subgroup creation disabled
fi: Alaryhmien luoti poissa käytöstä

source: Subgroup parent
fi: Alaryhmän pohjaryhmä

source: Subgroup type
fi: Alaryhmän tyyppi

source: Test mail sent to self.
fi: Testiviesti lähetetty itselle.

source: Custom user rights
fi: Räätälöidyt käyttöoikeudet

source: Default rights
fi: Oletusoikeudet

source: User reports
fi: Käyttäjäraportit

source: Close
fi: Sulje

source: Can see page elements that are meant only for admins
fi: Oikeus nähdä vain ylläpitäjille tarkoitetut elementit

source: You can not send the mail without a subject.
fi: Et voi lähettää sähköpostia ilman aihetta.

source: Export all users
fi: Vie käyttäjät tiedostoon

source: User level
fi: Käyttäjätaso

source: Access the system through the following link:
fi: Kirjaudu oheisen linkin kautta järjestelmään:
