Repository: meetings/core
Catalog: pkg/dicole_events/msg/messages-*.po
Languages: fi

source: events_invite_mail_subject_template
fi: Sinut on kutsuttu tapahtumaan [% title %]

source: events_invite_mail_html_template
fi: <p>[% greeting_html %]</p>[% IF greeting_html %]<hr />[% END %]<p>[% sender_name %] on kutsunut sinut[% IF planner %] järjestäjäksi [% END %] tapahtumaan [% title or '?' %], [% location or '?' %], [% date_string || '?' %].</p><p>[% IF planner %]Järjestäjänä voit muokata osallistujia ja tapahtuman tietoja. Pääset liikkeelle seuraavasta osoitteesta <a href="[% url | html %]">[% url | html %]</a>[% ELSE %]Kutsu on RSVP. Varmista paikkasi osoitteesta: <a href="[% url | html %]">[% url | html %]</a>[% END %]</p><p>[% abstract_html %]</p><p>[% description_html %]</p>

source: events_invite_mail_text_template
fi: [% greeting_text %] [% IF greeting_text %]-------- [% END %][% sender_name %] on kutsunut sinut[% IF planner %] järjestäjäksi [% END %] tapahtumaan [% title or '?' %], [% location or '?' %], [% date_string || '?' %]. [% IF planner %]Järjestäjänä voit muokata osallistujia ja tapahtuman tietoja. Pääset liikkeelle seuraavasta osoitteesta: [% url %] [% ELSE %]Kutsu on RSVP. Varmista paikkasi osoitteesta: [% url %] [% END %] [% abstract_text %] [% description_text %]

source: events_invite_notification_to_user_mail_subject_template
fi: Sinut on kutsuttu tapahtumaan [% title %]

source: events_invite_notification_to_user_mail_html_template
fi: <p>[% greeting_html %]</p>[% IF greeting_html %]<hr />[% END %]<p>[% sender_name %] on kutsunut sinut[% IF planner %] järjestäjäksi [% END %] tapahtumaan [% title or '?' %], [% location or '?' %], [% date_string || '?' %].</p><p>[% IF planner %]Järjestäjänä voit muokata osallistujia ja tapahtuman tietoja. Pääset liikkeelle seuraavasta osoitteesta: <a href="[% url | html %]">[% url | html %]</a>[% ELSE %]Kutsu on RSVP. Varmista paikkasi osoitteesta: <a href="[% url | html %]">[% url | html %]</a>[% END %]</p><p>[% abstract_html %]</p><p>[% description_html %]</p>

source: events_invite_notification_to_user_mail_text_template
fi: [% greeting_text %] [% IF greeting_text %]-------- [% END %][% sender_name %] on kutsunut sinut[% IF planner %] järjestäjäksi [% END %] tapahtumaan [% title or '?' %], [% location or '?' %], [% date_string || '?' %]. [% IF planner %]Järjestäjänä voit muokata osallistujia ja tapahtuman tietoja. Pääset liikkeelle seuraavasta osoitteesta: [% url %] [% ELSE %]Kutsu on RSVP. Varmista paikkasi osoitteesta: [% url %] [% END %] [% abstract_text %] [% description_text %]

source: A collection of events
fi: Tapahtumien järjestys

source: Add event
fi: Lisää tapahtuma

source: Admin events
fi: Hallinnoi tapahtumia

source: Events
fi: Tapahtumat

source: Events rights
fi: Tapahtumien oikeudet

source: Events upcoming summary
fi: Tulevien tapahtumien yhteenveto

source: Listing of 5 upcoming events
fi: Listaus 5 tulevasta tapahtumasta

source: My events
fi: Omat tapahtumat

source: My events tagged with: %1
fi: Omat tapahtumat avainsanalla %1

source: No events found.
fi: Yhtään tapahtumaa ei löytynyt.

source: Past events
fi: Menneet tapahtumat

source: Past events tagged with: %1
fi: Menneet tapahtumat avainsanalla %1

source: Show more events
fi: Näytä lisää tapahtumia

source: Upcoming events
fi: Tulevat tapahtumat

source: Upcoming events tagged with: %1
fi: Tulevat tapahtumat avainsanalla %1

source: User can admin events
fi: Käyttäjä voi hallinnoida tapahtumia

source: User can view events
fi: Käyttäjä näkee tapahtumat

source: View events
fi: Tapahtumien näkeminen

source: %1 had already been invited to the event
fi: %1 on jo kutsuttu tapahtumaan

source: %1 was already a planner in the event
fi: %1 oli jo järjestäjänä tapahtumassa

source: Add events
fi: Lisää tapahtumia

source: Anyone can attend, so invite your contacts! Share this event with:
fi: Kuka tahansa voi osallistua, joten kutsu muita mukaan! Jaa tapahtuma osoitteella:

source: Are you joining us?
fi: Liitytkö seuraamme?

source: Attending
fi: Osallistun

source: Banner
fi: Banneri

source: Create event
fi: Luo tapahtuma

source: Custom icon
fi: Oma ikoni

source: Delete event
fi: Poista tapahtuma

source: Do you really want to delete this event?
fi: Haluatko varmasti poistaa tapahtuman?

source: Email:
fi: Sähköposti:

source: Email addresses
fi: Sähköpostiosoitteet

source: End
fi: Loppu

source: Event deleted
fi: Tapahtuma poistettu

source: Event info
fi: Tapahtuman tiedot

source: Event is full
fi: Tapahtuma on täynnä

source: Extended description
fi: Laajempi kuvaus

source: Extra controls
fi: Lisäkontrollit

source: Extra info
fi: Lisätiedot

source: First name:
fi: Etunimi:

source: Good to have you with us!
fi: Hienoa, että tulet mukaan!

source: Greeting
fi: Tervehdysviesti

source: In order to accept your invite, you must %1login or register%2.
fi: Hyväksyäksesi kutsusi sinun tulee %1kirjautua sisään tai rekisteröityä%2.

source: In order to participate, please %1login%2.
fi: Osallistuaksesi sinun tulee %1kirjautua sisään%2.

source: In order to participate, please %1login%2 or %3register%4
fi: Osallistuaksesi sinun tulee %1kirjautua sisään%2 tai %3rekisteröityä%4

source: Invalid phone number
fi: Virheellinen puhelinnumero

source: Invite other planners!
fi: Kutsu muita järjestäjiä!

source: Invite participants!
fi: Kutsu osallistujia!

source: It will not show on the event list. Use the invite tool to send invitations.
fi: Se ei näy tahaptumalistauksissa. Käytä kutsutyökalua lähettääksesi kutsuja.

source: Last name:
fi: Sukunimi:

source: Limited
fi: Rajoitettu

source: Live now!
fi: Menossa nyt!

source: Location
fi: Sijainti

source: Login!
fi: Kirjaudu sisään!

source: Login name:
fi: Tunnus:

source: Manage event
fi: Muokkaa tapahtumaa

source: Manage Event
fi: Muokkaa Tapahtumaa

source: Maybe
fi: Ehkä

source: Maybe attending
fi: Ehkä

source: More events
fi: Lisää tapahtumia

source: More media
fi: Lisää mediaa

source: More pages
fi: Lisää sivuja

source: More posts
fi: Lisää viestejä

source: New page
fi: Uusi sivu

source: No date specified
fi: Ei määriteltyä päivämäärää

source: [no name]
fi: [ei nimeä]

source: Not answered yet
fi: Ei vielä vastannut

source: Not attending
fi: En osallistu

source: Not Attending
fi: En osallistu

source: Off
fi: Pois

source: Ok, count me in
fi: Osallistu

source: On
fi: Päällä

source: Other tags
fi: Muut avainsanat

source: Other tags:
fi: Muut avainsanat:

source: Participants
fi: Osallistujat

source: Participants can invite others?
fi: Osallistujat voivat kutsua muita

source: Participant visibilities
fi: Osallistujien näkyvyydet

source: Password:
fi: Salasana:

source: Please enter your phone number (required):
fi: Ole hyvä ja anna puhelinnumerosi (pakollinen):

source: Private
fi: Piilotettu

source: Register!
fi: Rekiströidy!

source: Require participants to provide a phone number?
fi: Osallistujilta vaaditaan puhelinnumero

source: Save all changes
fi: Tallenna kaikki muutokset

source: Seats left:
fi: Paikkoja:

source: Sending invitation to %1 failed : %2
fi: Kutsun lähettäminen osoitteeseen %1 epäonnistui : %2

source: Sending invitation to user %1 failed
fi: Kutsun lähettäminen käyttäjälle %1 epäonnistui

source: Sent an invitation to user %1
fi: Kutsu lähetetty käyttäjälle %1

source: Short description
fi: Lyhyt kuvaus

source: Show full description
fi: Näytä koko kuvaus

source: Social media tag
fi: Sosiaalisen median tagi

source: Start
fi: Alku

source: Stream
fi: Videolähetys

source: This event is private
fi: Tämä tapahtuma on yksityinen

source: This event is public
fi: Tämä tapahtuma on näkyvissä

source: This is the tag people will use when posting about this event.
fi: Tätä tagia ihmiset käyttävät kirjoittaessaan tapahtumasta.

source: To show a map, please type the event location to the location field.
fi: Asemoi kartta kirjoittamalla sijainti sille varattuun kenttään.

source: Unable to translate your location to map coordinates, please be more specific.
fi: Sijaintiasi ei kyetty muuttamaan kartaksi. Ole hyvä ja ole tarkempi.

source: Unknown error
fi: Tuntematon virhe

source: User can add events
fi: Käyttäjä voi lisätä tapahtumia

source: Use this tag when posting about this event.
fi: Käytä tätä tagia kirjoittaessasi tapahtumasta.

source: What information do you need the participants to fill in?
fi: Mitä tietoja haluat kysyä osallistujilta?

source: Yes, delete
fi: Kyllä, poista

source: Your invitation has been processed
fi: Kutsusi on vastaanotettu

source: attending
fi: osallistuu

source: Back to event listing
fi: Takaisin tapahtumalistaan

source: Cancel and show event
fi: Keskeytä muokkaus

source: Hide full description
fi: Piilota koko kuvaus

source: maybe
fi: ehkä

source: not attending
fi: ei osallistu

source: State (accessibility)
fi: Julkisuustila

source: waiting
fi: odottaa vastausta

source: New media (action)
fi: Lisää mediaobjekti

source: Private (state)
fi: Piilossa

source: Public (state)
fi: Näkyvä

source: Accept your invite
fi: Hyväksy kutsusi

source: Attending (manage)
fi: Osallistuu

source: awating reply
fi: odottaa vastausta

source: Awaiting reply
fi: Odottaa vastausta

source: Event needs a title!
fi: Tapahtuma tarvitsee nimen!

source: Login or register
fi: Kirjaudu tai rekisteröidy

source: Manage
fi: Hallitse

source: Manage participants!
fi: Hallinnoi osallistujia

source: Maybe (manage)
fi: Ehkä

source: Not attending (manage)
fi: Ei osallistu

source: planner
fi: järjestäjä

source: Registration end
fi: Ilmoittautumisen loppu

source: Registration start
fi: Ilmoittautumisen alku

source: The event is full
fi: Tapahtuma on täynnä

source: This is this event's social media tag. Use this tag when posting about this event.
fi: Tämä on tapahtuman sosiaalisen median tagi. Käytä sitä kun kirjoitat tapahtumasta verkkoon.

source: Anyone can join.
fi: Kuka tahansa voi liittyä.

source: Filter by
fi: Hae

source: Only invited people can join.
fi: Vain kutsutut ihmiset voivat liittyä.

source: Send
fi: Lähetä

source: Separate addresses with commas.
fi: Erottele osoitteet pilkulla.

source: Show past events
fi: Näytä menneitä tapahtumia

source: The event is full.
fi: Tapahtuma on täynnä.

source: The registration has closed.
fi: Ilmoittautuminen on loppunut.

source: The registration has not started yet.
fi: Ilmoittautuminen ei vielä ole alkanut.

source: Waiting (manage)
fi: Odottaa

source: An invitation is needed to join. Use the Invite tool to send invitations.
fi: Tapahtumaan tarvitsee kutsun. Käytä kutsutoimintoa lähetätäksesi kutsuja.

source: An invitation is needed to join. You may request an invitation from the planners.
fi: Tapahtumaan tarvitsee kutsun. Voit pyytää kutsuja järjestäjiltä.

source: Anyone can join, so use the invite tool to invite your contacts!
fi: Kuka tahansa voi liittyä seuraan, joten lähetä kutsuja kontakteillesi kutsutoiminnolla!

source: No upcoming events found.
fi: Ei tulevia tapahtumia.

source: Social Media Tag
fi: Sosiaalisen Median Tagi

source: It will show on the Events list. Anyone can join and invite others.
fi: Tapahtuma näkyy tapahtumalistauksessa. Kukatahansa voi liittyä tapahtumaan ja kutsua muita.

source: It will not show on the Events list and users must be invited in order to join. Use the Invite tool to send invitations.
fi: Se ei tule näkymään tapahtumalistauksessa ja käyttäjät tulee kutsua tapahtumaan erikseen. Käytä kutsumistyökalua lähettääksesi kutsuja.

source: Event details
fi: Tapahtuman tiedot

source: Planner (manage)
fi: Järjestäjä

source: Emails sent!
fi: Sähköpostit lähetetty!

source: Export this list
fi: Lataa lista tiedostona

source: Give Us Feedback
fi: Vastaa kyselyyn

source: Mail these people
fi: Lähetä sähköpostia näille ihmisille

source: people match the criteria.
fi: käyttäjää vastaa hakuehtoja.

source: Copy event
fi: Kopioi tapahtuma

source: Event created.
fi: Tapahtuma luotu.

source: We'll scale the image to a width of 113 pixels.
fi: Venytämme kuvan 133 pikselin levyiseksi.

source: We recommend you use an image 580 pixels wide. (If it's wider than that, we'll scale it down.)
fi: Suosittelemme käyttämään 580 pikseliä leveätä kuvaa. (Jos kuva on sitä suurempi, kutistamme sitä pienemmäksi)

source: Attend
fi: Osallistu

source: Hi, I invite you to participate as a planner in %1, an event I am organizing.
fi: Hei, kutsun sinut osallistumaan järjestäjänä %1 tapahtumaan, jota organisoin.

source: Hi, I invite you to participate in %1, an event I am organizing.
fi: Hei, kutsun sinut osallistumaan %1 tapahtumaan, jota organisoin.

source: (Copy) (single)
fi: (Kopio)

source: Event copied
fi: Tapahtuma kopioitu

source: Event live stream
fi: Tapahtuman reaaliaikavirta

source: In order to participate, please %1login or register%2
fi: Osallistuaksesi sinun tulee %1kirjautua tai rekisteröityä%2

source: Invalid phone number. Please try attending again.
fi: Virheellinen puhelinnumero. Yritä uudelleen.

source: Invitation is needed to participate?
fi: Osallistuminen on mahdollista vain kutsulla?

source: No media.
fi: Ei sisältöjä.

source: No pages.
fi: Ei sivuja.

source: Only invited users can attend.
fi: Osallistuminen on mahdollsita vain kutsutuille.

source: Only invited users can attend, so use the invite tool to invite your contacts!
fi: Osallistuminen on mahdollsita vain kutsutuille, joten kutsu kontaktisi kutsutyökalulla!

source: Sorry but attending requires an invite.
fi: Osallistuminen on mahdollista vain kutsulla.

source: Sorry but the event is full
fi: Tapahtuma on täynnä

source: Welcome to participate as a planner to event %1.
fi: Tervetuloa järjestäjäksi tapahtumaan %1.

source: Whoops, I forgot my password
fi: Unohdin salasanani

source: Attending status
fi: Osallistumisen tila

source: Event name
fi: Tapahtuman nimi

source: Back to event page
fi: Takaisin tapahtuman sivulle

source: No people match the criteria.
fi: Yhtään henkilöä ei vastaa hakuehtoja.

source: One person matches the criteria.
fi: Yksi käyttäjä vastaa hakuehtoja.

source: Paste HTML embed code here.
fi: Liimaa HTML embed koodi tähän.

source: Registration will be open until %1
fi: Rekisteröinti on auki %1 asti

source: Registration will start on %1.
fi: Rekisteröinti alkaa %1.

source: No participants yet.
fi: Osallistujia ei vielä ole.

source: Questionnaire
fi: Kysely

source: It will not show on the Events list and users must be invited in order to join.
fi: Se ei tule näkymään tapahtumalistauksessa ja käyttäjät tulee kutsua tapahtumaan erikseen.

source: Welcome! Please decide if you are going to join the event.
fi: Tervetuloa! Ole hyvä, ja valitse pääsetkö mukaan tapahtumaan.

source: Attend info
fi: Lisätiedot

source: What is your phone number?
fi: Mikä on puhelinnumerosi?

source: What is your title in the organization?
fi: Mikä on nimikkeesi organisaatiossa?

source: What organization do you represent?
fi: Mitä organisaatiota edustat?

source: You need an invite to participate in this event. Invitations are sent through email and include a link for participation.
fi: Tarvitset kutsun, jotta voit osallistua tähän tapahtumaan. Kutsut lähetetään sähköpostilla ja ne sisältävät ilmottautumisen mahdollistavan linkin.

source: Do you want to participate?
fi: Haluatko osallistua?

source: Untitled Event
fi: Nimeämätön tapahtuma

source: Chat
fi: Keskustelu

source: Chatters
fi: Keskustelijat

source: Chat visibility
fi: Keskustelun näkyvyys

source: Comment events
fi: Kommentoi tapahtumia

source: Disable
fi: Pois

source: Enable
fi: Päällä

source: Freeform HTML
fi: Vapaa HTML

source: Inline Media
fi: Media sivun sisällä

source: Send question
fi: Lähetä kysymys

source: User can comment events
fi: Käyttäjä voi kommentoida tapahtumaa

source: Write your question here
fi: Kirjoita kysymyksesi tähän

source: Send (action)
fi: Lähetä

source: This is the tag people will use when posting about this event. The maximum length of the social media tag is 15 characters.
fi: Tätä tagia ihmiset käyttävät kirjoittaessaan tapahtumasta. Sosiaalisen median tagin maksimipituus on 15 merkkiä.

source: Existing user, log in
fi: Käyttäjä, kirjaudu sisään

source: Invite users to event %1
fi: Kutsu käyttäjiä tapahtumaan %1

source: New user, register
fi: Uusi käyttäjä, rekisteröidy

source: Participant
fi: Osallistuja

source: Planner
fi: Järjestäjä

source: You have been invited to the event %1
fi: Sinut on kutsuttu tapahtumaan %1

source: This event is only for invited participants.
fi: Tämä tapahtuma on vain kutsutuille osallistujille.

source: This event is private.
fi: Tämä on yksityinen tapahtuma.

source: Confirm attendance
fi: Vahvista osallistuminen

source: Planners
fi: Järjestäjät

source: %1 days, %2 hours, %3 minutes and %4 seconds until the event starts.
fi: %1 päivä(ä), %2 tunti(a), %3 minuutti(a) ja %4 sekunti(a) tapahtuman alkuun.

source: %1 hours, %2 minutes and %3 seconds until the event starts.
fi: %1 tunti(a), %2 minuutti(a) ja %3 sekunti(a) tapahtuman alkuun.

source: %1 minutes and %2 seconds until the event starts.
fi: %1 minuutti(a) ja %2 sekunti(a) tapahtuman alkuun.

source: %1 seconds until the event starts.
fi: %1 sekunti(a) tapahtuman alkuun.

source: Counter
fi: Laskuri

source: The event has started.
fi: Tapahtuma on alkanut.

source: Remove custom icon
fi: Poista oma ikoni

source: Show all
fi: Näytä kaikki

source: Changes saved.
fi: Muutokset tallennettu.

source: Phone
fi: Puhelin

source: Separate addresses with commas (,) or semicolons (;).
fi: Erottele osoitteet pilkuilla (,) tai puolipisteillä (;).

source: Add a temporary login link at the end of the mail
fi: Lisää väliaikainen sisäänkirjautumislinkki sähköpostin perään

source: You can log in to the event page using this link (valid for one day)
fi: Voit kirjautua sisään tapahtuman sivulle tästä linkistä (voimassa yhden päivän)

source: Export to calendar (ics)
fi: Vie omaan kalenteriin (ics)

source: This column
fi: Tämä sarake

source: Title visible bith banner
fi: Otsikko näkyvissä bannerikuvan läsnäollessa

source: We recommend you use an image 580 or 900 pixels wide. (If it's wider than that, we'll scale it down.)
fi: Suosittelemme käyttämään 580 tai 900 pikseliä leveätä kuvaa. (Jos kuva on sitä suurempi, kutistamme sitä pienemmäksi)

source: Promotional buttons
fi: Promotointinapit

source: log in (within sentence)
fi: kirjaudu sisään

source: Please %1 or %2 to leave comments
fi: Ole hyvä ja %1 tai %2 jättääksesi kommentteja

source: Please %1 to leave comments
fi: Ole hyvä ja %1 jättääksesi kommentteja

source: register (within sentence)
fi: rekisteröidy

source: Add users to event without sending email
fi: Lisää käyttäjät tapahtumaan ilman sähköpostikutsua

source: User %1 added without sending email
fi: Käyttäjä %1 lisätty ilman sähköpostikutsua

source: Add users from the current area to event without sending email
fi: Lisää käyttäjät nykyiseltä alueelta tapahtumaan ilman sähköpostikutsua

source: events_organizer_confirmation_subject_template
fi: [% user_name %] osallistuu tapahtumaasi

source: events_organizer_confirmation_html_template
fi: <p>[% event_title %] -nimisellä tapahtumalla on uusi osanottaja: [% user_name %] ([% IF organization_title %][% organization_title %], [% END %][% organization %][% IF phone %], [% phone %][% END %], [% email %]).</p> <p>[%- IF in_html AND attend_info_html %] Tässä on lisätiedot, jotka [% user_name %] antoi:</p> <p>[% attend_info_html %]</p> <p>[%- END %] [%- IF ! in_html AND attend_info_text %] Tässä on lisätiedot, jotka [% user_name %] antoi:</p> <p>[% attend_info_text %]</p> <p>[%- END %] Pääset tapahtuman sivulle allaolevan linkin kautta seuraavan 24 tunnin ajan. Tämän jälkeen järjestelmä vaatii erillisen kirjautumisen. [% IF in_html %]<br/><a href="[% url %]">Mene sivulle</a>[% ELSE %][% url %][% END %]</p> <p></p> <p> </p>

source: events_organizer_confirmation_text_template
fi: [% event_title %] -nimisellä tapahtumalla on uusi osanottaja: [% user_name %] ([% IF organization_title %][% organization_title %], [% END %][% organization %][% IF phone %], [% phone %][% END %], [% email %]). [%- IF in_html AND attend_info_html %] Tässä on lisätiedot, jotka [% user_name %] antoi: [% attend_info_html %] [%- END %] [%- IF ! in_html AND attend_info_text %] Tässä on lisätiedot, jotka [% user_name %] antoi: [% attend_info_text %] [%- END %] Pääset tapahtuman sivulle allaolevan linkin kautta seuraavan 24 tunnin ajan. Tämän jälkeen järjestelmä vaatii erillisen kirjautumisen. [% IF in_html %]<br/><a href="[% url %]">Mene sivulle</a>[% ELSE %][% url %][% END %]

source: events_user_confirmation_subject_template
fi: Osallistumisesi on rekisteröity

source: events_user_confirmation_html_template
fi: <p>Tervehdys [% user_name %],</p> <p>Osallistumisesi tapahtumaan [% event_title %] on rekisteröity.</p> <p>Pääset tapahtuman sivulle allaolevan linkin kautta seuraavan 24 tunnin ajan. Tämän jälkeen järjestelmä vaatii erillisen kirjautumisen. [% IF in_html %]<br/><a href="[% url %]">Mene sivulle</a>[% ELSE %][% url %][% END %]</p> <p> </p>

source: events_user_confirmation_text_template
fi: Tervehdys [% user_name %], Osallistumisesi tapahtumaan [% event_title %] on rekisteröity. Pääset tapahtuman sivulle allaolevan linkin kautta seuraavan 24 tunnin ajan. Tämän jälkeen järjestelmä vaatii erillisen kirjautumisen. [% IF in_html %]<br/><a href="[% url %]">Mene sivulle</a>[% ELSE %][% url %][% END %]

source: Attendance successfully registered.
fi: Osallistuminen rekisteröity onnistuneesti.

source: Change of attendance successfully registered.
fi: Muutos osallistumiseen rekisteröity onnistuneesti.

source: Events past summary
fi: Menneiden tapahtumien yhteenveto

source: Listing of 5 past events
fi: Listaus 5 menneestä tapahtumasta
