Repository: meetings/core
Catalog: pkg/dicole_wiki/msg/messages-*.po
Languages: fi, sv

source: Browse pages
fi: Selaa sivuja
sv: Bläddra

source: Changed by %1
fi: %1 on muuttanut tätä osiota
sv: Ändrad av %1

source: Create page
fi: Luo sivu
sv: Skapa sida

source: Creating page '%1'
fi: Luodaan sivua '%1'
sv: Skapar sida '%1'

source: Wiki system for collaborative document writing.
fi: Wiki yhteisölliseen kirjoittamiseen.
sv: Wiki.

source: Group does not have a starting page!
fi: Ryhmällä ei ole aloitussivua!
sv: Gruppen har ingen startsida!

source: Latest pages
fi: Uusimmat sivut
sv: Senaste sidor

source: Links on this page
fi: Linkit tällä sivulla
sv: Länkar på denna sida

source: Links to this page
fi: Linkit tälle sivulle
sv: Länkar till denna sida

source: Locked by %1
fi: %1 on lukinnut tämän osion
sv: Reserverad av %1

source: New page creation
fi: Uuden sivun luonti
sv: Skapar ny sida

source: None
fi: Ei mikään
sv: Inga

source: Orphaned pages
fi: Eksyneet sivut
sv: Övergivna sidor

source: Or select page from list:
fi: Tai valitse sivu listasta:
sv: Eller välj sida från lista:

source: Page already exists!
fi: Sivu on jo olemassa!
sv: Sidan existerar redan!

source: Page created!
fi: Sivu luotu!
sv: Sida skapad!

source: Pages
fi: Sivut
sv: Sidor

source: Pages alphabetically
fi: Sivut aakkosjärjestyksessä
sv: Sidor i alfabetisk ordning

source: Page selector
fi: Sivun valitsija
sv: Sidoväljare

source: Pages linked to starting page
fi: Aloitussivun kautta löytyvät sivut
sv: Sidor länkade till startsida

source: Select page to use as base:
fi: Valitse pohjana käytettävä sivu:
sv: Välj sida att använda som modell:

source: Sidebar page
fi: Sivupalkin sivu

source: Structure of wiki
fi: Wikin rakenne
sv: Wikins struktur

source: Type page name:
fi: Kirjoita sivun nimi:
sv: Skriv sidans namn:

source: Type the name of the page:
fi: Kirjoita sivun nimi:
sv: Skriv sidans namn:

source: Wiki page %1
fi: Wiki sivu %1
sv: Wikins sida %1

source: Starting page
fi: Aloitussivu
sv: Startsida

source: Reserving lock..
fi: Varataan lukkoa..
sv: Reserverar...

source: Starting page not yet created.
fi: Aloitussivua ei ole vielä luotu.
sv: Ingen startsida har skapats.

source: Back
fi: Takaisin
sv: Tillbaka

source: Lock wiki pages
fi: Lukitse wiki sivu
sv: Lås wikisidorna

source: Page you requested does not exist
fi: Pyytämääsi sivua ei ole olemassa
sv: Sidan Ni begärt existerar inte

source: User can read wiki in this group
fi: Käyttäjä voi lukea ryhmän wikiä
sv: Användare kan läsa wiki i denna grupp

source: Description:
fi: Kuvaus:
sv: Beskrivning:

source: History for page %1
fi: Sivun %1 historia
sv: Historia för sida %1

source: Minor edit
fi: Vähäinen muutos
sv: Trivial ändring

source: Time
fi: Aika
sv: Tid

source: Minor
fi: Vähäinen
sv: Smärre

source: Creation
fi: Luonti
sv: Skapning

source: Change history
fi: Muutoshistoria
sv: Redigeringshistoria

source: Page
fi: Sivu
sv: Sida

source: Edit chapter
fi: Muokkaa kappaletta
sv: Redigera kapitel

source: Edit text
fi: Muokkaa
sv: Redigera text

source: Are you sure you want to cancel editing and lose all the changes you have made?
fi: Oletko varma, että haluat keskeyttää muokkaamisen ja menettää kaikki tekemäsi muutokset?
sv: Är Ni säker att Ni vill avbryta redigeringen och förlora alla ändringar Ni gjort?

source: Cancel editing
fi: Keskeytä muokkaaminen
sv: Avbryt redigerande

source: Continue editing
fi: Jatka muokkaamista
sv: Fortsätt att redigera

source: Could not parse file:
fi: Tiedoston lukeminen epäonnistui:

source: Created pages:
fi: Seuraavat sivut luotiin onnistuneesti:
sv: Skapade sidor:

source: Import pages
fi: Tuo sivuja tiedostosta
sv: Importera sidor

source: Some pages already existed:
fi: Joitakin sivuja oli jo olemassa:
sv: Några av sidorna fanns redan:

source: You should type a short description of the changes you have made in the text area below. This way other people can get a quick overview of recent changes. If you have made only small changes of which others require no notification (like fixed a typing error) you can just check the "Minor edit" checkbox.
fi: Jotta muut käyttäjät saisivat nopeasti kuvan siitä mitä muokkauksia olet sivuun tehnyt, tulisi sinun kuvata tekemäsi muokkaukset lyhyesti alla olevaan tekstialueeseen. Mikäli olet tehnyt vain pieniä muutoksia, joista muut eivät tarvitse ilmoitusta (kuten korjannut kirjoitusvirheen) voit sen sijaan valita kohdan "Vähäinen muutos".
sv: Beskriv kort i textrutan nedan vilka ändringar du gjort. På detta sätt kan andra användare få en snabb överblick över ändringarna. Om dina ändringar är triviala (stavfel etc.) så kruxa för "Trivial ändring"

source: No changes found.
fi: Muutoksia ei ole saatavilla.
sv: Inga ändringar hittades.

source: Changes for page %1
fi: Muutokset sivulla %1
sv: Ändringar för sida %1

source: Page actions
fi: Sivun toiminnot

source: Show changes
fi: Näytä muutokset
sv: Visa ändringar

source: Locked by you
fi: Olet lukinnut tämän osion
sv: Låst av dig

source: Printable page
fi: Tulostettava sivu
sv: Utskrivbar sida

source: Resume interrupted editing
fi: Jatka keskeytynyttä muokkausta
sv: Fortsätt avbruten redigering

source: No header (top of the page)
fi: Ei otsikkoa (sivun alku)
sv: Inget sidhuvud ()

source: Select page header:
fi: Valitse otsikko sivulta:
sv: Välj sidhuvud:

source: Contents
fi: Sisällysluettelo
sv: Innehåll

source: Edit beginning
fi: Muokkaa alkua
sv: Ändra början

source: Edit whole page
fi: Muokkaa koko sivua
sv: Ändra hela sidan

source: hide
fi: piilota
sv: dölj

source: show
fi: näytä
sv: visa

source: No page name specified!
fi: Sivun nimeä ei ole määritelty!
sv: Inget sidonamn angivet!

source: Previous changes
fi: Edelliset muutokset
sv: Föregående ändringar

source: Are you sure that you want to delete the page '%1' and it's version history?
fi: Oletko varma, että haluat poistaa sivun '%1' ja sen koko versiohistorian?
sv: Är du säker på att du will radera sidan '%1' och dess redigeringshistorik?

source: Confirm removing page '%1'
fi: Vahvista sivun '%1' poistaminen
sv: Bekräfta raderandet av sida '%1'

source: Page '%1' succesfully deleted
fi: Sivu '%1' poistettiin onnistuneesti
sv: Sida '%1' har raderats

source: Please note that the following pages are currently linking to this page:
fi: Huomioi, että seuraavat sivut osoittavat tähän sivuun:
sv: Notera att följande sidor länkar till denna sida:

source: Yes, I am sure
fi: Kyllä, olen varma
sv: Ja, jag är säker

source: close
fi: sulje
sv: stäng

source: Loading content..
fi: Ladataan sisältöä..
sv: Laddar innehåll...

source: preview
fi: esikatselu
sv: förhandsgranskning

source: Missing linked pages
fi: Puuttuvat sivut
sv: Sidor länkade till som fattas

source: Search results
fi: Haun tulokset
sv: Sökresultat

source: Search wiki
fi: Hae
sv: Sök i wikin

source: Wiki reader
fi: Wikin lukija
sv: Wikiläsare

source: Could not save changes because page is locked.
fi: Sivu on lukittu, joten muutoksia ei voitu tallentaa.
sv: Kunde inte spara ändringar p.g.a. att sidan är låst.

source: Latest changes in Wiki.
fi: Wikin viimeisimmät muutokset
sv: Senaste ändringar i Wiki.

source: Page is being edited so it could not be locked.
fi: Sivua muokataan parhaillaan, joten sitä ei voitu lukita.
sv: Sidan håller på att redigeras, så den kunde inte låsas.

source: Page locked.
fi: Sivu lukittu.
sv: Sida låst.

source: Page unlocked.
fi: Sivun lukitus poistettu.
sv: Sida upplåst.

source: Add page to summary
fi: Lisää sivu yhteenvetoon
sv: Lägg denna sida till Översikten

source: Bring pages to summary
fi: Tuo sivuja yhteenvetoon
sv: Hämta sidor till Översikten

source: Page added to summary.
fi: Sivu lisätty yhteenvetoon.
sv: Sidan lades till Översikten .

source: Page removed from summary.
fi: Sivu poistettu yhteenvedosta.
sv: Sida avlägsnad från Översikten .

source: Remove page from summary
fi: Poista sivu yhteenvedosta
sv: Avlägsna sida från Översikten

source: User can manage summary wiki pages
fi: Käyttäjä voi hallita yhteenvedossa näkyviä wikin sivuja
sv: Användare kan redigera Översiktssidor

source: This page needs content! You can add text, pictures and other interesting stuff by clicking %1 on the right.
fi: Tämä tyhjä sivu kaipaa sisältöä! Voit lisätä tekstiä, kuvia tai muuta mielenkiintoista klikkaamalla %1 oikealta.
sv: Denna sida behöver innehåll! Ni kan lägga till text, bilder och andra intresanta saker genom att klicka %1 vid höger sida.

source: You have not saved or cancelled the edit and the part you were editing is still locked. If you continue others can not edit the part until your lock expires.
fi: Et ole tallentanut tai peruuttanut muokkaustasi ja muokkaamasi osa on edelleen lukittu. Mikäli jatkat pois sivulta muut eivät voi muokata osaa ennen kuin lukko erääntyy.
sv: Du har inte sparat eller avbrytit redigeringen och den del du höll på att redigera är ännu reserverad. Ifall du fortsätter kan inte andra redigera den reserverade delen förrän din reservation av sidan föråldrats.

source: Version changes
fi: Versioiden muutokset
sv: Versionsändringar

source: Updates in wiki
fi: Päivitykset wikissä
sv: Uppdateringar i wikin

source: No pages matched your search
fi: Yksikään sivu ei vastannut hakuasi
sv: Inga sidor motsvarade din sökning

source: Wiki latest changes summary
fi: Wikin viimeisimpien muutosten yhteenveto
sv: Sammandrag av senaste ändringar i wikin

source: Could not revert since the page is locked.
fi: Versiota ei voitu palauttaa, sillä sivu on lukittu
sv: Kunde inte återgå p.g.a. att sidan är reserverad.

source: Revert failed because the page is currenty being edited.
fi: Sivua ei voitu palauttaa, sillä joku muokkaa sivua parhaillaan.
sv: Återställningen misslyckades p.g.a. att sidan redigeras får tillfället.

source: Revert succesful
fi: Sivun palautus onnistui
sv: Återställning lyckades

source: Revert to this version
fi: Palauta sivu tähän versioon
sv: Återställ denna versionen

source: ( version %1 )
fi: ( versio %1 )

source: Revert
fi: Palautus
sv: Nästa version

source: Next version
fi: Seuraava versio

source: Page change history
fi: Sivun muutoshistoria
sv: Sidans redigeringshistoria

source: Previous version
fi: Edellinen versio
sv: Föregående version

source: No attachments.
fi: Ei liitetiedostoja.
sv: Inga bilagor.

source: No tags yet.
fi: Ei vielä avainsanoja.
sv: Inga tags tillagda.

source: Page info
fi: Sivun tietoja
sv: Sidoinfo

source: Pages by tag %1
fi: Sivut avainsanalla %1
sv: Sidor enligt tag %1

source: Page tags
fi: Sivun avainsanat
sv: Tags på sidan

source: Info for page %1
fi: Sivun %1 tiedot
sv: Info för sida %1

source: Add Attachment
fi: Lisää liite
sv: Lägg till bilaga

source: Attachments updated
fi: Liitteet päivitetty
sv: Bilagorna uppdaterade

source: Descrption:
fi: Kuvaus:
sv: Beskrivning:

source: Information about this page
fi: Sivun tietoja
sv: Information om denna sida

source: Minor edit:
fi: Pieni muutos:
sv: Trivial redigering:

source: Pages by tag
fi: Sivut avainsanalla
sv: Sidor sorterade enligt tags

source: Settings of wikipage:
fi: Wikisivun asetukset:
sv: Wikisidans inställningar:

source: Contributors
fi: Tekijät
sv: Bidragare

source: Edit info for page %1
fi: Muokkaa sivun tietoja %1
sv: Redigera info för sida %1

source: (empty description will automatically result in a minor edit)
fi: (tyhjä kuvaus merkitään automaattisesti vähäiseksi)
sv: (en tom förklaringsruta resulterar automatiskt i Trivial redigering)

source: Disable comments
fi: Piilota kommentit

source: Disable page comments
fi: Sivukohtainen kommenttien piilotus

source: Enable comments
fi: Palauta kommentit

source: Page comments disabled.
fi: Sivun kommentit piilotettu.

source: Page comments enabled.
fi: Sivun kommentit palautettu.

source: Remove any page attachments
fi: Kaikkien sivun liitteiden poistaminen

source: Remove comments
fi: Kommenttien poistaminen

source: User can enable and disable individual page comments
fi: Käyttäjä voi piilottaa ja palauttaa yksittäisten sivujen kommentoinnin

source: User can remove any wiki page attachments in this group
fi: Käyttäjä voi poistaa minkä tahansa sivun liitetiedostoja riippumatta lähettäjästä

source: User can remove comments to any wiki page
fi: Käyttäjä voi poistaa sivun kommentteja kirjoittajasta riippumatta

source: User can write comments to any wiki page
fi: Käyttäjä voi kommentoida wikisivuja

source: Wiki commenting
fi: Wikin kommentointi

source: Write comments
fi: Kommenttien kirjoitus

source: Choose
fi: Valitse

source: Loading...
fi: Ladataan...

source: Show comments
fi: Näytä kommentit

source: Support
fi: Kannata

source: support(s)
fi: kannatus(ta)

source: Unsupport
fi: Poista kannatus

source: Write your comment here
fi: Kirjoita kommenttisi tähän

source: You can only comment uncommented sections within a paragraph.
fi: Voit kommentoida vain kommentoimattomia osia yhden kappaleen sisältä.

source: Remove annotations
fi: Poista annotointeja

source: User can remove annotations on any wiki page
fi: Käyttäjä voi poistaa annotointeja wikisivuilta

source: User can write annotations to any wiki page
fi: Käyttäjä voi kirjoittaa annotointeja wikisivuille

source: Wiki annotating
fi: Wikin annotoiminen

source: Write annotations
fi: Kirjoita annotointeja

source: Comment (action)
fi: Lisää kommentti
sv: Comment

source: %1 support(s) (by %2)
fi: %1 kannatus(ta) (%2)

source: Comments to marked sections
fi: Kommentit merkittyihin osiin

source: Comments to the whole page
fi: Kommentit koko sivuun

source: Disable annotations
fi: Piilota annotointi

source: Enable annotations
fi: Mahdollista annotointi

source: Page annotations disabled.
fi: Sivun annotointi piilotettu.

source: Page annotations enabled.
fi: Sivun annotointi mahdollistettu.

source: Printable page with comments
fi: Tulostettava sivu kommenteilla

source: support
fi: kannatus

source: supports
fi: kannatusta

source: Are you sure you want to remove this comment?
fi: Oletko varma, että haluat poistaa kommentin?

source: Browse page versions
fi: Selaa sivun versioita

source: User can see older versions of pages
fi: Käyttäjä näkee sivujen aikaisemmat versiot

source: Yes, remove the comment
fi: Kyllä, poista kommentti

source: New page name:
fi: Sivun uusi nimi:

source: Renaming page '%1'
fi: Uudelleennimetään sivua '%1'

source: Rename page
fi: Vaihda sivun nimeä

source: Wiki starting page in summary
fi: Wikin aloitussivu yhteenvedossa

source: The wiki starting page is currently empty. You can add content to the starting page by entering the wiki tool from the top navigation.
fi: Wikin aloitussivu on tällä hetkellä tyhjä. Voit lisätä sille sisältöä siirtymällä wiki-työkaluun ylänavigaatiosta.

source: Configure wiki
fi: Wikin asetusten määritys

source: Create wiki pages
fi: Luo wikisivuja

source: Creator
fi: Luoja

source: Deny wiki moderation
fi: Poista wikisivujen muokkaus käytöstä

source: Deny wiki use
fi: Poista wikin käyttöoikeus

source: Edit wiki pages
fi: Muokkaa wikisivuja

source: Last modified
fi: Viimeksi muokattu

source: Limit feed access by IP addresses (each on a separate line)
fi: Rajoita syötteen käyttö IP osoitteiden mukaan (yksi per rivi)

source: Lock page
fi: Lukitse sivu

source: No pages found.
fi: Sivuja ei löytynyt.

source: Read wiki
fi: Lue wikiä

source: Remove page
fi: Poista sivu

source: Remove wiki pages
fi: Poista wikisivuja

source: Rename
fi: Uudelleennimeä

source: Requested version does not exists!
fi: Pyydettyä versiota ei ole olemassa!

source: Show current page
fi: Näytä nykyinen sivu

source: Unlock page
fi: Poista sivun lukitus

source: User can configure wiki tool in this group
fi: Käyttäjä voi muokata wiki-työkalua tässä ryhmässä

source: User can create wiki pages in this group
fi: Käyttäjä voi luoda wikisivuja tässä ryhmässä

source: User can edit wiki pages in this group
fi: Käyttäjä voi muokata wikisivuja tässä ryhmässä

source: User can lock and unlock wiki pages in this group
fi: Käyttäjä voi lukita ja vapauttaa wikisivuja tässä ryhmässä

source: User can remove wiki pages in this group
fi: Käyttäjä voi poistaa wikisivuja tässä ryhmässä

source: Wiki moderator
fi: Wikin ylläpitäjä

source: Wiki rights
fi: Wikin oikeudet

source: Wiki user
fi: Wikin käyttäjä

source: Wiki summaries separately
fi: Wikin yhteenvetosivut itsekseen

source: Wiki summary pages separately without icon.
fi: Wikin yhteenvetosivut itsekseen ilman ikonia.

source: Show annotations by default
fi: Sivujen annotointi oletusarvoisesti päällä
