Repository: meetings/core
Catalog: pkg/dicole_external/msg/messages-*.po
Languages: fi

source: Access external tools
fi: Pääsy ulkopuoliseen työkaluun

source: Add integration
fi: Lisää integraatio

source: Custom fields to use (replaces %%field%% in parameter values with the value of custom object field)
fi: Omat kentät (muuntaa muuttujan %%field%% parametrien arvoissa oman objektin kentän arvolla)

source: Custom object ID
fi: Oman objektin ID

source: Custom SPOPS object for fetching parameter values
fi: Oma SPOPS -objekti parametrien arvojen hakuun

source: Custom SQL WHERE query (you can use %%user_id%% and %%target_id%% in the query)
fi: Oma SQL WHERE -kutsu (voit käyttää %%user_id%% ja %%target_id%% muuttujia kutsussa)

source: Fill in username
fi: Täydennä käyttäjätunnuksella

source: Fill in user password
fi: Täydellä salasanalla

source: Group
fi: Ryhmä

source: Group ID's that can access
fi: Ryhmien ID:t, joilla pääsy työkaluun

source: Identification name
fi: Tunniste

source: Identification name not defined.
fi: Tunnistetta ei ole määritelty.

source: Integration details
fi: Integraation yksityiskohdat

source: Integration has been saved.
fi: Integraatio on tallennettu.

source: Integration with name %1 already exists.
fi: Integraatio nimellä %1 on jo olemassa.

source: Integrator
fi: Integraattori

source: List integrations
fi: Listaa integraatiot

source: List of integrations
fi: Lista integraatioista

source: Manage integrations
fi: Hallitse integraatioita

source: Modify integration
fi: Muokkaa integraatiota

source: Name of navigation element
fi: Navigaatioelementin nimi

source: Navigation icon
fi: Navigaation ikoni

source: Navigation identification name not defined.
fi: Navigaation tunnistetta ei ole määritelty.

source: Navigation ID
fi: Navigaation ID

source: Navigation item with name %1 already exists.
fi: Navigaatioelementti nimellä %1 on jo olemassa.

source: Navigation parent element
fi: Sijoita seuraavan navigaatioelementin alle

source: Parameters
fi: Parametrit

source: Password field in request
fi: Salasanakenttä kutsussa

source: Persistent in navigation
fi: Pysyvä navigaatiossa

source: Position number in navigation
fi: Sijaintinumero navigaatiossa

source: Remove integrations
fi: Poista integraatioita

source: Request
fi: Kutsu

source: Show list of integrations
fi: Näytä lista integraatioista

source: Type of external tool
fi: Integraation tyyppi

source: URL
fi: URL -osoite

source: Use navigation element
fi: Käytä navigaatioelementtiä

source: User can manage integrations
fi: Käyttäjä voi hallita integraatioita

source: User field in request
fi: Käyttäjänimen kenttä kutsussa

source: User ID's that can access
fi: Käyttäjien ID:t, joilla pääsy työkaluun

source: Use target ID as custom object ID
fi: Käytä target ID:tä oman objektin ID:nä

source: Use user ID as custom object ID
fi: Käytä käyttäjä ID:tä oman objektin ID:nä
