Repository: meetings/core
Catalog: pkg/dicole_*/msg/messages-*.po
Languages: fi, sv

source: Default personal rights
fi: Käyttäjän oletusoikeudet
sv: Default personliga rättigheter

source: Yes
fi: Kyllä
sv: Ja

source: No
fi: Ei
sv: Nej

source: Search
fi: Hae
sv: Sök

source: Clear search
fi: Tyhjennä haku
sv: Töm sökresultaten

source: Next
fi: Seuraava
sv: Nästa

source: Previous
fi: Edellinen
sv: Föregående

source: Cancel
fi: Peruuta
sv: Avbryt

source: Add checked items
fi: Lisää merkityt kohteet
sv: Lägg till valda

source: Remove checked
fi: Poista merkityt
sv: Avlägsna valda

source: Check all
fi: Merkitse kaikki
sv: Välj alla

source: Clear checkboxes
fi: Poista merkinnät
sv: Återta val

source: Nothing found.
fi: Kohteita ei löytynyt.
sv: Inga sökresultat.

source: Page:
fi: Sivu:
sv: Sida:

source: Search:
fi: Haku:
sv: Sök:

source: Finish
fi: Valmis
sv: Avsluta

source: Success
fi: OK
sv: Det lyckades

source: Warning
fi: Varoitus
sv: Varning

source: Error
fi: Virhe
sv: Fel

source: An error occured: %1
fi: Virhe tapahtui: %1
sv: Ett fel uppstod: %1

source: Creating document %1 failed: %1
fi: Dokumentin %1 luonti epäonnistui: %1
sv: Skapandet av dokument %1 misslyckades: %1

source: Creating folder %1 failed: %2
fi: Kansion %1 luonti epäonnistui: %2
sv: Skapandet av mapp %1 misslyckades: %2

source: Default
fi: Oletus

source: Document %1 written.
fi: Dokumentti %1 on luotu.
sv: Dokument %1 srivet.

source: File %1 does not exist.
fi: Tiedostoa %1 ei löydy.
sv: Fil %1 finns inte till .

source: File %1 is not in GZIP format.
fi: Tiedosto %1 ei ole GZIP formaatissa.
sv: Fil %1 är inte i GZIP format.

source: File %1 is not in TAR format.
fi: Tiedosto %1 ei ole TAR formaatissa.
sv: Fil %1 är inte i TAR format.

source: File %1 is not in ZIP format.
fi: Tiedosto %1 ei ole ZIP formaatissa.
sv: Fil %1 är inte i ZIP format.

source: File %1 uncompressed.
fi: Tiedosto %1 purettu.
sv: Fil %1 uppackad.

source: File %1 uploaded.
fi: Tiedosto %1 siirretty palvelimelle.
sv: Fil %1 har laddats upp.

source: File upload field does not exist.
fi: Tiedoston siirtoon palvelimelle tarkoitettua kenttää ei löytynyt.
sv: Filuppladdningsfältet finns inte.

source: Folder %1 already exists.
fi: Kansio %1 on jo olemassa.
sv: Mapp %1 existerar redan .

source: Folder %1 created.
fi: Kansio %1 on luotu.
sv: Mapp %1 skapad.

source: Full screen
fi: Koko näyttö
sv: Helskärm

source: New document %1 created.
fi: Uusi dokumentti %1 on luotu.
sv: Nytt dokument %1 skapat.

source: Renamed %1 as %2.
fi: Kohde %1 on nimetty uudelleen. Uusi nimi on %2.
sv: Namnet ändrat från %1 till %2.

source: Renaming location failed: %1
fi: Kohteen uudelleen nimeäminen epäonnistui: %1
sv: Namnändring av plats misslyckades: %1

source: Resolution:
fi: Resoluutio:
sv: Lösning:

source: The following files already exist: %1
fi: Seuraavat tiedostot ovat jo olemassa: %1
sv: Följande filer existerar redan: %1

source: Uncompression method for file %1 is not supported.
fi: Tiedostolle %1 ei ole olemassa purkumenetelmää.
sv: Uppackningsmetod för fil %1 stöds inte.

source: Writing document %1 failed: %2
fi: Dokumentin %1 kirjoittaminen epäonnistui: %2
sv: Utskrift av dokument %1 misslyckades: %2

source: %1 already exists.
fi: Kohde %1 on jo olemassa.
sv: %1 existerar redan.

source: Valid XHTML 1.0
fi: Standardien mukaista XHTML 1.0 -lähdekoodia

source: Select
fi: Valitse
sv: Välj

source: or add new
fi: tai lisää uusi
sv: eller lägg till ny

source: The fields marked with arrows are required.
fi: Nuolilla merkityt kentät ovat pakollisia.
sv: Fälten markerade med pil är obligatoriska.

source: The passwords do not match.
fi: Salasanat eivät täsmää.
sv: Lösenorden stämmer inte.

source: The password is too short. Minimum password length is %1 characters.
fi: Salasana on liian lyhyt. Salasanan pitää olla vähintään %1 merkkiä pitkä.
sv: Lösenordet är för kort. Minsta tillåtna längd för lösenord är %1 tecken.

source: Browse...
fi: Selaa...
sv: Bläddra...

source: Powered by Dicole Knowledge Work Environment
fi: Ytimenä toimii Dicole tietotyöympäristö
sv: Powered by Dicole Community Platform

source: Link to file area
fi: Linkki tiedostoalueelle
sv: Länk till filområde

source: Download
fi: Lataa
sv: Ladda ner

source: View
fi: Katsele
sv: Granska

source: Properties
fi: Tarkemmat tiedot
sv: Egenskaper

source: Save failed: %1
fi: Tallennus epäonnistui: %1
sv: Sparandet misslyckades: %1

source: Are you sure you want to remove the selected items?
fi: Oletko varma, että haluat poistaa merkityt kohteet?
sv: Är Ni säker att Ni vill radera de valda objekten?

source: Confirmation
fi: Varmistus
sv: Bekräfta

source: Error during remove: %1
fi: Virhe poiston yhteydessä: %1
sv: Fel under avlägsnandet: %1

source: Edit
fi: Muokkaa
sv: Redigera

source: Archive checked
fi: Arkistoi merkityt
sv: Arkivet kontrollerat

source: Are you sure you want to archive the selected items?
fi: Oletko varma, että haluat siirtää merkityt kohteet arkistoon?
sv: Är du säker på att du vill arkivera de valda?

source: Show archived
fi: Näytä arkistoidut
sv: Visa arkiverade

source: Error during archive: %1
fi: Virhe arkistoitaessa: %1
sv: Fel under arkivering: %1

source: Box title
fi: Laatikon otsikko
sv: Lådans titel

source: Restore checked
fi: Palauta merkityt arkistosta
sv: Återställ valda

source: Error during restore: %1
fi: Virhe palautuksen yhteydessä: %1
sv: Ett fel uppstod under återställandet: %1

source: Show archive
fi: Näytä arkisto
sv: Visa arkiv

source: Data was saved successfully.
fi: Tiedot on tallennettu onnistuneesti.
sv: Data sparades.

source: Steps
fi: Vaiheet
sv: Steg

source: Subscribe with feed reader
fi: Tilaa noutajaan
sv: Prenumerera med s.k. Feed reader

source: Personal compilations
fi: Henkilökohtaiset oikeuskokoelmat
sv: Personlig sammanställning

source: Are you sure you want to remove the selected themes?
fi: Oletko varma, että halut poistaa merkityt teemat?
sv: Är du säker på att du vill avlägsna valda teman?

source: Default theme
fi: Oletusteema
sv: Default tema

source: Description
fi: Kuvaus
sv: Beskrivning

source: Error while installing theme: %1
fi: Virhe asennettaessa teemaa: %1
sv: Ett fel uppkom då temat skulle installeras: %1

source: File is not a valid theme package!
fi: Tiedosto ei ole toimiva teema!

source: Installed version %1 of theme %2
fi: Versio %1 asennettu teemasta %2
sv: Installerade version %1 av tema %2

source: List of themes
fi: Teemalistaus
sv: Listä över teman

source: List themes
fi: Listaa teemat
sv: Lista teman

source: Manage themes
fi: Hallitse teemoja
sv: Ordna teman

source: Name
fi: Nimi
sv: Namn

source: No image.
fi: Ei kuvaa.
sv: Ingen bild.

source: Remove themes
fi: Poista teemoja
sv: Avlägsna teman

source: Screenshot
fi: Kuvankaappaus
sv: Skärmdump

source: Set as default theme
fi: Aseta oletusteemaksi
sv: Ange default tema

source: Show list of themes
fi: Näytä lista teemoista
sv: Visa lista över teman

source: Theme author
fi: Teeman tekijä

source: Theme details
fi: Teeman tiedot

source: Theme in ZIP format
fi: Teema ZIP pakattuna tiedostona

source: Theme manager
fi: Teemahallinta

source: Theme Manager
fi: Teemahallinta

source: Themes registered in the system
fi: Järjestelmään rekisteröidyt teemat

source: This theme requires parent theme package %1 which is not present.
fi: Tämä teema vaatii isäntäteeman %1, jota ei ole tällä hetkellä asennettuna.

source: This theme version is already installed.
fi: Tämä teemaversio on jo asennettu.

source: Unable to find conf/theme.ini in theme package %1
fi: Tiedostoa conf/theme.ini ei löytynyt teemapaketista %1

source: Upload theme in ZIP format
fi: Siirrä teema palvelimelle ZIP muodossa

source: Upload theme
fi: Siirrä teema

source: Upload
fi: Siirrä uusi
sv: Ladda upp

source: User can manage themes installed in the system
fi: Käyttäjä voi hallita järjestelmään asennettuja teemoja

source: Version
fi: Versio

source: Help
fi: Ohje
sv: Hjälp

source: Generate password
fi: Luo satunnainen salasana
sv: Skapa lösenord

source: Send password through email
fi: Lähetä salasana sähköpostitse
sv: Sänd lösenord via e-post

source: Email content for login credentials
fi: Sähköpostisisältö tunnusten lähettämistä varten
sv: Innehåll i e-post med inloggningsuppgifter

source: Subject of login credentials email
fi: Tunnukset sisältävän sähköpostin otsikko
sv: Ämne för e-post med inloggningsuppgifter

source: Calendar
fi: Kalenteri
sv: Kalender

source: Given date does not exist
fi: Annettua päivämäärää ei ole olemassa
sv: Angivet datum finns ej

source: You do not have the rights to access the page you tried to open. Contact your administrator for more information.
fi: Yritit avata sivun, jota sinulla ei ole oikeutta nähdä. Ota tarvittaessa yhteyttä ylläpitäjääsi.

source: a moment ago (about_when)
fi: hetki sitten
sv: a moment ago

source: an hour ago (about_when)
fi: tunti sitten
sv: an hour ago

source: %1 hours ago (about_when)
fi: %1 tuntia sitten
sv: %1 hours ago

source: yesterday (about_when)
fi: eilen
sv: yesterday

source: on monday (about_when)
fi: maanantaina
sv: on monday

source: on tuesday (about_when)
fi: tiistaina
sv: on tuesday

source: on wednesday (about_when)
fi: keskiviikkona
sv: on wednesday

source: on thursday (about_when)
fi: torstaina
sv: on thursday

source: on friday (about_when)
fi: perjantaina
sv: on friday

source: on saturday (about_when)
fi: lauantaina
sv: on saturday

source: on sunday (about_when)
fi: sunnuntaina
sv: on sunday

source: %1 days ago (about_when)
fi: %1 päivää sitten
sv: %1 days ago
