Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_back-*.po
Languages: fi, fr, nl, sv

source: Meeting title changes
fi: Kokouksen nimi muutettu
fr: Modifications du titre de la réunion
nl: Titelveranderingen van de vergadering
sv: Ändringar av mötestiteln

source: Location changes
fi: Kokouksen sijainti muutettu
fr: Changements de lieu
nl: Plaatsveranderingen
sv: Ändringar av platsen

source: New participants
fi: Uusi osallistuja
fr: Nouveaux participants
nl: Nieuwe deelnemers
sv: Nya deltagare

source: New materials
fi: Uusia materiaaleja
fr: Nouveaux documents
nl: Nieuwe materialen
sv: Nya referensmaterial

source: New comments
fi: Uusia kommentteja
fr: Nouveaux commentaires
nl: Nieuwe commentaren
sv: Nya kommentarer

source: Calendar events and updates (iCal):
fi: Kalenterikutsut ja -päivitykset (iCal):
fr: Événements et mises à jour de calendrier (iCal) :
nl: Agenda-afspraken en updates (iCal):
sv: Kalenderhändelser och uppdateringar (iCal):

source: Receive events and updates
fi: Vastaanota kalenteripäivitykset
fr: Recevoir les événements et les mises à jour
nl: Afspraken en updates ontvangen
sv: Ta emot händelser och uppdateringar

source: Send me a push notification when:
fi: Ilmoita laitteessani:
fr: M'envoyer une notification quand :
nl: Stuur me een push-notificatie wanneer:
sv: Skicka mig en pushnotis när:

source: Meeting invitation is received
fi: Uusista kokouskutsuista
fr: L'invitation à la réunion a été reçue
nl: De uitnodiging voor de vergadering is ontvangen
sv: Mötesinbjudan har tagits emot

source: New participant is added
fi: Uusista osallistujista
fr: Un nouveau participant a été ajouté
nl: Een nieuwe deelnemer is toegevoegd
sv: Ny deltagare har lagts till

source: New material is added
fi: Lisätyistä materiaaleista
fr: Un nouveau document a été ajouté
nl: Nieuw materiaal is toegevoegd
sv: Nya referensmaterial har lagts till

source: New comment is received
fi: Uusista kommenteista
fr: Nouveau commentaire reçu
nl: Nieuw commentaar is ontvangen
sv: Ny kommentar har tagits emot

source: Facebook connected succesfully!
fi: Facebook yhdistetty onnistuneesti!
fr: La connexion à Facebook a réussi !
nl: Succesvol met Facebook verbonden!
sv: Anslutningen till Facebook lyckades!

source: Google connected succesfully!
fi: Google yhdistetty onnistuneesti!
fr: Google connecté avec succès !
nl: Google succesvol verbonden!
sv: Anslutningen till Google lyckades!

source: Dropbox connected succesfully! Your files will start to sync in the background momentarily.
fi: Dropbox yhdistetty onnistuneesti! Kokousmateriaalisi alkavat piakkoin synkronoitua palveluun.
fr: Dropbox connecté avec succès ! La synchronisation en arrière-plan de vos fichiers commencera sous peu.
nl: Box voor opslag succesvol verbonden! Je bestanden worden meteen op de achtergrond gesynchroniseerd
sv: Anslutningen till Dropbox lyckades. Hädanefter kommer dina filer kontinuerligt att synkroniseras.

source: Twitter connected succesfully!
fi: Twitter yhdistetty onnistuneesti!
fr: Twitter connecté avec succès !
nl: Twitter is succesvol verbonden!
sv: Kopplingen till Twitter lyckades!

source: LinkedIn connected succesfully!
fi: LinkedIn yhdistetty onnistuneesti!
fr: LinkedIn connecté avec succès !
nl: Linkedln succesvol verbonden!
sv: Anslutningen till LinkedIn lyckades!

source: You were removed from meeting %1$s
fi: Sinut on poistettu kokouksesta %1$s
fr: Vous avez été retiré(e) de la réunion %1$s
nl: Je bent verwijderd uit meeting %1$s
sv: Du har tagits bort från mötet %1$s

source: You have been removed from the mailing list!
fi: Sinut on poistettu sähköpostilistalta!
fr: Vous n'êtes plus sur la liste de diffusion !
nl: Je bent uit de maillijst verwijderd!
sv: Du har tagits bort från e-postlistan!

source: You will again receive iCal emails!
fi: Tulet taas jatkossa vastaanottamaan iCal-tiedostoja sisältäviä sähköposteja.
fr: Vous recevrez à nouveau les e-mails iCal !
nl: Je zult weer iCal e-mails ontvangen!
sv: Du kommer att få påminnelser från iCal igen!

source: You will no longer receive iCal emails!
fi: Et saa jatkossa iCal-tiedostoja sisältäviä sähköposteja.
fr: Vous ne recevrez plus d'e-mail iCal !
nl: Je zult verder geen iCal e-mails ontvangen!
sv: Du kommer inte att få iCal-påminnelser längre!

source: Disabled email processing notifications.
fi: Ilmoitukset sähköpostiviestien käsittelystä ovat kytketty pois päältä.
fr: Notifications du traitement des e-mails désactivées.
nl: Meldingen van het verwerken van e-mail uitgeschakeld.
sv: E-postmeddelanden om proceduren har inaktiverats.

source: You need to accept the Terms of Service!
fi: Sinun täytyy hyväksyä palvelumme käyttöehdot.
fr: Vous devez accepter les conditions d'utilisation !
nl: Je moet de leveringsvoorwaarden accepteren!
sv: Du måste acceptera användarvillkoren!

source: We are sorry but the system did not understand the provided date. Please check the date and try again!
fi: Valitettavasti järjestelmä ei ymmärtänyt annettua ajankohtaa. Tarkista se ja yritä uudelleen.
fr: Nous sommes désolés mais notre système n'a pas réussi à comprendre la date fournie. Merci de vérifier la date et de réessayer !
nl: Sorry, maar het systeem herkent de aangegeven datum niet. Check de datum en probeer het opnieuw!
sv: Vi ber om ursäkt men systemet kunde inte förstå det datum du angett. Kontrollera datumet och försök igen!

source: %1$s created successfully
fi: %1$s luotu onnistuneesti
fr: %1$s créé(e) avec succès
nl: %1$s succesvol aangemaakt
sv: %1$s har skapats

source: %1$s of January
fi: %1$s tammikuuta
fr: %1$s de janvier
nl: %1$s januari
sv: %1$s januari

source: %1$s of February
fi: %1$s helmikuuta
fr: %1$s de février
nl: %1$s februari
sv: %1$s februari

source: %1$s of March
fi: %1$s maaliskuuta
fr: %1$s de mars
nl: %1$s maart
sv: %1$s mars

source: %1$s of April
fi: %1$s huhtikuuta
fr: %1$s d'avril
nl: %1$s april
sv: %1$s april

source: %1$s of May
fi: %1$s toukokuuta
fr: %1$s de mai
nl: %1$s mei
sv: %1$s maj

source: %1$s of June
fi: %1$s kesäkuuta
fr: %1$s de juin
nl: %1$s juni
sv: %1$s juni

source: %1$s of July
fi: %1$s heinäkuuta
fr: %1$s de juillet
nl: %1$s juli
sv: %1$s juli

source: %1$s of August
fi: %1$s elokuuta
fr: %1$s d'août
nl: %1$s augustus
sv: %1$s augusti

source: %1$s of September
fi: %1$s syyskuuta
fr: %1$s de septembre
nl: %1$s september
sv: %1$s september

source: %1$s of October
fi: %1$s lokakuuta
fr: %1$s d'octobre
nl: %1$s oktober
sv: %1$s oktober

source: %1$s of November
fi: %1$s marraskuuta
fr: %1$s de novembre
nl: %1$s november
sv: %1$s november

source: %1$s of December
fi: %1$s joulukuuta
fr: %1$s de décembre
nl: %1$s van december
sv: %1$s december

source: Today
fi: Tänään
fr: Aujourd'hui
nl: Vandaag
sv: Idag

source: Tomorrow
fi: Huomenna
fr: Demain
nl: Morgen
sv: Imorgon

source: In %1$s days
fi: %1$s päivän päästä
fr: Dans %1$s jours
nl: Binnen %1$s dagen
sv: om %1$s dagar

source: Your changes have been saved successfully.
fi: Tekemäsi muutokset tallennettiin onnistuneesti.
fr: Vous modifications ont été enregistrées avec succès.
nl: Je veranderingen zijn succesvol opgeslagen
sv: Dina ändringar har sparats.

source: Could not send invite to %1$s. No invites left!
fi: Kutsu käyttäjälle %1$s ei voitu lähettää. Kaikki kutsut on käytetty.
fr: Impossible d'envoyer une invitation à %1$s. Vous n'avez plus d'invitations !
nl: Kon geen uitnodiging naar %1$s sturen. Er zijn geen uitnodigingen meer!
sv: Det gick inte att skicka inbjudan till %1$s. Du har inga inbjudningar kvar!

source: Invite sent to %1$s
fi: Kutsu lähetetty käytätjälle %1$s
fr: Invitation envoyée à %1$s
nl: Uitnodiging verzonden aan %1$s
sv: Inbjudan skickad till %1$s

source: Please enter a valid email address.
fi: Ole hyvä ja syötä toimiva sähköpostiosoite.
fr: Veuillez entrer une adresse e-mail valide.
nl: Voer alstublieft een geldig e-mail adres in.
sv: Ange en giltig e-postadress.

source: We do not have a user with email %1$s.
fi: Palvelussamme ei ole käyttäjää, jonka sähköposti on %1$s.
fr: Nous n'avons aucun utilisateur correspondant à l'e-mail %1$s.
nl: We hebben geen gebruiker met e-mail %1$s.
sv: Vi har ingen användare med e-postadressen %1$s.

source: %1$s added successfully
fi: %1$s lisätty onnistuneesti
fr: %1$s ajouté(e) avec succès
nl: %1$s succesvol toegevoegd
sv: %1$s har lagts till

source: %1$s successfully removed
fi: %1$s poistettu onnistuneesti
fr: %1$s retiré(e) avec succès
nl: %1$s succesvol verwijderd
sv: %1$s har tagits bort

source: Date already exists
fi: Ajankohta on jo olemassa
fr: Cette date existe déjà
nl: De datum bestaat al
sv: Det här datumet finns redan.

source: Too many proposals
fi: Liian monta ehdotusta
fr: Trop de propositions
nl: Teveel voorstellen
sv: För många förslag

source: The date could not be parsed
fi: Ajankohtaa ei pystytty käsittelemään
fr: La date n'a pas pu être analysée
nl: De datum kon niet worden nagegaan
sv: Datumet kunde inte tolkas

source: Please give the meeting a title!
fi: Anna kokoukselle otsikko!
fr: Veuillez donner un titre à la réunion !
nl: Geef de meeting een titel!
sv: Ange en rubrik för mötet!

source: Congratulations! You are now using Meetin.gs PRO.
fi: Onneksi olkoon! Käytössäsi on nyt Meetin.gs PRO.
fr: Félicitations ! Vous utilisez maintenant Meetin.gs PRO.
nl: Gefeliciteerd! Je gebruikt nu Meetin.gs PRO.
sv: Grattis! Du använder nu Meetin.gs PRO.

source: Login
fi: Kirjaudu sisään
fr: Identifiant
sv: Inloggning

source: Schedule a meeting with %1$s
fi: Etsi tapaamisaika käyttäjän %1$s kanssa
fr: Programmer une réunion avec %1$s
nl: Plan een meeting met %1$s
sv: Planera ett möte med %1$s

source: Meetin.gs - Meet %1$s
fi: Meetin.gs - Tapaa %1$s
fr: Meetin.gs - Rencontrez %1$s
nl: Meetin.gs - ontmoet %1$s
sv: Meetin.gs - Träffa %1$s

source: Share your Meet Me url
fi: Jaa Meet Me -sivusi osoite
fr: Partagez votre URL « me rencontrer »
nl: Deel je 'ontmoet me'-url
sv: Dela din Meet Me-url

source: Claim your Meet Me url
fi: Varaa Meet Me -osoitteesi
fr: Revendiquez votre URL « Me rencontrer »
nl: Vraag je 'ontmoet me'-url op
sv: Reservera din Meet Me webbadress

source: Meet me configuration
fi: Meet Me -asetukset
fr: Configuration de « me rencontrer »
nl: 'Ontmoet me'-configuratie
sv: Konfiguration av Meet Me

source: Check your email to log in
fi: Tarkista sähköpostisi kirjautuaksesi sisään
fr: Vérifiez vos e-mails pour vous connecter
nl: Check je e-mail om in te loggen
sv: Kolla din e-post för att logga in

source: %1$s has accepted your request
fi: %1$s on hyväksynyt pyyntösi
fr: %1$s a accepté votre demande
nl: %1$s heeft uw verzoek geaccepteerd
sv: %1$s har accepterat din begäran.

source: Meeting request has been sent
fi: Tapaamispyyntö on lähetetty
fr: La demande de réunion a été envoyée
nl: Verzoeken voor een meeting zijn verzonden
sv: Förfrågan om mötet har skickats

source: Connecting accounts
fi: Yhdistetään käyttäjätilit
fr: Connexion des comptes
nl: Accounts aan het koppelen
sv: Ansluter konton

source: Connecting Google and Meetin.gs accounts
fi: Yhdistetään Google ja Meetin.gs tilit
fr: Connexion des comptes Google et Meetin.gs
nl: Google en Meetin.gs accounts aan het koppelen
sv: Ansluter Google-konto till Meetin.gs kontot.

source: You already have an active meet me url and it was not changed.
fi: Sinulla on jo käytössä oleva Meet Me -sivu. Osoitetta ei muutettu.
fr: Vous possédez déjà une URL « me rencontrer » active et elle n'a pas été modifiée.
nl: Je hebt al een actieve 'ontmoet me'-url en die is niet veranderd.
sv: Du har redan en aktiv Meet Me-url och den har inte ändrats.

source: Provide your details
fi: Syötä tarkemmat tietosi
fr: Fournir vos informations
nl: Geef je details
sv: Fyll i din personliga information

source: Get our apps
fi: Hanki mobiilisovelluksemme
fr: Téléchargez nos applis
nl: Neem onze apps
sv: Skaffa våra appar

source: Buy Meetin.gs PRO
fi: Ryhdy PRO käyttäjäksi
fr: Acheter Meetin.gs PRO
nl: Koop Meetin.gs PRO
sv: Köp Meetin.gs PRO

source: User settings
fi: Käyttäjän asetukset
fr: Paramètres utilisateur
nl: gebruiksersinstellingen
sv: Användarinställningar

source: Please check your email to continue
fi: Tarkista sähköpostisi jatkaaksesi
fr: Veuillez vérifier votre e-mail pour continuer
nl: Check je e-mail om door te gaan
sv: Vi har skickat ett e-postmeddelande till dig med instruktioner om hur du ska fortsätta.

source: Welcome back
fi: Tervetuloa takaisin
fr: Bienvenue
nl: Welkom terug
sv: Välkommen tillbaka

source: Analytics
fi: Analytiikka
fr: Statistiques
nl: analytisch

source: Logout
fi: Kirjaudu ulos
fr: Déconnexion
nl: Uitloggen
sv: Logga ut

source: Check your inbox
fi: Tarkista sähköpostisi
fr: Vérifiez votre boîte de réception
nl: Check je inbox
sv: Kontrollera din inkorg

source: Account forwarded
fi: Tili on uudelleenohjattu
fr: Compte transmis
nl: Account doorgestuurd
sv: Kontot vidarebefordras

source: Timeline
fi: Aikajana
fr: Historique
nl: Tijdlijn
sv: Tidslinje

source: The requested meeting could not be found. It might have been removed.
fi: Hakemaasi kokousta ei löydy. Voi olla, että se on poistettu.
fr: La réunion demandée n'a pas été trouvée. Elle pourrait avoir été annulée.
nl: De gevraagd meeting kon niet worden gevonden. Die is wellicht verwijderd.
sv: Det begärda mötet kunde ej hittas. Det kan ha tagits bort.

source: You are now "Not Attending".
fi: Sinut on merkitty poissolevaksi.
fr: Vous êtes désormais « absent(e) ».
nl: Je bent nu 'niet deelnemend'.
sv: Du har anmält att du ej kommer att delta i mötet.

source: You are now "Attending".
fi: Sinut on merkitty läsnäolevaksi.
fr: Vous êtes désormais « présent(e) ».
nl: Je bent nu 'aan het bijwonen'.
sv: Du står nu angiven som "Deltagare".

source: %1$s invited succesfully
fi: Käyttäjä %1$s kutsuttu onnistuneesti
fr: %1$s invité(e) avec succès
nl: %1$s succesvol uitgenodigd
sv: %1$s har bjudits in

source: You need to log in to access Meetin.gs
fi: Sinun täytyy kirjautua sisään käyttääksesi palvelua
fr: Vous devez vous connecter afin d'accéder à Meetin.gs
nl: Je moet inloggen voor toegang tot Meetin.gs
sv: Du måste logga in för att komma åt Meetin.gs

source: You need to log in to access this meeting
fi: Sinun täytyy kirjautua palveluun päästäksesi tälle kokoussivulle.
fr: Vous devez vous connecter pour accéder à cette réunion
nl: U moet inloggen om toegang deze vergadering te krijgen.
sv: Du måste logga in för att kunna se det här mötet

source: %1$s is now succesfully authorized to log you in!
fi: %1$s on nyt valtuutettu kirjaamaan sinut sisään!
fr: %1$s est à présent autorisé à vous connecter !
nl: %1$s is nu succesvol geautoriseerd om u in te loggen!
sv: %1$s har nu fått behörighet att logga in dig!

source: You already have an active meet me url. Please change the url again to verify the change
fi: Sinulla on jo käytössä oleva Meet Me -sivu. Muuta osoite uudestaan vahvistaaksesi muutoksen.
fr: Vous possédez déjà une URL « me rencontrer » active. Veuillez modifier l'URL à nouveau afin de vérifier la modification
nl: Je hebt al een actieve 'ontmoet me'-url. Verander de url opnieuw om de verandering te verifiëren
sv: Du har redan en aktiv Meet Me-url. Var snäll och ändra url:en igen för att bekräfta ändringen.

source: Automatic emails disabled for this meeting
fi: Tähän kokoukseen liittyvät automaattiset viestit ovat pois käytöstä
fr: Les e-mails automatiques sont désactivés pour cette réunion
nl: Automatische e-mails zijn voor deze meeting uitgeschakeld
sv: Automatiska e-postutskick har inaktiverats för detta möte

source: Someone else just reserved this time before you. Please refresh the page to see the current situation in this scheduler.
fi: Joku toinen ehti varata ajan juuri ennen sinua. Päivitä sivu nähdäksesi ajankohtainen tapahtumakalenteri.
fr: Quelqu'un vient de réserver cette date avant vous. Veuillez rafraîchir la page pour voir la situation actuelle dans ce planificateur.
nl: Iemand anders heeft deze tijd vóór je gereserveerd. Ververs de pagina om de huidige situatie in deze planner te zien.
sv: Någon har reserverat den här tiden före dig. Du kan se det aktuella läget för den här tidsplaneringen genom att ladda om sidan.

source: Meetin.gs subscription
fi: Meetin.gs tilaus
fr: Abonnement à Meetin.gs
nl: Meetin.gs abonnement
sv: Meetin.gs-abonnemang

source: Meetin.gs monthly subscription
fi: Meetin.gs kuukausitilaus
fr: Abonnement mensuel à Meetin.gs
nl: Meetin.gs maandelijks abonnement
sv: Meetin.gs månatligt abonnemang

source: Meetin.gs yearly subscription
fi: Meetin.gs vuositilaus
fr: Abonnement annuel à Meetin.gs
nl: Meetin.gs jaarlijks abonnement
sv: Meetin.gs årligt abonnemang

source: Deleted Account
fi: Poista tili
fr: Compte Supprimé
nl: Verwijderde account
sv: Tog bort konto

source: Cancel meeting:
fi: Peruuta tapaaminen:
sv: Avboka möte:

source: Cancel meeting?
fi: Peruuta tapaaminen?
sv: Avboka möte?

source: [CANCELLED]
fi: [PERUTTU]
sv: [AVBOKAT]

source: On %1$s//context:meeting date
fi: %1$s
fr: %1$s
nl: %1$s
sv: %1$s

source: In order to stay always connected we recommend to download the free mobile app and receive meeting details and updates straight to your mobile phone:
fr: Afin de rester toujours connecté, nous vous recommandons de télécharger l'application mobile gratuite pour recevoir des détails des réunions et les mises à jour directement sur votre téléphone mobile:
nl: Voor een permanente verbinding raden we aan om de gratis mobiele app te downloaden. Zo verkrijgt u ook alle details en updates rechtstreeks op uw mobiele telefoon:

source: Welcome to cMeet
fr: Bienvenue sur cMeet
nl: cMeet heet u welkom

source: Your cMeet account was activated and you can start organizing meetings with the full suite.
fr: Votre compte cMeet a été activé et vous pouvez commencer à organiser vos réunions comme bon vous semble.
nl: Uw cMeet account werd geactiveerd. U kunt meteen aan de slag met het het organiseren van bijeenkomsten.

source: With the link below, you can log in to cMeet. Keep in mind, that this link is personal. You can use it whenever you need to login.
fr: Vous pouvez accéder à cMeet via le lien ci-dessous. Attention, il s'agit bien de votre login personnel. Vous pouvez l'utiliser à tout moment.
nl: Met onderstaande link meldt u zich aan bij cMeet. Let op, dit is vanaf nu uw persoonlijke link. U kan hiermee op ieder moment inloggen.

source: By setting up your password through the cMeet application (Settings / Login methods / Set up a password) you can easily login with your e-mail address and the password you defined.
fr: En introduisant votre mot de passe dans l'application cMeet (Settings / Login methods / Set up a password) vous pouvez facilement vous connecter avec votre adresse email et le mot de passe que vous avez défini.
nl: Stelt u uw wachtwoord in via de cMeet-applicatie (Settings / Login methods / Set up a password), dan kan u zich gemakkelijk aanmelden met uw e-mailadres en zojuist opgegeven wachtwoord.

source: You can consult our FAQ, installation guide, user manual and terms & conditions by clicking %(L$here%).
fr: Vous pouvez consulter nos FAQ, guide d'installation, manuel d'utilisation et conditions générales en cliquant %(L$ici%).
nl: U kunt steeds onze FAQ, installatiegids, gebruikershandleiding en de algemene voorwaarden raadplegen door %(L$hier%) te klikken.

source: Please contact your business support agent or call 1940 or visit our website %(L$BASEbusiness.be/cmeet%) may you have any questions.
fr: Veuillez appeler votre agent habituel ou le 1940 ou consulter notre site Internet %(L$BASEbusiness.be/cmeet%) pour toute question.
nl: Gelieve contact op te nemen met uw business support agent of bel 1940 of bezoek onze website %(L$BASEbusiness.be/cmeet%) voor bijkomende vragen.

source: Enjoy our service!
fr: Nous espérons que vous apprécierez nos services!
nl: Veel plezier met onze cloudservice!

source: %1$s - The smartest way to meet
fr: %1$s - La façon la plus futée de se réunir
nl: %1$s - De slimste manier om elkaar te ontmoeten
sv: %1$s - Det smarta sättet att mötas

source: %1$s PIN: %2$s
fr: Code %1$s : %2$s

source: Meetin.gs - The smartest way to meet
fr: Meetin.gs - La façon la plus futée de se réunir
nl: Meetin.gs - De slimste manier om elkaar te ontmoeten
sv: Meetin.gs - Det smarta sättet att mötas

source: Meetin.gs is the smartest way to meet - online or face to face.
fr: Meetin.gs est la façon la plus intelligente de se réunir - en ligne ou en face à face.
nl: Meetin.gs is de slimste manier om te vergaderen, online of oog in oog.
sv: Meetin.gs är det smartaste sättet att träffas - online eller i verkligheten

source: Agenda
fr: Programme
sv: Dagordning

source: cMeet / Notification
nl: cMeet / Notificatie
