Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_back-*.po
Languages: fi, fr, nl, sv

source: Problem processing your email
fi: Sähköpostisi käsittelyssä ilmeni ongelma
fr: Problème lors du traitement de votre e-mail
nl: Probleem met het verwerken van uw email.
sv: Problem med att behandla din e-post

source: Problem with your email
fi: Ongelma sähköpostissasi
fr: Il y a un problème avec votre e-mail
nl: Problemen met je e-mail
sv: Problem med din mejl

source: Meetin.gs did not know what to do with your email - it appeared to be empty.
fi: Sähköpostisi näyttäisi olevan tyhjä eikä palvelu pystynyt käsittelemään sitä.
fr: Meetin.gs n'a pas pu traiter votre e-mail - il paraissait vide.
nl: Meetin.gs weet niet wat het moet doen met je e-mail - het lijkt erop dat deze leeg is.
sv: Meetin.gs visste inte vad som skulle göras med ditt mejl - det verkade vara tomt.

source: Maybe you want to try again?
fi: Tarkista lähettämäsi viesti ja kokeile uudestaan.
fr: Vous souhaitez peut-être renouveler l'opération ?
nl: Misschien wil je het opnieuw proberen?
sv: Du vill kanske försöka igen?

source: Something went wrong
fi: Jokin meni pieleen
fr: Une erreur s'est produite
nl: Er is iets misgegaan
sv: Något blev fel

source: Oh noes!
fi: Voi ei!
fr: Oh, des nons !
nl: Oh nee!
sv: Åh nej!

source: Something went wrong with your response to scheduling option for %(B$%1$s%). Please try again.
fi: Jotain meni pieleen vastaanottaessamme vastauksiasi kokouksen %(B$%1$s%) aikatauluehdotuksiin. Ole hyvä ja yritä uudelleen.
fr: Une erreur s'est produite lors de votre réponse à l'option de planification pour %(B$%1$s%). Veuillez renouveler l'opération.
nl: Er is iets mis gegaan met je reactie op de planningsoptie voor %(B$%1$s%). Probeer het opnieuw.
sv: Något gick fel med ditt svar till schemaläggningsalternativ för %(B$%1$s). Försök igen.

source: Does the following time suit you?
fi: Sopivatko seuraavat ajat sinulle?
fr: L'horaire suivant vous convient-il ?
nl: Komt de volgende tijd je goed uit?
sv: Passar följande tid dig?

source: To answer, simply reply YES or NO to this email.
fi: Voit vastata lähettämällä paluuviestin, joka sisältää joko sanan YES tai NO.
fr: Pour répondre, dites simplement OUI ou NON dans cet email.
nl: Om te beantwoorden, antwoord eenvoudig JA of NEE op deze email.
sv: Besvara detta epostmeddelande med JA eller NEJ för att svara.

source: Your previous answer: %1$s .
fi: Edellinen vastauksesi: %1$s .
fr: Votre réponse précédente est : %1$s
nl: Je vorige antwoord: %1$s .
sv: Ditt tidigare svar: %1$s.

source: View meeting
fi: Kokoussivulle
fr: Voir la réunion
nl: Toon meeting
sv: Se möte

source: Problem with your scheduling response
fi: Vastauksessasi aikatauluehdotuksiin ilmeni ongelma
fr: Problème de réponse de planification
nl: Probleem met je reactie op de planning
sv: Problem med ditt schemaläggningssvar

source: Hi,
fi: Hei,
fr: Bonjour,
nl: Hoi,
sv: Hej,

source: You have successfully registered for the %(B$%1$s%) event, with the following information
fi: Olet rekisteröitynyt onnistuneesti tilaisuuteen %(B$%1$s%)
fr: Vous vous êtes inscrit à l'événement %(B$%1$s%) avec succès avec les informations suivantes
nl: Je hebt je succesvol ingeschreven voor het %(B$%1$s%) event met de volgende informatie
sv: Du har registrerat dig för %(B$%1$s%)-händelsen, med följande information

source: Organization:
fi: Organisaatio:
fr: Organisation :
nl: Organisatie:
sv: Organisation:

source: Description:
fi: Kuvaus:
nl: Beschrijving:
sv: Beskrivning:

source: To edit your information, click on the link below
fi: Paina alla olevaa painiketta muokataksesi tietoja
fr: Pour modifier vos informations, cliquez sur le lien ci-dessous
nl: Klik op onderstaande link om je informatie te bewerken
sv: Om du vill redigera din information, klicka på länken nedan

source: Edit information
fi: Muokkaa tietoja
fr: Modifier les informations
nl: Bewerk informatie
sv: Redigera information

source: %(B$Tip:%) To ensure safe delivery of matchmaking invitations, add %(L$%1$s%) to your email client's address book or trusted addresses.
fi: %(B$Vinkki:%) Lisää sähköpostiosoite %(L$%1$s%) sähköpostiohjelmasi osoitekirjaan tai luotettuihin osoitteisiin varmistaaksesi matchmaking-palvelusta tulevien kutsujen saapumisen.
fr: %(B$Tip:%) Pour assurer la livraison d'invitations de liaison, ajoutez %(L$%1$s%) à l'adresse email de votre client ou aux adresses vérifiées.
nl: %(B$Tip:%) Voeg %(L$%1$s%) toe aan het adresboek of de vertrouwde adressen van uw emailprogramma om veilige aflevering van koppelverzoeken te waarborgen.
sv: %(B$Tips:%) För att säkerställa säker leverans av matchmaking inbjudningar, lägga till %(L$%1$s%) till din e-postklient adressbok eller betrodda adresser.

source: If you need any help or want to change your submission, contact us at %(B$%(L$%1$s%)%)
fi: Mikäli tarvitset apua tai haluat tehdä muutoksia jättämiisi tietoihin, tavoitat meidät ottamalla yhteyttä osoitteeseen %(B$%(L$%1$s%)%)
fr: Si vous avez besoin d'aide ou voulez changer votre soumission, contactez-nous à %(B$%(L$%1$s%)%)
nl: Als u hulp nodig heeft of uw inzending wil wijzigen, neem dan contact met ons op via %(B$%(L$%1$s%)%).
sv: Om du behöver någon hjälp eller vill ändra din ansökan, kontakta oss på %(B$%(L$%1$s%)%)

source: You are now registered for the matchmaking event
fi: Olet nyt rekisteröitynyt tilaisuuden matchmaking-palveluun
fr: Vous êtes désormais inscrit à l'événement de mise en relation
nl: Je hebt je nu ingeschreven voor het match-making event
sv: Du är nu registrerad för matchmakingeventet

source: Hi %1$s,
fi: Hei %1$s,
fr: Bonjour %1$s,
nl: Hoi %1$s,
sv: Hej %1$s,

source: It seems that the connection between Meetin.gs and your Google account has been broken.
fi: Näyttää siltä kuin yhteys Meetin.gs-palvelun ja Google-tilisi välillä olisi rikkoutunut.
fr: Il semblerait que la connexion entre Meetin.gs et votre compte Google ait été rompue.
nl: Het lijkt erop dat de verbinding tussen Meetin.gs en je Google account is verbroken.
sv: Det verkar som att anslutningen mellan Meetin.gs och ditt Google-konto har brutits.

source: Reconnect Google account
fi: Uudelleenyhdistä Google-tili
fr: Reconnecter le compte Google
nl: Maak opnieuw verbinding met Google account
sv: Återansluta Google-konto

source: If the problem persists, please contact our %(L$support%).
fi: Jos ongelma ei häviä, ole yhteydessä %(L$tukeen%).
fr: Si le problème persiste, merci de contacter notre %(L$assistance%).
nl: neem contact op met %(L$beheer%) wanneer het probleem blijft bestaan.
sv: Om problemet kvarstår, var snäll och kontakta vår %(L$support%)

source: %(B$Why is this important?%) We are using your data to suggest you upcoming meetings, help you in scheduling and in checking your availability for Meet Me pages.
fi: %(B$Miksi tämä on tärkeää?%) Käytämme kalenteritietojasi luodaksemme ehdotuksia tulevista kokouksistasi aikajanallesi sekä tarkistaaksemme saatavuutesi Meet Me -sivua varten.
fr: %(B$pourquoi est-ce important?%) Nous utilisons vos données afin de vous suggérer des événements à venir, de vous aider à les planifier et de vérifier vos disponibilités sur les pages Meet Me.
nl: %(B$Waarom is dit belangrijk?%) We gebruiken jouw informatie om je aanstaande meetings voor te stellen, je te helpen met plannen en met het checken van je beschikbaarheid voor Ontmoet Mij-pagina's.
sv: %(B$Varför är det här viktigt?%) Vi använder din data för att rekommendera kommande möten, hjälpa dig schemalägga och kollar om du är ledig för Träffa Mig-sidor.

source: We are having problems connecting to your Google account
fi: Emme saa jostain syystä yhteyttä Google-tiliisi
fr: Nous ne parvenons pas à nous connecter sur votre compe Google
nl: Er zijn problemen bij het verbinden met je Google account
sv: Vi har problem med att ansluta till ditt Google-konto

source: Inviter
fi: Kutsuja
nl: De persoon die uitnodigt
sv: Inbjudare

source: %1$s attached the following message:
fi: Käyttäjä %1$s liitti mukaan oheisen viestin:
fr: %1$s a joint le message suivant :
nl: %1$s heeft het volgende bericht bijgevoegd:
sv: %1$s bifogade följande meddelande:

source: Check the meeting details, agenda and materials:
fi: Tutustu tapaamisen agendaan ja materiaaleihin:
fr: Vérifiez les informations liées à cette réunion, l'ordre du jour et les documents :
nl: Controleer details, agenda en materiaal voor de meeting:
sv: Kolla mötets detaljer, agenda och material:

source: This is an automated iCal message from Meetin.gs. If you do not wish to receive iCal messages from Meetin.gs in the future, please follow the link below:
fi: Tämä on automaattinen iCal viesti Meetin.gs-palvelusta. Paina alla olevaa linkkiä, mikäli et halua vastaanottaa tällaisia iCal viestejä palvelusta tulevaisuudessa:
fr: Ceci est un message iCal automatique provenant de Meetin.gs. Si vous ne souhaitez plus recevoir de message iCal émanant de Meetin.gs, veuillez cliquer sur le lien ci-dessous :
nl: Dit is een automatisch iCal bericht van Meetin.gs. Wil je geen iCal berichten van Meetin.gs meer ontvangen, volg dan de onderstaande link:
sv: Detta är ett automatiserad iCal-meddelande från Meetin.gs. Om du inte vill ta emot iCal-meddelanden från Meetin.gs i framtiden, vänligen följ länken nedan:

source: Reminder:
fi: Muistutus:
fr: Rappel :
nl: Herinnering:
sv: Påminnelse:

source: Updated:
fi: Muutettu:
fr: Mis à jour :
nl: Bijgewerkt:
sv: Uppdaterad:

source: Updated Invitation:
fi: Päivitetty kutsu:
fr: Invitation mise à jour :
nl: Bijgewerkte uitnodiging:
sv: Uppdaterad inbjudan:

source: Invitation:
fi: Kutsu:
nl: Uitnodiging:
sv: Inbjudan:

source: Email your material and notes to:
fi: Lähetä materiaalit ja muistiinpanot sähköpostitse osoitteeseen:
fr: Envoyez vos documents et vos notes par e-mail à :
nl: E-mail je materiaal en notities naar:
sv: Mejla ditt material och dina anteckningar till:

source: Be smart and organize your next meeting with Meetin.gs:
fi: Ole järkevä ja järjestä seuraava tapaamisesi käyttäen Meetin.gs-palvelua.
fr: Soyez malin et organisez votre prochaine réunion avec Meetin.gs :
nl: Wees slim en organiseer je volgende meeting met Meetin.gs:
sv: Var smart och organisera ditt nästa möte med Meetin.gs:

source: Request to join
fi: Pyyntö osallistua kokoukseen
fr: Demande de participation
nl: Verzoek om deel te nemen
sv: Begär att få vara med

source: We got your email. Now sit back and relax. You will receive meeting invitation when the organizer approves your request.
fi: Saimme sähköpostisi. Saat kutsun jaetulle kokoussivulle järjestäjän hyväksyessä pyyntösi.
fr: Nous avons votre e-mail. Vous pouvez vous installer confortablement et vous détendre. Vous recevrez une invitation à la réunion lorsque l'organisateur aura approuvé votre demande.
nl: We hebben je e-mail ontvangen. Je kunt nu achterover leunen en ontspannen. Wanneer je organisator je verzoek goedkeurt zul je een uitnodiging voor de meeting ontvangen.
sv: Vi fick mejlet. Nu kan du ta det lugnt. Du får inbjudan när organisatören godkänner din begäran.

source: Your request to join received
fi: Liittymispyyntösi on vastaanotettu.
fr: Votre demande de participation a été reçue
nl: Je aanvraag om
sv: Din begäran har tagits emot

source: %1$s wants to join your meeting. Click the link to accept and we'll send the invitation.
fi: Käyttäjä %1$s haluaa liittyä kokoukseesi. Hyväksy oheisesta linkistä niin me toimitamme hänelle kutsun.
fr: %1$s souhaite participer à votre réunion. Cliquez sur le lien pour donner votre accord et nous lui enverrons une invitation.
nl: %1$s wil deelnemen aan je meeting. Klik op de link om te accepteren, en dan zullen wij de uitnodiging sturen.
sv: %1$s vill vara med på mötet. Klicka på länken för att acceptera så skickar vi inbjudan.

source: In case you don't want to accept the request, don't do anything.
fi: Voit jättää reagoimatta viestiin, mikäli et halua hyväksyä pyyntöä.
fr: Si vous ne souhaitez pas accepter cette requête, ne faites rien.
nl: Doe niets wanneer je de uitnodiging niet aan wilt nemen.
sv: Om du inte vill acceptera begäran gör du ingenting.

source: %1$s wants to join %2$s
fi: Käyttäjä %1$s haluaa liittyä kokoukseen %2$s
fr: %1$s souhaite participer à %2$s
nl: %1$s wil deelnemen aan %2$s
sv: %1$s vill vara med på %2$s

source: Hi %1$s
fi: Hei %1$s
fr: Bonjour %1$s:
nl: Hoi %1$s
sv: Hej %1$s

source: Welcome to %1$s. We are really happy to have you. If you need any help getting started, please don't hesitate to contact us.
fi: Tervetuloa %1$s-palveluun. Älä epäröi ottaa meihin yhteyttä, mikäli tarvitset apua palvelun käyttössä.
fr: Bienvenue sur %1$s. Nous sommes vraiment heureux de votre présence. Si vous avez besoin d'aide pour débuter, n'hésitez pas à nous contacter.
nl: Welkom bij %1$s. We zijn erg blij dat je er bent. Als je hulp nodig hebt bij het opzetten van je account, aarzel dan niet om contact met ons op te nemen.
sv: Välkommen till %1$s. Vi är glada att du är här. Om du behöver hjälp med att komma igång är det bara att kontakta oss.

source: Your %1$s PIN is %(B$%2$s%)
fi: %1$s PIN koodisi on %(B$%2$s%)
fr: Votre CODE %1$s est %(B$%2$s%)
nl: Je %1$s PIN is %(B$%2$s%)
sv: Ditt %1$s PIN är %(B$%2$s%)

source: To login, please enter the code to the corresponding field on your mobile device.
fi: Syötä tämä koodi mobiililaitteesi vastaavaan kenttään kirjautuaksesi sisään.
fr: Pour vous connecter, merci de taper le code dans le champ correspondant sur votre appareil mobile.
nl: Voer de code in in het corresponderende veld op je mobiele apparaat om in te loggen.
sv: För att logga in skriver du koden till det motsvarande fältet i din mobil.

source: If the PIN has expired, simply request a new PIN from the app.
fi: Pyydä uusi PIN-koodi mobiilisovelluksen kautta, mikäli tämä on vanhentunut. Mikäli koodi on vanhentunut, voit pyytää uuden mobiilisovelluksen kautta.
fr: Si votre code n'est plus valide, il suffit de demander un nouveau CODE sur l'appli.
nl: Vraag simpelweg een nieuwe PIN aan via de app wanneer de PIN is verlopen.
sv: Om PIN-koden har gått ut begär du bara en ny PIN från appen.

source: Here's your login link to %1$s.
fi: Tässä kirjautumislinkkisi %1$s-palveluun.
fr: Voici votre lien de connexion vers %1$s.
nl: Hier is je inloglink voor %1$s.
sv: Här är din loginlänk till %1$s.

source: Here are your credentials for logging in at a later time:
fi: Tässä vielä tunnuksesi myöhempää sisäänkirjautumista varten:

source: Account: %1$s
fi: Tunnus: %1$s

source: Password: %1$s
fi: Salasana: %1$s

source: Log in to %1$s
fi: Kirjaudu sisään %1$s-palveluun
fr: Connexion à %1$s
nl: Inloggen op %1$s
sv: Logga in på %1$s

source: %(B$%1$s%) from %(B$%2$s%) accepted your request to meet
fi: %(B$%1$s%) yrityksestä %(B$%2$s%) hyväksyi tapaamispyyntösi
fr: %(B$%1$s%) de %(B$%2$s%) a accepté votre demande de rencontre
nl: %(B$%1$s%) van %(B$%2$s%) heeft uw vergaderverzoek geaccepteerd
sv: %(B$%1$s%) från %(B$%2$s%) accepterade din begäran att mötas

source: %(B$%1$s%) accepted your request to meet
fi: %(B$%1$s%) hyväksyi tapaamispyyntösi
fr: %(B$%1$s%) a accepté votre demande de rencontre
nl: %(B$%1$s%) heeft uw vergaderverzoek geaccepteerd
sv: %(B$%1$s%) accepterade din begäran att mötas

source: Where:
fi: Missä:
fr: Où :
nl: Waar:
sv: Var

source: When:
fi: Milloin:
fr: Quand :
nl: Wanneer:
sv: När:

source: Who:
fi: Osallistujat:
fr: Qui :
nl: Wie:
sv: Vilka:

source: Add to calendar:
fi: Lisää kalenteriin:
fr: Ajouter au calendrier :
nl: Voeg toe aan kalender:
sv: Lägg till kalender:

source: Add to your calendar by navigating to the address below:
fi: Lisää kalenteriisi siirtymällä oheiseen osoitteeseen:
fr: Ajoutez à votre calendrier en naviguant sur l'adresse ci-dessous :
nl: Voeg toe aan je kalender door naar het adres hieronder te navigeren:
sv: Lägg till i kalendern genom att navigera till följande adress:

source: The meeting page is now being prepared by %(B$%1$s%).
fi: %(B$%1$s%) on valmistelemassa kokoussivuanne.
fr: La page de réunion est en cours de préparation par %(B$%1$s%).
nl: De vergaderpagina wordt nu voorbereid door %(B$%1$s%).
sv: Mötessidan förbereds nu av %(B$%1$s%).

source: When the preparation is complete, the other party will send you a link to access the shared meeting page.
fi: Toinen osapuoli lähettää sinulle kutsulinkin jaetulle kokoussivulle kun tarpeelliset valmistelut on tehty.
fr: Quand la préparation sera terminée, l'autre partie vous enverra un lien pour accéder à la page de réunion partagée.
nl: Wanneer de voorbereiding is afgerond zal de andere partij u een link sturen om toegang te krijgen tot de gedeelde vergaderpagina.
sv: När förberedelsen är klar, skickar den andra parten en länk för att komma åt sidan för det delade mötet.

source: Also, you still have %(B$%1$s slots available%) to request a meeting at %2$s. Go back to matchmaking to schedule another meeting.
fi: Sinulla on edelleen %(B$%1$s kpl käytettävissä olevia aikoja%) tapaamisten ehdottamiseen tilaisuudessa %2$s. Palaa matchmaking-palveluun sopiaksesi lisää tapaamisia.
fr: Vous avez encore %(B$%1$s emplacements disponibles%) pour demander une réunion à %2$s. Retournez à la liaison pour programmer une autre réunion.
nl: Daarnaast heeft u %(B$%1$s tijdsdelen beschikbaar%) om een vergadering aan te vragen bij %2$s. Ga terug naar koppelen om een andere vergadering te plannen.
sv: Dessutom har du fortfarande %(B$%1$s platser tillgängliga%) att begära ett möte på %2$s. Gå tillbaka till matchmaking för att schemalägga ett möte.

source: Go to matchmaking
fi: Siirry matchmaking-palveluun
fr: Aller à liaison
nl: Ga naar koppelen.
sv: Gå till matchmaking

source: Go back to %1$s to schedule another meeting.
fi: Palaa takaisin %1$s matchmaking-palveluun sopiaksesi toisen tapaamisen.
fr: Revenez à %1$s pour programmer une autre réunion.
nl: Ga terug naar %1$s om een andere vergadering te plannen.
sv: Gå tillbaka till %1$s för att schemalägga ett till möte.

source: It seems you have used all your slots for the matchmaking. No worries, you can use your account to organize as many meetings as you like at Meetin.gs.
fi: Näyttäisi siltä, että olet käyttänyt kaikki sinulle osoitetut matchmaking ajat. Älä kuitenkaan huoli. Voit käyttää Meetin.gs-tiliäsi järjestääksesi rajattoman määrän henkilökohtaisia tapaamisia.
fr: Il semble que vous avez utilisé tous vos emplacements pour la liaison. Ne vous inquiétez pas, vous pouvez utiliser votre compte pour organiser autant de réunions que vous souhaitez sur Meetin.gs.
nl: Het lijkt erop dat u al uw tijdsdelen heeft gebruikt om te koppelen. Geen zorgen, u kan uw account gebruiken om zoveel vergaderingen bij Meetin.gs te organiseren als u wil.
sv: Det verkar som du har använt alla din slots för matchmaking. Inga problem, du kan använda ditt konto för att organisera så många möten som du vill på Meetin.gs.

source: %1$s is now preparing the online meeting page, that you can use to collaborate, share and discuss all the meeting related materials and agenda.
fi: %1$s on valmistelemassa kokoussivuanne, jolla voitte keskustella, valmistautua ja jakaa kokoukseen liittyviä materiaaleja ennakkoon.
fr: %1$s prépare à présent la page de réunion en ligne que vous pouvez utiliser pour participer, partager et discuter des données et programmes liés aux réunions.
nl: %1$s bereidt nu de online vergaderpagina voor, die u kan gebruiken om samen te werken, en om alle aan de vergadering gerelateerde materialen en de agenda te delen en te bespreken.
sv: %1$s förbereder sidan onlinemöte, som du kan använda för att samarbeta, dela och diskutera mötesrelaterat material och agenda.

source: When this is done, you will be notified and invited to join the meeting page.
fi: Kun kokoussivu on valmisteltu saat ilmoituksen, joka sisältää kutsulinkin sivulle.
fr: Cela fait, vous recevrez une notification et serez invité à joindre la page de réunion.
nl: Wanneer dit gereed is, zal u worden genotificeerd en uitgenodigd om naar de vergaderpagina te gaan.
sv: När detta är gjort, kommer du att meddelas och inbjudas till mötessidan.

source: Didn't get your own Meet Me page yet? Why don't you do it right now?
fi: Eikö sinulla ole vielä Meet Me -sivua? Hanki omasi heti!
fr: Vous n'avez pas encore votre propre page Rencontrez-Moi ? Pourquoi ne pas l'obtenir immédiatement ?
nl: Heeft u nog geen introductiepagina? Waarom zou u het nu niet doen?
sv: Fick du inte din egen Möt mig-sida? Varför inte skapa den nu?

source: Claim your own Meet Me page
fi: Varaa oma Meet Me -sivusi
fr: Demandez votre propre page Rencontrez-moi
nl: Vraag uw eigen introductiepagina aan.
sv: Få din egen Möt mig-sida

source: %1$s from %2$s accepted your request to meet
fi: %1$s yrityksestä %2$s hyväksyi kokouspyyntösi
fr: %1$s de %2$s a accepté votre demande de réunion
nl: %1$s van %2$s heeft uw vergaderverzoek geaccepteerd.
sv: %1$s från %2$s accepterade din begäran att mötas

source: %1$s accepted your request to meet
fi: %1$s hyväksyi kokouspyyntösi
fr: %1$s a accepté votre demande de réunion
nl: %1$s heeft uw vergaderverzoek geaccepteerd.
sv: %1$s accepterade din begäran att mötas

source: Thank you for signing up!
fi: Kiitos rekisteröitymisestä!
fr: Merci pour votre inscription !
nl: Bedankt voor uw inschrijving!
sv: Tack för att du registrerade dig!

source: Your Meet Me page for %(B$%1$s%) has been created. Your availability will now be listed on the attendee list. You can share your Meet Me page with anyone by sending them the following link:
fi: Meet Me -sivusi tilaisuuteen %(B$%1$s%) on luotu ja tapaamiskalenterisi on listattu tilaisuuden verkostoitumistapahtumaan osallistuville. Voit jakaa Meet Me -sivusi kenelle tahansa lähettämällä heille seuraavan linkin:
fr: Votre page Meet Me pour %(B$%1$s%) a été créée. Vos disponibilités vont maintenant apparaître sur la liste des participants. Vous pouvez partager votre page Meet Me avec qui vous le souhaitez en leur envoyant le lien suivant :
nl: Jouw Ontmoet Mij-pagina voor %(B$%1$s%) is aangemaakt. Je beschikbaarheid wordt nu getoond op de deelnemerslijst. Je kunt jouw Ontmoet Mij-pagina delen met iedereen door hen onderstaande link te sturen:
sv: Din Möt Mig-sida för %(B$%1$s%) har skapats. Din anträffbarhet listas nu på deltagarlistan. Du kan dela din Möt Mig-sida med vem som helst genom att skicka dem följande länk:

source: Use this link to access your settings:
fi: Pääset muuttamaan asetuksiasi tästä:
fr: Cliquez sur ce lien pour accéder à vos réglages :
nl: Gebruik deze link om toegang te krijgen tot je instellingen:
sv: Använd den här länken för att komma åt dina inställningar:

source: Meet Me page settings
fi: Meet Me -sivun asetukset
fr: Réglages de la page Meet Me
nl: Ontmoet Mij-pagina instellingen
sv: Möt mig sidoinställningar

source: You will soon receive meeting requests through email. Make sure you add info@meetin.gs to your address book and/or %(L$whitelist%) to ensure safe delivery of email.
fi: Alat saamaan pian kokouspyyntöjä sähköpostitse palvelustamme. Varmista kutsujen saapuminen perille lisäämällä info@meetin.gs osoite sähköpostiohjelmasi osoitekirjaan tai %(L$whitelistille%).
fr: Vous allez bientôt recevoir des notifications de réunion par e-mail. N'oubliez pas de rajouter info@meetin.gs à votre carnet d'adresses et / ou %(L$whitelist%) afin que les e-mails vous parviennent en toute sécurité.
nl: Je zult binnenkort meetingverzoeken ontvangen via e-mail. Zorg ervoor dat je info@meetin.gs aan je adresboek en/of %(L$veilige lijst%) toevoegt zodat je zeker weet dat e-mails goed bezorgt worden.
sv: Du kommer snart få mötesförfrågningar via e-post. Se till att du lägger till info@meetin.gs till din adressbok och/eller %(L$vitlista%) för säker leverans av e-post.

source: Continue setting up the service for personal use
fi: Ota palvelu jokapäiväiseen käyttöösi.
fr: Poursuivez la configuration du service pour un usage personnel
nl: Ga door met het opzetten van de service voor persoonlijk gebruik
sv: Fortsätta installera tjänsten för personlig användning
