Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_front-*.po
Languages: fi, fr, nl, sv

source: The meeting location can not be changed.
fi: Tapaamisen sijaintia ei voi muuttaa.
sv: Mötesplats kan inte ändras.

source: Do you want to schedule an another meeting right away?
fi: Haluatko varata uuden tapaamisen heti?
sv: Vill du schemalägga en annan möte direkt?

source: Schedule Another Meeting
fi: Varaa uusi tapaaminen
sv: Schemalägg annan möte

source: Agenda
fr: Programme
sv: Dagordning
