Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_back-*.po
Languages: fi, fr, nl, sv

source: %1$s: Mobile site to access your meetings
fi: %1$s: Mobiilisivu helpottamaan kokoustesi seurantaa
fr: %1$s : un site mobile pour accéder à vos réunions
nl: %1$s: Mobiele website waarmee je toegang hebt tot je meetings
sv: %1$s: Mobil-sida där du kan se dina möten

source: You just created
fi: Loit juuri tapaamisen
fr: Vous venez de créer
nl: Je hebt net gemaakt
sv: Du har nu skapat

source: Welcome to Meetin.gs!
fi: Tervetuloa Meetin.gs-palveluun!
fr: Bienvenue à Meetin.gs !
nl: Welkom bij Meetin.gs!
sv: Välkommen till Meetin.gs!

source: Your awesome meeting page is now up and running. We also created a Meetin.gs account for you.
fi: Tapaamisellesi on nyt luotu kokoussivu. Samalla sinulle luotiin myös Meetin.gs-tili.
fr: Votre super page réunion est désormais opérationnelle. Nous avons également créé un compte Meetin.gs pour vous.
nl: Je geweldige meeting-pagina is nu in volle gang. We hebben ook een Meetin.gs account voor je aangemaakt.
sv: Webbsidan för ditt möte är nu tillgänglig. Vi har även skapat ett Meetin.gs konto åt dig.

source: Your awesome meeting page is now up and running.
fi: Tapaamisellesi on nyt luotu kokoussivu.
fr: Votre super page réunion est désormais opérationnelle.
nl: Je geweldige meeting-pagina is nu in volle gang.
sv: Hemsidan för ditt möte är nu igång.

source: %(B$Ttip:%) You can add material by emailing attachments to %(L$%1$s%). The documents will automatically appear on the meeting page.
fi: %(B$Vinkki:%) Voit lisätä materiaaleja lähettämällä ne liitetiedostoina osoitteeseen %(L$%1$s%).
fr: %(B$Ttip:%) Vous pouvez ajouter des données par email à %(L$%1$s%). Les documents apparaîtront automatiquement sur la page de réunion.
nl: %(B$Ttip:%) U kan materiaal toevoegen door bijlagen te emailen naar %(L$%1$s%). De documenten zullen automatisch verschijnen op de vergaderpagina.
sv: %(B$Ttip:%) Du kan lägga till material genom att mejla bilagor till %(L$%1$s%). Dokumenten kommer automatiskt läggas upp på mötessidan.

source: Meeting created: %1$s
fi: Kokous luotu: %1$s
fr: Réunion créée : %1$s
nl: Vergadering aangemaakt: %1$s
sv: Mötet har skapats: %1$s

source: Information about
fi: Tietoa kokouksesta
fr: Informations à propos de
nl: Informatie over
sv: Information om

source: Suggested time:
fi: Ehdotettu aika:
fr: Heures proposées :
nl: Voorgestelde tijden
sv: Föreslagna tidpunkter:

source: Please note that your help is needed to find a suitable time for %1$s. To help finding the right time, reply to this message with SCHEDULE.
fi: Huomioi, että apuasi tarvitaan, jotta kokoukselle %1$s voidaan löytää sopiva aika. Auta löytämään aika vastaamalla tähän viestiin sanalla SCHEDULE.
fr: Veuillez noter que vous êtes sollicité pour trouver un horaire qui convienne pour %1$s. Pour aider à trouver l'horaire adéquat, répondez à ce message en indiquant SCHEDULE.
nl: Let erop dat jouw hulp nodig is bij het vinden van een geschikte tijd voor %1$s. Om te helpen met het vinden van een goede tijd, beantwoordt dit bericht met PLANNING.
sv: Vänligen observera att din hjälp behövs för att hitta en lämplig tidpunkt . Om du vill hjälpa till att hitta rätt tidpunkt för %1$s kan du besvara det här meddelandet med SCHEDULE.

source: You will then receive the suggested time by email. Please respond to the email with YES or NO.
fi: Tämän jälkeen saat kokoukselle ehdotetun ajan sähköpostiviestillä. Vastaa kirjoittamalla vastausviestiin YES tai NO.
fr: Vous allez ensuite recevoir %1$s propositions d'horaires par e-mail. Merci de répondre à chacune d'entre elles par OUI ou NON.
nl: Je zult dan %1$s voorgestelde tijden per e-mail ontvangen. Beantwoord ze elk met JA of NEE.
sv: Du kommer sedan att få %1$s förslag till tidpunkt via e-post. Var snäll och svara på vart och ett med JA eller NEJ.

source: You can also respond on the meeting page.
fi: Voit myös vastata helposti suoraan kokoussivulla.
fr: Vous pouvez également répondre sur la page réunion.
nl: Je kunt ook reageren op de meeting-pagina.
sv: Du kan också svara på mötets hemsida.

source: Share materials by emailing them here:
fi: Jaa materiaaleja lähettämällä sähköpostia osoitteeseen:
fr: Partagez vos documents par e-mail ici :
nl: Deel materialen door ze hier naartoe te emailen:
sv: Dela mötesunderlag genom att e-posta dem här:

source: The materials you send as attachments will appear on the meeting page. The message you write in the text field of the same email will appear as a comment to that material. You can also share materials on the meeting page.
fi: Sähköpostin liitetiedostot lisätään kokouksen materiaaleiksi ja viestin sisältämä teksti kyseisen materiaalin yhteyteen kommentiksi. Kokousmateriaaleja voi lisätä myös helposti kokoussivulta.
fr: Les documents que vous avez envoyés en pièces jointes apparaîtront sur la page réunion. Le message tapé dans le champ texte de ce même e-mail apparaîtra comme commentaire de ces documents. Vous pouvez également partager des documents sur la page réunion.
nl: De materialen die u verstuurt als bijlagen zullen op de vergaderpagina komen. De boodschap die u in het tekstveld van dezelfde email schrijft zal als commentaar bij het materiaal komen. U kan ook materialen delen via de vergaderpagina.
sv: Underlag som du skickar som bilaga till ett e-postmeddelande kommer att synas på mötets hemsida. Texten som du skrev i samma e-postmeddelande kommer att synas som kommentar till underlaget. Du kan också göra material tillgängliga genom att ladda upp dem till mötets hemsida.

source: Shared materials:
fi: Jaetut materiaalit:
fr: Articles partagés :
nl: Gedeelde materialen:
sv: Tillgängligt material:

source: %(B$%1$s%) comments have been shared.
fi: %(B$%1$s%) kommenttia on jaettu.
fr: %(B$%1$s%) des commentaires ont été partagés.
nl: %(B$%1$s%) opmerkingen zijn gedeeld.
sv: %(B$%1$s%) kommentarer har publicerats.

source: Info: %1$s
fi: Tietoa kokouksesta: %1$s

source: There are no action points for the meeting.
fi: Kokoukseen liittyviä jatkotoimenpiteitä ei ole kirjattu.
fr: Il n'y a pas de points d'action pour la réunion.
nl: Er zijn geen actiepunten voor de vergadering.
sv: Det finns inga att göra-punkter för detta möte.

source: What was the outcome? Hit reply and provide a summary.
fi: Mikä oli kokouksen lopputulema? Vastaa viestiin vaikka muutamalla lauseella.
fr: Quels ont été les résultats ? Appuyez sur « répondre » pour donner un résumé.
nl: Wat was het resultaat? Klik op antwoorden en geef een korte samenvatting.
sv: Vad blev slutsatsen? Tryck på svara och skriv en kort sammanfattning.

source: What was the outcome of %(B$%1$s?%) Did you make any decisions? What happens next?
fi: Mikä oli kokouksen %(B$%1$s%) lopputulema? Tehtiinkö kokouksessa päätöksiä? Entä mitä tapahtuu seuraavaksi?
fr: Quel a été le résultat de %(B$%1$s?%) Avez-vous pris des décisions ? Que se passe-t-il ensuite ?
nl: Wat was het resultaat van (B$%1$s%)? Heeft u beslissingen genomen? Wat is de volgende stap?
sv: Vad blev slutsatsen av %(B$%1$s?%) Fattade ni några beslut? Vad händer härnäst?

source: %(B$Just reply to this email%) and we'll send a beautiful summary to %(B$%1$s%). If you want to put a bit more effort into it just hit the button below and fill the action points.
fi: %(B$Vastaa tähän viestiin%) niin me lähetämme käyttäjälle %(B$%1$s%) kauniisti jäsennellyn tiivistelmän. Mikäli haluat panostaa tähän hieman enemmän, voit siirtyä kokoussivulle kirjaamaan sovitut jatkotoimenpiteet ylös.
fr: %(B$Répondez à cet email%) et nous enverrons un joli résumé à %(B$%1$s%). Encore un petit effort : appuyez sur le bouton ci-dessous et remplissez les points d'action.
nl: %(B$Beantwoord deze e-mail%) en we sturen een mooie samenvatting naar %(B$%1$s%). Mocht u een beetje meer moeite willen doen, klik dan op de knop hieronder en vul de actiepunten aan.
sv: %(B$Besvara detta epostmeddelande%) så skickar vi en vacker sammanfattning till %(B$%1$s%). Om du vill anstränga dig lite mer, klicka på knappen nedan och fyll i att göra-punkterna.

source: Fill the Action Points
fi: Lisää sovitut toimenpiteet
fr: Remplir les Points Action
nl: Vul actiepunten in
sv: Fyll i Action Points

source: ps. Feel free to ignore this email if no summary is needed.
fi: ps. Mikäli tiivistelmää kirjattuine jatkotoimineen ei tarvita, voit jättää tämän viestin huomiotta.
fr: PS : n'hésitez pas à ignorer cet email si aucun résumé n'est nécessaire.
nl: ps. U kunt deze e-mail negeren als er geen behoefte is aan een samenvatting.
sv: PS: Ignorera detta e-mail om en sammanfattning inte är nödvändig

source: Should someone else do this instead? Delegate to:
fi: Olisiko jonkun muun parempi tehdä tämä? Delegoi henkilölle:
fr: Quelqu'un d'autre doit-il s'en occuper ? Déléguer à :
nl: Zou iemand anders dit moeten doen? Delegeren aan:
sv: Borde någon annan göra detta istället? Delegera till:

source: %1$s: What are the next steps?
fi: %1$s: Mitä tapahtuu seuraavaksi?
fr: %1$s : Quelles sont les prochaines étapes ?
nl: %1$s: Wat zijn de volgende stappen?
sv: %1$s: Vilka är nästa steg?

source: We noticed that this meeting has no agenda.
fi: Huomasimme, että kokoukselle ei ole asetettu agendaa.
fr: Nous avons remarqué que cette réunion n'a pas de programme.
nl: We merken dat deze vergadering geen agenda heeft.
sv: Vi noterar att detta möte inte har någon agenda.

source: Why do you meet? Hit reply and provide a short summary.
fi: Miksi tapaaminen järjestetään? Vastaa viestiin vaikka muutamalla lauseella.
fr: Pourquoi cette réunion ? Appuyez sur répondre et fournissez un bref résumé.
nl: Waarom vergadert u? Klik op antwoorden en geef een korte samenvatting.
sv: Varför har ni möte? Tryck på svara och skriv en kort sammanfattning.

source: Not every meeting requires an agenda, but sharing a couple of points why %(B$%1$s%) takes place can be useful to everyone present.
fi: Kaikki kokoukset eivät tietenkään kaipaa agendaa. Tapaamisen %(B$%1$s%) tarkoituksen avaaminen muutamalla sanalla voisi kuitenkin olla eduksi kaikille.
fr: Toutes les réunions ne nécessitent pas un programme, mais expliquer un peu pourquoi %(B$%1$s%) a lieu peut être utile aux personnes présentes.
nl: Niet elke vergadering vereist een agenda, maar het mededelen van enkele redenen waarom (B$%1$s%) plaatsvindt kan nuttig zijn voor alle aanwezigen.
sv: Alla möten kräver inte en agenda, men att ha några gemensamma punkter runt anledningen till att %(B$%1$s%) sker kan vara användbart för alla deltagare.

source: %(B$Just reply to this email%) and we'll send a beautiful agenda to %(B$%1$s%). If you want to put a bit more effort into it just hit the button below and fill the agenda.
fi: %(B$Vastaa tähän viestiin%) niin me lähetämme käyttäjälle %(B$%1$s%) kauniisti jäsennellyn agendan. Mikäli haluat panostaa tähän hieman enemmän, voit siirtyä kokoussivulle laatimaan varsinaisen agendan.
fr: %(B$Vient de répondre à cet email%) et enverra un joli programme à %(B$%1$s%). Encore un dernier effort : appuyez sur le bouton ci-dessous et remplissez le programme.
nl: %(B$Beantwoord deze e-mail%) en we sturen een mooie agenda naar %(B$%1$s%). Mocht u een beetje meer moeite willen doen, klik dan op de knop hieronder en vul de agenda.
sv: %(B$Besvara detta epostmeddelande%) så skickar vi en vacker agenda till %(B$%1$s%). Om du vill anstränga dig lite mer, tryck på knappen nedan och fyll på agendan.

source: Fill the agenda
fi: Kirjaa agenda
fr: Remplir le programme
nl: Vul de agenda
sv: Fyll agendan

source: %1$s is tomorrow: Why do you meet?
fi: %1$s järjestetään huomenna: Miksi olette tapaamassa?
fr: %1$s a lieu demain : pourquoi cette réunion ?
nl: %1$s is morgen: Waarom vergadert u?
sv: %1$s är imorgon. Varför träffas ni?

source: Activate Meetin.gs PRO now
fi: Aktivoi Meetin.gs PRO
fr: Activer maintenant Meetin.gs PRO
nl: Meetin.gs PRO nu activeren
sv: Aktivera Meetin.gs PRO nu

source: Thank you for trying out Meetin.gs. This is the reminder, that you requested using our iOS application.
fi: Kiitos kun kokeilit Meetin.gs-palvelua. Tämä on iOS sovelluksemme kautta pyytämäsi muistutus.
fr: Merci d'essayer Meetin.gs. Ceci est le rappel que vous avez demandé en utilisant notre application iOS.
nl: Dank u om Meetin.gs te proberen. Dit is de herinnering die u gevraagd heeft door gebruik te maken van onze iOS-toepassing.
sv: Tack för att du provar Meetin.gs. Det här är påminnelsen som du begärde med hjälp av vår iOS-applikation.

source: Upgrade your Meetin.gs account now to get all the benefits:
fi: Siirry käyttämään palvelun kokoversiota saadaksesi käyttöösi seuraavat edut:
fr: Mettez maintenant à jour votre compte Meetin.gs pour profiter de tous les avantages :
nl: Upgrade uw Meetin.gs account nu om alle voordelen te verkrijgen:
sv: Uppgradera ditt Meetin.gs-konto nu för att få alla fördelar:

source: You get to customize the look and feel of the service and notifications according to your brand. Add your logo, select your own background image, and set the highlight color.
fi: Voit muokata palvelun ulkoasua ja ilmoituksia vastaamaan yrityksesi visuaalista ulkoasua. Lisää Logosi, aseta kokouksillesi haluamasi taustakuva ja valitse palvelun korostevärit.
fr: Personnalisez l'apparence et l'atmosphère du service et des notifications selon votre marque. Ajoutez votre logo, sélectionnez vos propres images de fond, et déterminez les couleurs.
nl: U kunt het uitzicht en gevoel van de service en meldingen aanpassen aan uw merk. Voeg uw logo toe, selecteer uw eigen achtergrondafbeelding en stel het steunkleur in.
sv: Du kan anpassa utseendet på tjänsten och aviseringarna i enlighet med ditt märke. Lägg till din logga, välj din egen bakgrundsbild och ställ in färger.

source: You will be able to invite as many people to a single meeting as you wish.
fi: Voit kutsua koolle juuri niin suuria kokouksia kuin haluat.
fr: Vous pourrez inviter autant de personnes que vous le souhaitez à une même réunion.
nl: U zult zoveel personen als u wilt, kunnen uitnodigen voor een enkele ontmoeting.
sv: Du kommer att kunna bjuda in så många människor du vill till ett möte.

source: You get to to share all the materials without limitations.
fi: Jaa kokousmateriaalit ilman tiedostojen kokorajoituksia.
fr: Partagez tous vos documents sans limite.
nl: U kunt alle materialen zonder beperkingen delen.
sv: Du kan dela allt material utan begränsningar.

source: Upgrade to Meetin.gs PRO
fi: Ryhdy PRO käyttäjäksi
fr: Passer à Meetin.gs PRO
nl: Upgrade naar Meetin.gs PRO
sv: Uppgradera till Meetin.gs PRO

source: Reminder: Go PRO and Save time with Meetin.gs
fi: Muistutus: Säästä aikaa ja ryhtymällä Meetin.gs PRO -käyttäjäksi
fr: Rappel : devenez PRO et Économisez du temps avec Meetin.gs
nl: Herinnering: ga PRO en bespaar tijd met Meetin.gs
sv: Påminnelse: Bli PRO och Spara tid med Meetin.gs

source: Missing RSVP for
fi: RSVP puuttuu kokoukselta
fr: Il manque une réponse pour
nl: Ontbrekende bevestiging voor
sv: Svar saknas från

source: It's been three days but %1$s has not told if they are coming to your meeting.
fi: On kulunut kolme päivää, mutta henkilö %1$s ei ole vielä ilmoittanut onko hän osallistumassa kokoukseen.
fr: Cela fait trois jours, mais %1$s n'a pas confirmé sa participation à votre réunion.
nl: Drie dagen zijn verstreken maar %1$s hebben niet gezegd of ze naar uw vergadering komen.
sv: Efter 3 dagar har %1$s inte meddelat om de tänker delta i mötet.

source: Are you sure this is the correct email address?
fi: Oletko varma, että tämä on oikea sähköpostiosoite?
fr: Êtes-vous certain que l'adresse e-mail est correcte ?
nl: Weet u zeker dat dit het juiste emailadres is?
sv: Är du säker på att detta är rätt e-postadress?

source: The invite was sent to %(B$%1$s%) - are you sure this is the correct email address?
fi: Kutsu lähetettiin osoitteeseen %(B$%1$s%). Oletko varma, että sähköpostiosoite on oikein?
fr: L'invitation a été envoyée à %(B$%1$s%) - êtes-vous certain qu'il s'agit de la bonne adresse e-mail ?
nl: De uitnodiging is verstuurd naar %(B$%1$s%). Weet u zeker dat dit het juiste emailadres is?
sv: Inbjudningen skickades till %(B$%1$s%) - är du säker på att denna e-postadress är korrekt?

source: If not, you can resend the invite on the meeting page
fi: Voit lähettää uuden kutsun helposti kokoussivulta, mikäli osoite on väärin
fr: Autrement, il vaut mieux renvoyer l'invitation sur la page réunion
nl: Zo niet, dan kan u de uitnodiging opnieuw verzenden op de vergaderpagina.
sv: I annat fall kan du skicka inbjudningen igen på mötets hemsida.

source: Occasionally the emails also get stuck in spam filters and contacting personally is the best way to reach someone.
fi: Toisinaan sähköpostit voivat myös juuttua roskapostisuodattimeen ja henkilökohtainen yhteydenotto voi tällöin olla paras tapa tavoittaa haluamasi henkilö.
fr: Les e-mails peuvent parfois se retrouver bloqués par un filtre spam aussi, pour joindre quelqu'un, vaut-il mieux le contacter en personne.
nl: Soms komen de emails vast te zitten in spamfilters en persoonlijk contact opnemen is de beste manier om iemand te bereiken.
sv: Mejl kan ibland fastna i spamfilter. Personlig kontakt är det bästa sättet att få tag på en person.

source: %(B$Tip:%) You can also manage the answers yourself through the icons in the participant list.
fi: %(B$Vinkki:%) Voit hallinnoida vastauksia myös itse osallistujalistan yhteydessä olevia ikoneita käyttämällä.
fr: %(B$Conseil:%) Vous pouvez également gérer les réponses vous-même à partir des icônes se trouvant sur la liste des participants.
nl: %(B$Tip:%) u kan de antwoorden ook zelf beheren via de iconen in de deelnemerslijst.
sv: %(B$Tip:%) Du kan också hantera svaren själv med hjälp av ikonerna i listan över deltagare.

source: %1$s's RSVP missing
fi: Käyttäjän %1$s RSVP puuttuu
fr: La réponse de %1$s est introuvable
nl: De bevestiging van %1$s ontbreekt.
sv: %1$s's svar saknas.

source: Missing scheduling response for
fi: Vastaamattomia aikatauluehdotuksia kokouksessa
fr: Il manque la réponse à la planification pour
nl: Ontbrekend antwoord op de planning van
sv: Svar beträffande tidsplanen saknas för

source: It's been three days but %1$shas not responded to scheduling.
fi: On kulunut kolme päivää, mutta henkilö %1$s ei ole vielä ilmoittanut itselleen sopivia tapaamisajankohtia.
fr: Cela fait trois jours, mais %1$s n'a pas répondu à la demande de planification.
nl: Er zijn drie dagen verstreken maar %1$s heeft niet op de planning geantwoord.
sv: Det har gått tre dagar men %1$s har inte svarat på tidsplaneringen.

source: %(B$Tip:%) As the admin you can also manage the participants' answers yourself.
fi: %(B$Vinkki:%) Ylläpitäjänä voit myös itse hallinnoida osallistujien vastauksia.
fr: %(B$Conseil:%) En tant qu'administrateur, vous pouvez également gérer la réponse des participants vous-même.
nl: %(B$Tip:%) als administrator kunt u ook de antwoorden van de deelnemers zelf beheren.
sv: %(B$Tip:%) Som administratör kan du också hantera deltagarnas svar själv.

source: %1$s's scheduling answers missing
fi: Käyttäjän %1$s vastaukset aikaehdotuksiin puuttuu
fr: Les réponses pour la planification de l'événement %1$s sont introuvables
nl: De antwoorden van %1$s op de planning ontbreken.
sv: %1$s's svar beträffade tidpunkten saknas

source: Receipt
fi: Kuitti
fr: Reçu
nl: Ontvangstbewijs
sv: Kvitto

source: This is a receipt for your Meetin.gs PRO subscription payment.
fi: Tämä on kuitti Meetin.gs PRO:n tilauksen maksusta.
fr: Ceci est un reçu pour le paiement de votre abonnement à Meetin.gs PRO.
nl: Dit is een ontvangstbewijs voor de betaling van uw Meetin.gs PRO abonnement.
sv: Det här är ett kvitto på din betalning för tjänsten Meetin.gs PRO.

source: Item:
fi: Tavara:
fr: Article :
sv: Produkt:

source: Amount*:
fi: Määrä*:
fr: Montant* :
nl: Bedrag*:
sv: Belopp*:

source: Account:
fi: Tili:
fr: Compte :
sv: Konto

source: Date:
fi: Päivämäärä:
nl: Datum:
sv: Datum:

source: Biller:
fi: Laskuttaja:
fr: Facturier:
sv: Fakturerare:

source: * 24% VAT included
fi: * 24 % ALV sisältyy hintaan
fr: * 24% TVA incluse
nl: * 24% BTW inbegrepen
sv: * 24% VAT inkluderat

source: * 0% VAT included
fi: * 0 % ALV sisältyy hintaan
fr: * 0 % TVA incluse
nl: * 0% BTW inbegrepen
sv: * 0% VAT inkluderat

source: Meetin.gs receipt
fi: Meetin.gs kuitti
fr: Reçu de Meetin.gs
nl: Meetin.gs ontvangstbewijs
sv: Meetin.gs kvitto

source: %1$s would like you to pick a time for a meeting.
fi: %1$s pyysi sinua valitsemaan ajan tapaamiselle.
fr: %1$s souhaite que vous choisissiez l'heure de la réunion.
nl: %1$s zou graag willen dat u een tijdstip voor een vergadering kiest.
sv: %1$s vill att du väljer tid för ett möte.

source: Message from %1$s:
fi: Viesti henkilöltä %1$s:
fr: Message de %1$s :
nl: Bericht van %1$s:
sv: Meddelande från %1$s:

source: Pick a time
fi: Valitse aika
fr: Choisissez une heure
nl: Kies een tijdstip
sv: Välj tid

source: %1$s asked you to pick a time for a meeting
fi: %1$s pyysi sinua valitsemaan ajan tapaamiselle
fr: %1$s vous demande de choisir l'heure de la réunion
nl: %1$s heeft u gevraagd om een tijdstip voor een vergadering te kiezen
sv: %1$s bad dig välja en tid för mötet

source: RSVP reminder for
fi: Muistutus RSVP:stä kokoukselle
fr: Rappel pour que vous répondiez à
nl: Herinnering bevestiging voor
sv: Påminnelser till

source: %1$s requested you to RSVP for this meeting:
fi: %1$s haluaa tietää osallistutko kokoukseen.
fr: %1$s vous a demandé de répondre pour cette réunion :
nl: %1$s heeft u gevraagd deze vergadering te bevestigen.
sv: %1$s ombeder dig att OSA till detta möte:

source: Please RSVP for this meeting:
fi: Vastaa RSVP:hen
fr: Veuillez répondre pour cette réunion :
nl: Bevestig deze vergadering alstublieft:
sv: Vänligen OSA för detta möte:

source: Attending
fi: Läsnä
fr: Présent(e)
nl: Bijwonen
sv: Kommer

source: Not attending
fi: Poissa
fr: Absent(e)
nl: Niet bijwonen
sv: Kommer inte

source: Reminder: RSVP required for %1$s
fi: Muistutus: RSVP vaaditaan kokoukselle %1$s
fr: Rappel : une réponse est requise pour %1$s
nl: Herinnering: bevestiging benodigd voor %1$s.
sv: Påminnelse: Svar önskas för %1$s

source: Choose the time for
fi: Valitse aika kokoukselle
fr: Choisir l'horaire pour
nl: Kies de tijd voor
sv: Ange tidpunkt för

source: All of the participants have now responded to scheduling options.
fi: Kaikki osallistujat ovat nyt ilmoittaneet iselleen parhaiten sopivat tapaamisajat.
fr: Tous les participants ont répondu aux options de planification.
nl: Alle deelnemers hebben nu op de planning opties gereageerd.
sv: Alla deltagare har nu svarat på den föreslagna tidsplaneringen.

source: The most popular time is:
fi: Suosituin aika on:
fr: Les heures les plus populaires sont :
nl: De populairste tijden zijn:
sv: De mest populära tidpunkterna är:

source: Choose the final time on the meeting page.
fi: Valitse lopullinen tapaamisaika kokoussivulta.
fr: Sélectionnez l'horaire définitif sur la page réunion.
nl: Kies de definitieve tijd op de vergaderpagina.
sv: Ange den slutgiltiga tiden på mötessidan.

source: Set the time for this meeting
fi: Aseta aika kokoukselle
fr: Régler l'horaire de cette réunion
nl: Kies een tijd voor deze vergadering.
sv: Bestäm tid för det här mötet

source: Action required: choose the time for %1$s
fi: Toimintaa odotetaan: Valitse aika kokoukselle %1$s
fr: Action requise : sélectionner l'horaire pour %1$s
nl: Actie vereist: kies de tijd voor %1$s
sv: Åtgärd krävs: ange tidpunkt för %1$s

source: Open scheduling options for
fi: Avaa aikataulutuksen asetukset kokoukselle
fr: Ouvrir les options de planification pour
nl: Open plan opties voor
sv: Öppna tidsplaneringen för

source: Open scheduling option for
fi: Avaa aikataulutuksen asetukset kokoukselle
fr: Ouvrir l'option de planification pour
nl: Open plan optie voor
sv: Öppna tidsplaneringen för
