Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_front-*.po
Languages: fi, fr, nl, sv

source: We have now imported your calendar items. You can change the calendar integration settings anytime at your personal settings.
fi: Olemme hakeneet kalenterimerkinnät palveluumme. Voit halutessasi muokata kalenteri-integraatiota asetukset-valikosta.
fr: Nous avons maintenant importé vos éléments de calendriers. Vous pouvez changer les paramètres d'intégration du calendrier à tout moment dans vos paramètres personnels.
nl: We hebben nu uw kalenderitems geïmporteerd. U kunt de kalenderintegratie instellingen op elk gewenst moment wijzigen in uw persoonlijke instellingen.
sv: Vi har nu importerat dina kalenderhändelser. Du kan ändra inställningarna för kalenderintegrationen när som helst via dina personliga inställningar.

source: Next you should add Meetin.gs to your Google calendar. Do you want to subscribe to the meeting calendar feed now?
fi: Seuraavaksi sinun kannattaa lisätä Meetin.gs Google kalenteriisi. Haluatko lisätä kalenterisyötteen nyt?
fr: Ensuite, vous devriez ajouter Meetin.gs à votre calendrier Google. Voulez-vous vous abonner au fil du calendrier de réunions maintenant ?
nl: Vervolgens dient u Meetn.gs aan uw Google kalender toe te voegen. Wilt u zich nu abonneren op de vergaderkalender feed?
sv: Härnäst borde du lägga till Meetin.gs till din Google-kalender. Vill du prenumerera på feeden från möteskalendern nu?

source: Subscribe
fi: Tilaa
fr: S'abonner
nl: Schrijf in
sv: Prenumerera

source: Not now
fi: Myöhemmin
fr: Pas maintenant
nl: Niet nu
sv: Inte nu

source: We are now importing your calendar items.
fi: Kalenterisi sisältöä noudetaan.
fr: Nous importons actuellement vos éléments de calendriers.
nl: We importeren nu kalenderitems.
sv: Vi importerar nu dina kalenderhändelser.

source: Please wait.
fi: Ole hyvä ja odota.
fr: Veuillez patienter.
nl: Een ogenblik
sv: Vänligen vänta.

source: Organize a new meeting
fi: Järjestä uusi tapaaminen
fr: Organiser une nouvelle réunion
nl: Organiseer een meeting
sv: Organisera ett möte

source: Looking for %(L$Future meetings%)?
fi: Etsitkö %(L$tulevia tapaamisia%)?
fr: En recherche de %(L$futures réunions%) ?
nl: Op zoek naar %(L$toekomstige vergaderingen%)?
sv: Letar efter %(L$Framtida möten%)?

source: Share your Meet Me page
fi: Jaa tapaamissivusi
fr: Partager votre page Rencontrez-moi
nl: Deel uw Meet Me pagina
sv: Dela din Möt mig-sida

source: Connect Google Calendar
fi: Yhdistä Google Kalenteri
fr: Connecter Google Agenda
nl: Verbind met Google kalender
sv: Anslut Google-kalendern

source: Looking for %(L$Past meetings%)?
fi: Etsitkö %(L$menneitä tapaamisia%)?
fr: Vous recherchez des %(L$réunions passées%) ?
nl: Op zoek naar %(L$Verleden vergaderingen%)?
sv: Letar du efter %(L$Tidigare möten%)?

source: Your Meetin.gs PRO subscription is now active. You can continue with the PRO features enabled by clicking continue below.
fi: Meetin.gs PRO -tilisi on nyt aktiivinen. Voit aloittaa maksullisten ominaisuuksien hyödyntämisen painamalla alla olevaa painiketta.
fr: Votre abonnement Meetin.gs PRO est maintenant actif. Vous pouvez continuer avec les fonctionnalités PRO activées en cliquant ci-dessous sur continuer.
nl: Uw Meetin.gs PRO abonnement is nu actief. U kunt verder gaan met geactiveerde PRO functies door hieronder op verdergaan te klikken.
sv: Din Meetin.gs PRO-prenumeration är nu aktiv. Du kan fortsätta med PRO-funktionerna som aktiverats genom att klicka på fortsätt nedan

source: Upgrade Meetin.gs PRO
fi: Ryhdy PRO-käyttäjäksi
fr: Passez à la version supérieure de Meetin.gs PRO
sv: Uppgradera Meetin.gs PRO

source: Buy using credit card
fi: Osta luottokortilla
fr: Acheter en utilisant une carte de crédit
nl: Door een kredietkaart te gebruiken
sv: Köp med kreditkort

source: $ 12 / month
fi: 12 $ / kuukausi
fr: 12$ / mois
nl: 12 $/maand
sv: 12$/månad

source: or
fi: tai
fr: ou
nl: of
sv: eller

source: $ 129 / year
fi: 129 $ / vuosi
fr: 129$ / an
nl: 129 $/jaar
sv: 129$/år

source: Buy from your local vendor
fi: Osta paikalliselta palveluntarjoajaltasi
fr: Achetez chez votre vendeur local.
nl: Koop bij onze lokale leverancier
sv: Köp från din lokala försäljare

source: Other vendors
fi: Muut myyjät
fr: Autres vendeurs
nl: Andere leveranciers
sv: Andra försäljare

source: You are subscribing to Meetin.gs PRO monthly plan.
fi: Olet päivittämässä tilisi kuukausimaksulliseen Meetin.gs PRO pakettiin.
fr: Vous avez souscrit à l'abonnement Meetin.gs PRO mensuel.
nl: U neemt een abonnement op het maandelijks plan van Meetin.gs PRO
sv: Du prenumererar på Meetin.gs PRO månatliga plan.

source: You are subscribing to Meetin.gs PRO yearly plan.
fi: Olet päivittämässä tilisi vuosimaksulliseen Meetin.gs PRO pakettiin.
fr: Vous avez souscrit à l'abonnement Meetin.gs PRO annuel.
nl: U neemt een abonnement op het jaarlijks plan van Meetin.gs PRO
sv: Du prenumererar på Meetin.gs PRO årlig plan.

source: Subscription will be renewed automatically at the end of each billing cycle.
fi: Tilauksesi jatkuu automaattisesti laskutuskauden päättyessä.
fr: L'abonnement sera renouvelé automatiquement à la fin de chaque période de facturation.
nl: Uw abonnement zal automatisch worden verlengd aan het einde van elke rekeningperiode.
sv: Prenumeration kommer att förnyas automatiskt i slutet av varje faktureringsperiod.

source: You can unsubscribe any time during the billing cycle.
fi: Voit katkaista tilauksen milloin vain ennen seuraavan laskutuskauden alkua.
fr: Vous pouvez vous désabonner à tout moment au cours de la période de facturation.
nl: U kunt uw abonnement op elk moment tijdens de rekeningperiode opzeggen.
sv: Du kan avbryta prenumerationen när som helst under faktureringsperioden.

source: We support all major credit cards. All transactions are secure and encrypted.
fi: Tuemme kaikkia yleisimpiä luottokortteja. Maksutapahtuma käsitellään suojatun yhteyden yli ja siihen liittyvät tiedot salataan.
fr: Nous acceptons la plupart des cartes de paiement. Toutes les transactions sont chiffrées et sécurisées.
nl: We ondersteunen alle belangrijke kredietkaarten. Alle transacties zijn veilig en versleuteld.
sv: Vi tar alla större kreditkort. Alla transaktioner är säkra och krypterade.

source: New Account
fi: Uusi tili
fr: Nouveau compte
nl: Nieuwe account
sv: Nytt Konto

source: Email address
fi: Email osoite
fr: Adresse électronique
nl: E-mailadres
sv: E-postadress

source: Credit Card
fi: Luottokortti
fr: Carte de crédit
nl: Kredietkaart
sv: Kreditkort

source: Name on Card
fi: Kortinhaltijan nimi
fr: Nom sur la carte
nl: Naam op de kaart
sv: Namn på Kort

source: Card number
fi: Kortin numero
fr: Numéro de carte
nl: Kaartnummer
sv: Kortnummer

source: Expiry Date
fi: Voimassa
fr: Date d'expiration
nl: Vervaldatum
sv: Utgångsdatum

source: Security Code (CVC)
fi: Turvakoodi (CVC)
fr: Code de sécurité (CVC)
nl: Veligheidscode (CVC)
sv: Säkerhetskod (CVC)

source: Company (optional)
fi: Yritys (valinnainen)
fr: Société (optionnel)
nl: Bedrijf (optioneel)
sv: Bolag (frivilligt)

source: Company Name
fi: Yrityksen nimi
fr: Nom de la société
nl: Bedrijfsnaam
sv: Bolagets namn

source: I have VAT number (Value Added Tax)
fi: Palvelu tulee ALV-velvollisen yrityksen käyttöön
fr: J'ai le numéro de TVA (Taxe sur la Valeur Ajoutée)
nl: Ik heb een BTW-nummer (Belasting op Toegevoegde Waarde)
sv: Jag har VAT-nummer (Momsregistreringsnummer)

source: VAT-ID
fi: ALV-tunnus
fr: Identification TVA
nl: BTW-ID

source: Billing Address
fi: Laskutusosoite
fr: Adresse de facturation
nl: Facturatie-adres
sv: Faktureringsadress

source: Street Address
fi: Katuosoite
fr: Adresse postale
nl: Straatadres
sv: Gatuadress

source: City
fi: Kaupunki
fr: Ville
nl: Stad
sv: Stad

source: Postal code
fi: Postinumero
fr: Code postal
nl: Postcode
sv: Postkod

source: Country
fi: Maa
fr: Pays
nl: Land
sv: Land

source: Select country
fi: Valitse maa
fr: Choisir pays
nl: Land selecteren
sv: Välj land

source: Promotional code
fi: Kampanjakoodi
fr: Code promotionnel
nl: Promotiecode
sv: Kampanjkod

source: You will be billed monthly:
fi: Laskutus kuukausittain:
fr: Vous serez facturé mensuellement :
nl: U wordt maandelijks in rekening gebracht:
sv: Du kommer att bli fakturerad månatligen:

source: You will be billed yearly:
fi: Laskutus vuosittain:
fr: Vous serez facturé annuellement :
nl: U zult jaarlijks gefactureerd worden:
sv: Du kommer att bli fakturerad årligen:

source: (reverse tax applies)
fi: (käänteisverollinen hinta)
fr: (l'autoliquidation s'applique)
nl: (omgekeerde belasting geldt)
sv: (omvänd moms gäller)

source: Pay now
fi: Osta
fr: Payer maintenant
nl: Nu betalen
sv: Betala nu

source: Thank you, you're awesome!
fi: Kiitos, olet mahtava!
fr: Merci, vous êtes génial !
nl: Dank u wel!
sv: Tack!

source: Thank you for upgrading to Meetin.gs PRO. We really appreciate it!
fi: Kiitos kun ryhdyit PRO-käyttäjäksi!
fr: Nous vous remercions d'être passé à la version Meetin.gs PRO. Nous vous en sommes reconnaissants !
nl: Dank u voor de upgrade naar Meetin.gs PRO. We waarderen het echt!
sv: Tack för att du uppgraderar till Meetin.gs PRO. Vi uppskattar det verkligen!

source: We have sent you an email with a login link and further instructions and tips on how to get the most out of your PRO subscription.
fi: Lähetimme sinulle sähköpostin, joka sisältää kirjautumislinkkisi sekä ohjeita ja vinkkejä, joten saat kaiken hyödyn irti PRO-tilauksestasi
fr: Nous vous avons envoyé un courriel contenant un lien de connexion et de nouvelles instructions et astuces pour profiter au mieux de votre abonnement PRO.
nl: We hebben u een e-mail gestuurd met een login-link en verdere instructies en tips over hoe u alles kunt halen uit uw PRO-abonnement.
sv: Vi har skickat ett mejl med en inloggningslänk och ytterligare instruktion och tips på hur du får ut det mesta ur ditt PRO-abonnemang.

source: You will also get a receipt of your transaction in a separate email.
fi: Tulet myös saamaan kuitin ostoksestasi erillisessä sähköpostiviestissä.
fr: Vous recevrez également un reçu de votre transaction dans un courriel séparé.
nl: U zult van uw transactie ook een ontvangstbewijs krijgen in een afzonderlijke e-mail.
sv: Du kommer också att få ett kvitto på din transaktion i ett separat mejl.

source: Log in
fi: Kirjaudu sisään
fr: Se connecter
nl: Inloggen
sv: Logga in

source: Provide your contact details
fi: Anna yhteystietosi
fr: Renseignez vos coordonnées
nl: Geef uw contactgegevens
sv: Ange dina kontaktdetaljer.

source: %(B$One last thing:%) please provide some basic information of yourself. We will create a profile for you and let %1$s know who you are.
fi: %(B$Vielä yksi asia:%) Syötä tähän perustietoa itsestäsi. Luomme tietojen pohjalta sinulle käyttäjätunnuksen ja kerromme käyttäjälle %1$s kuka sinä olet.
fr: %(B$Une dernière chose :%) veuillez renseigner quelques informations de base sur vous. Nous vous créerons un profil et nous vous ferons connaître auprès de %1$s.
nl: %(B$Nog één ding:%) geef enige basisinformatie over uzelf. Wij zullen een profiel voor u aanmaken en l%($s laten weten wie u bent.
sv: %(B$En sista sak:%) ge oss lite grundläggande information om dig. Vi skapar en profil åt dig och låter %1$s veta vem du är.

source: Copy & paste your LinkedIn URL here
fi: Lisää LinkedIn-profiilisi osoite tähän
fr: Copiez-collez votre URL LinkedIn ici
nl: Kopieer en plak je Linkedln URL hier
sv: Kopiera och klistra din LinkedIn-URL här

source: Time zone
fi: Aikavyöhyke:
fr: Fuseau horaire
nl: Tijdzone
sv: Tids-zon

source: Time for this time zone:
fi: Kyseisen aikavyöhykkeen kellonaika:
fr: Heure pour ce fuseau horaire :
nl: Tijd in deze tijdzone:
sv: Tid för denna tids-zon:

source: By continuing you accept the %(L$Terms of Service%).
fi: Jatkamalla hyväksyt palvelumme %(L$käyttöehdot%).
fr: En continuant, vous acceptez les %(L$conditions de service%).
nl: Door door te gaan accepteert u de %(L$Voorwaarden van Dienstverlening%).
sv: Genom att fortsätta accepterar du %(L$Användarvillkor%).

source: Your account settings
fi: Tilisi asetukset
fr: Paramètres de votre compte
nl: Uw accountinstellingen
sv: Dina kontoinställningar

source: Manage your account and subscription.
fi: Hallinnoi tilaustasi
fr: Gérer votre compte et votre abonnement.
nl: Beheer uw account en abonnement.
sv: Hantera ditt konto och abonnemang.

source: Subscription
fi: Tilaus
fr: Abonnement
nl: Inschrijving
sv: Prenumeration

source: You are using the limited version of Meetin.gs. Start your free 30-day trial to explore the full suite with all the benefits.
fi: Käytät Meetin.gs-palvelun rajattua ilmaisversiota. Aloita veloitukseton 30 päivän koekäyttö tutustuaksesi palvelun kokoversioon sisältyviin erikoisominaisuuksiin.
fr: Vous utilisez la version limitée de Meetin.gs. Démarrez votre essai gratuit de 30 jours pour explorer la suite complète avec tous les avantages.
nl: U gebruikt de beperkte versie van Meetin.gs. Begin uw gratis proefperiode van 30 dagen om het volledig pakket met alle voordelen te exploreren.
sv: Du använder den begränsade versionen av Meetin.gs. Börja din gratis 30 dagar långa utvärderingsperiod för att upptäcka alla funktioner.

source: Start the trial
fi: Aloita koekäyttö
fr: Démarrer l'essai
nl: Begin de proefperiode
sv: Börja utvärderingsperioden

source: Your free trial sponsored by Meetin.gs will end %(B$%1$s%).
fi: Meetin.gs:n tarjoama veloitukseton koejaksosi päättyy %(B$%1$s%).
fr: Votre essai gratuit sponsorisé par Meetin.gs se terminera le %(B$%1$s%).
nl: Uw gratis proefperiode gesponsord door Meetin.gs zal verlopen %(B$%1$s%).
sv: Din gratis utvärderingsperiod från Meetin.gs kommer att ta slut %(B$%1$s%).

source: Upgrade Meetin.gs now to secure a seamless transition after your trial ends. We will give you free credit for the time you have left on your trial. So your first billing cycle would start %1$s.
fi: Päivitä Meetin.gs-tilisi turvataksesi saumaton siirtymä koekäyttöjakson päättymisen jälkeen. Tarjoamme sinulle jäljellä olevaa koekäyttöaikaa vastaavan ajan veloituksetta. Ensimmäinen laskutuskautesi alkaisi %1$s.
fr: Mettez à niveau Meetin.gs dès maintenant pour sécuriser une transition homogène après la fin de votre essai. Nous vous offrirons du crédit gratuit pour le temps qu'il reste sur votre essai. Donc, votre premier cycle de facturation démarrerait le %1$s.
nl: Upgrade Meetin.gs nu om een ​​naadloze overgang te garanderen nadat de proefperiode eindigt. Wij zullen u gratis krediet geven voor de tijd die u nog hebt in de proefperiode. Dus uw eerste facturatie-cyclus zou beginnen %1$s.
sv: Uppgradera Meetin.gs nu för att säkra en sömlös övergång efter att din utvärdering tar slut. Vi kommer att ge dig gratis krediter för tiden som du har kvar på din utvärdering. Din nästa faktureringsperiod skulle börjar %1$s.

source: Are you running out of time or require additional information on our service? Don't worry, just %(L$contact%) our Head of Customer happiness Antti to request an extension or %(A$schedule%) a short call with him to learn more.
fi: Tuntuuko, että kokeäyttöaika loppuu kesken tai haluatko lisätietoja palvelusta? %(L$Ota yhteyttä%) Anttiin ja pyydä jatkoaikaa tai %(A$sovi puhelu%) hänen kanssaan saadaksesi lisätietoja.
fr: Manquez-vous de temps ou avez-vous besoin d'informations supplémentaires sur notre service ? Ne vous inquiétez pas, %(L$contactez%) simplement Antti, notre Chef de satisfaction client, pour demander une extension ou %(A$programmer%) un appel rapide avec lui pour en savoir plus.
nl: Heeft u geen tijd of heeft u aanvullende informatie nodig over onze dienstverlening? Geen nood, %(L$contacteer%) gewoon ons klantenhoofd Antti om een uitbreiding aan te vragen of %(A$agendeer%) een kort gesprek met hem voor meer informatie.
sv: Håller tiden på att ta slut eller behöver du ytterligare information om vår tjänst? Oroa dig inte,%(L$kontakta%) bara vår chef för kundnöjdhet Antti för att begära en anslutning eller %(A$boka in%) ett kort samtal med honom för att lära dig mer.

source: Your free trial of Meetin.gs has expired. Upgrade to PRO to continue using the full suite with only:
fi: Ilmainen koekäyttösi on päättynyt. Päivitä tilisi PRO-versioon:
fr: Votre essai gratuit de Meetin.gs a expiré. Mettez à niveau avec PRO pour continuer à utiliser la suite complète avec seulement :
nl: Uw gratie proefperiode van Meetin.gs is verlopen. Upgrade naar PRO om het volledige pakket te blijven gebruiken met enkel:
sv: Din gratisversion av Meetin.gs har gått ut. Uppgradera till PRO för att fortsätta ha alla funktioner med bara:

source: $12 / month / organizer
fi: 12 $ / kuukausi / järjestäjä
fr: 12 $ / mois / organiseur
nl: 12 $/maand/organisator
sv: 12$/månad/organiserare

source: $129 / year / organizer (ten percent discount)
fi: 129 $ / vuosi / järjestäjä (kymmenen prosentin alennus)
fr: 129 $ / an / organiseur (dix pour cent de réduction)
nl: 129 $/jaar/organisator (tien procent korting)
sv: 129$/år/oraganiserare (tio procents rabatt)

source: Did you miss the trial or require additional information of the service? Don't worry, just %(L$contact%) our Head of Customer happiness Antti to request an extension or %(A$schedule%) a short call with him to learn more.
fi: Loppuiko kokeäyttöaika kesken tai haluatko lisätietoja palvelusta? %(L$Ota yhteyttä%) Anttiin ja pyydä jatkoaikaa tai %(A$sovi puhelinesittely%) saadaksesi lisätietoja palvelusta.
fr: Avez-vous manqué l'essai ou avez-vous besoin d'informations supplémentaires sur le service ? Ne vous inquiétez pas, %(L$contactez%) simplement Antti, notre Chef de satisfaction client, pour demander une extension ou %(A$programmer%) un appel rapide avec lui pour en savoir plus.
nl: Hebt u de proefperiode gemist of wilt u bijkomende informatie van de service? Geen nood, %(L$contacteer%) gewoon klantenhoofd Antti om een uitbreiding aan te vragen of %(A$agendeer%) een kort gesprek met hem voor meer informatie.
sv: Missade du utvärderingsversionen eller behöver du ytterligare information om tjänsten? Oroa dig inte,%(L$kontakta%) bara vår chef över kundnöjdhet Antti för att begära en anslutning eller %(A$boka in%) ett kort samtal med honom för att lära dig mer.

source: You are using the free PRO account sponsored by Meetin.gs. Your PRO subscription will stay active for the time being. We sincerely hope you are enjoying it and would appreciate any %(L$feedback%).
fi: Käytät Meetin.gs:n lahjoittamaa ilmaista PRO-tiliä. Ilmainen tilisi on voimassa toistaiseksi. Toivottavasti palvelu on sinulle hyödyllinen. Olisi mahtavaa, mikäli voisit antaa meille %(L$palautetta%) sen tiimoilta.
fr: Vous utilisez un compte PRO gratuit sponsorisé par Meetin.gs. Votre abonnement PRO restera actif pour le moment. Nous espérons sincèrement que vous l'appréciez et nous serions ravis d'avoir un %(L$feedback%).
nl: U gebruikt de gratis PRO-account gesponsord door Meetin.gs. Uw PRO-abonnement zal voor het moment actief blijven. Wij hopen dat u ervan geniet en zouden elke %(L$feedback%) waarderen.
sv: Du använder ett gratis PRO-konto sponsrat av Meetin.gs. Ditt PRO-abonnemang kommer att fortsätta vara aktivt tills vidare. Vi önskar innerligt att du gläds av vår tjänst och vi uppskattar all %(L$feedback%).

source: Do you like our service? Support our cause and further development by upgrading to the paid PRO with only:
fi: Pidätkö palvelustamme? Tue jatkuvaa kehitystyötämme päivittämällä maksulliseen PRO-versioon:
fr: Aimez-vous notre service ? Soutenez notre cause et notre futur développement en mettant à niveau avec le PRO payant avec seulement :
nl: Vindt u onze service goed? Steun onze zaak en de verdere ontwikkeling door een upgrade naar de betaalde PRO, enkel met:
sv: Gillar du vår tjänst? Stötta vår sak genom att uppgradera till betaltjänsten PRO med bara:

source: Support us & upgrade
fi: Tue toimintaamme & päivitä
fr: Soutenez nous et mettez à niveau
nl: Steun ons & upgrade
sv: Stötta oss och uppgradera

source: Thank you for your subscription. We really appreciate it.
fi: Kiitos tilauksesta!
fr: Merci pour votre abonnement. Nous vous en sommes très reconnaissants.
nl: Dank u voor uw abonnement. We stellen het echt op prijs.
sv: Tack för ditt abonnemang. VI uppskattar det verkligen.

source: Use Paypal to manage your subscription:
fi: Hallinnoi tilaustasi Paypalin kautta:
fr: Utiliser Paypal pour gérer votre abonnement :
nl: Gebruik PayPal om uw abonnement te beheren:
sv: Använd Paypal för att hantera ditt abonnemang:

source: Manage your subscription
fi: Hallinnoi tilaustasi
fr: Gérer votre abonnement
nl: Beheer uw abonnement
sv: Hantera ditt abonnemang

source: You have canceled your subscription. Your account will be downgraded once your last billing cycle ends %1$s.
fi: Olet perunut tilauksesi. Tilisi palaa rajoitetuksi ilmaisversioksi viimeisimmän maksamasi laskutuskauden päättyessä %1$s.
fr: Vous avez annulé votre abonnement. Votre compte sera rétrogradé une fois que votre dernier cycle de facturation sera terminé le %1$s.
nl: Uw heeft uw abonnement opgezegd. Uw account zal gedegradeerd worden eenmaal uw laatste facturatie-cyclus eindigt %1$s.
sv: Du har avslutat ditt abonnemang. Ditt konto kommer att nedgraderas så fort din sista faktureringsperiod har tagit slut %1$s.

source: Re-subscribe
fi: Tilaa uudestaan
fr: Se réabonner
nl: Opnieuw abonneren
sv: Återabonnera.

source: You are on the yearly Meetin.gs PRO plan.
fi: Käytössäsi on Meetin.gs PRO -vuosipaketti.
fr: Vous êtes sur le programme annuel Meetin.gs PRO.
nl: U bevindt zich op het jaarlijks Meetin.gs PRO-plan.
sv: Du är med i den årliga Meetin.gs PRO-planen.

source: You are on the monthly Meetin.gs PRO plan.
fi: Käytössäsi on Meetin.gs PRO -kuukausipaketti.
fr: Vous êtes sur le programme mensuel Meetin.gs PRO.
nl: U bevindt zich op het maandelijkse Meetin.gs PRO-plan.
sv: Du är med i Meetin.gs:s månatliga PRO-plan.

source: Your next billing cycle starts %1$s.
fi: Seuraava laskutuskausi alkaa %1$s.
fr: Votre prochain cycle de facturation démarre le %1$s.
nl: Uw volgende facturatie-cyclus begint %1$s.
sv: Din nästa faktureringsperiod börjar %1$s.

source: Cancel subscription
fi: Peru tilaus
fr: Annuler l'abonnement
nl: Abonnement opzeggen
sv: Avsluta abonnemang

source: Your %1$s PRO subscription is paid by %2$s.
fi: %1$s PRO tilauksesi maksaa %2$s.
fr: Votre abonnement %1$s PRO est payé par %2$s.
nl: Uw %1$s PRO-abonnement is betaald door %2$s.
sv: Ditt %1$s PRO-abonnemang är betalad av %2$s.

source: The administrator managing this company account is %1$s.
fi: Tätä yritystiliä hallinnoi %1$s.
fr: L'administrateur gérant le compte de cet entreprise est %1$s.
nl: De administrator die de bedrijfsaccount beheert, is %1$s.
sv: Administratören som hanterar detta bolagskonto är %1$s.

source: Remove account
fi: Poista tili
fr: Supprimer le compte
nl: Account verwijderen
sv: Ta bort konto
