Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_front-*.po
Languages: fi, fr, nl, sv

source: Here's my Meet Me page where you can book a meeting with me easily:
fi: Tässä on Meet Me -sivuni, jota hyödyntämällä voit helposti sopia tapaamisen kanssani.
fr: Voici ma page Rencontrez-Moi où vous pouvez planifier un rendez-vous avec moi facilement :
nl: Hier is mijn Meet Me pagina, waar u gemakkelijk een vergadering met mij kunt afspreken:
sv: Här är min Möt mig-sida, där du enkelt kan boka ett möte med mig:

source: Generate a %(B$meet me%) button
fi: Luo tapaamispainike
fr: Générer un bouton %(B$rencontrez-moi%)
nl: Genereer een %(B$meet me%) knop
sv: Generera en %(B$möt mig%)-knapp

source: Get your %(B$meet me%) button to share your availability on your website.
fi: Hanki oma %(B$meet me%) -painikkeesi, jolla voit jakaa tapaamiskalenterisi verkkosivuillasi.
fr: Obtenez votre bouton %(B$rencontrez-moi%) pour partager vos disponibilités sur votre site.
nl: Krijg uw %(B$meet me%) knop om uw beschikbaarheid op uw website te delen.
sv: Skaffa din %(B$möt mig%)-knapp för att dela din tillgänglighet på din webbsida.

source: Choose the button:
fi: Valitse painike:
fr: Choisir le bouton :
nl: Kies de knop:
sv: Välj knappen:

source: Copy and paste the code below into the HTML of your site:
fi: Kopio oheinen HTML verkkosivusi koodiin:
fr: Copiez-collez le code ci-dessous dans l'HTML de votre site :
nl: Kopieer en plak de onderstaande code in de HTML van uw website:
sv: Kopiera och klistra in koden nedan i din sidas HTML:

source: Generate and send quickmeet links
fi: Luo ja lähetä Quickmeet linkkejä
fr: Générer et envoyer liens de rencontres rapides
nl: Genereren en quickmeet-links verzenden
sv: Generera och skicka quickmeet-länkar

source: Next %1$s will answer your request to meet. We will notify you once we have a response.
fi: Seuraavaksi %1$s vastaa tapaamispyyntöösi. Ilmoitamme sinuole saatuamme häneltä vastauksen.
fr: Ensuite %1$s répondra à votre demande de rendez-vous. Nous vous préviendrons lorsque nous aurons une réponse.
nl: Vervolgens %1$s zal uw vergaderverzoek beantwoorden. We zullen u op de hoogte wanneer we een reactie.
sv: Härnäst %1$s ska svara mötesförfrågan. Vi meddelar dig när vi har ett svar.

source: Choose your time
fi: Valitse aikavyöhyke
fr: Choisissez votre horaire
nl: Kies uw tijd
sv: Välj din tid

source: Which time zone would you prefer for displaying the available times?
fi: Mitä aikavyöhykettä haluat käyttää aikojen näyttämiseen?
fr: Quel fuseau horaire préférez-vous pour l'affichage des heures disponibles ?
nl: Welke tijdzone heeft uw voorkeur voor het weergeven van beschikbare tijdstippen?
sv: Vilken tidszon föredrar du när de tillgängliga tiderna ska visas?

source: Timezone set for
fi: Aikavyöhyke on asetettu
fr: Fuseau horaire défini pour
nl: Tijdzone ingesteld voor
sv: Tidszon inställd för

source: Timezone set by
fi: Aikavyöhykkeen on asettanut
fr: Fuseau horaire défini par
nl: Tijdzone ingesteld door
sv: Tidszon inställt av

source: Current time for this zone is:
fi: Valitulla aikavyöhykkeellä kello on:
fr: L'heure actuelle pour ce fuseau est :
nl: Huidige tijd voor deze zone is:
sv: Aktuell tid för denna zon är:

source: Your time zone
fi: Sinun aikavyöhykkeesi
fr: Votre fuseau horaire
nl: Uw tijdzone
sv: Din tidszon

source: Select icon
fi: Valitse kuvake
fr: Sélectionner icône
nl: Selecteer icoon
sv: Välj ikon

source: Dismiss
fi: Merkkaa nähdyksi
fr: Rejeter
nl: Stuur weg
sv: Avslå

source: Please respond to the invitation: %1$s
fi: Ole hyvä ja vastaa kutsuun: %1$s
fr: Veuillez répondre à l'invitation : %1$s
nl: Gelieve te antwoorden op de uitnodiging: %1$s
sv: Var god svara på inbjudan: %1$s

source: %1$s invited you to %2$s
fi: %1$s kutsui sinut tapaamiseen %2$s
fr: %1$s vous a invité à %2$s
nl: %1$s heeft u uitgenodigd voor %2$s
sv: %1$s har bjudit in dig till %2$s

source: somebody
fi: joku
fr: quelqu'un
nl: iemand
sv: någon

source: %1$s added material %2$s in %3$s
fi: %1$s lisäsi aineiston %2$s kokouksessa %3$s
fr: %1$s a ajouté l'élément %2$s dans %3$s
nl: %1$s toegevoegd materiaal %2$s in %3$s
sv: %1$s la till referensmaterialet %2$s till %3$s

source: New participant: %1$s in %2$s
fi: Uusi osallistuja: %1$s kokouksessa %2$s
fr: Nouveau participant : %1$s dans %2$s
nl: Nieuwe deelnemer: %1$s in %2$s
sv: Ny deltagare: %1$s i %2$s

source: Meeting time was changed to %1$s for %2$s
fi: Kokouksen %2$s aika muuttui. Uusi tapaamisaika %1$s
fr: L'heure de la rencontre a été modifiée pour %1$s à la place de %2$s
nl: Vergaderingstijd werd veranderd van %1$s voor %2$s
sv: Mötestiden ändrades till %1$s för %2$s

source: Meeting time was removed from %1$s
fi: Tapaamisaika poistettiin kokouksesta %1$s
fr: L'heure de la réunion a été retirée de %1$s
nl: Vergaderingstijd werd verwijderd uit %1$s
sv: Mötestiden har tagits bort från %1$s

source: Meeting location changed to %1$s for %2$s
fi: Kokouksen %2$s paikka muuttui. Uusi tapaamispaikka %1$s
fr: Le lieu de la rencontre modifié en %1$s pour %2$s
nl: Vergaderingsplaats veranderd naar %1$s voor %2$s
sv: Mötesplatsen har ändrats till %1$s för %2$s

source: %1$s commented %2$s in %3$s
fi: %1$s kommentoi aineistoa %2$s kokouksessa %3$s
fr: %1$s a commenté %2$s dans %3$s
nl: %1$s gaf commentaar %2$s in %3$s
sv: %1$s kommenterade %2$s i %3$s

source: %1$s changed the title of %2$s to %3$s
fi: %1$s muutti kokouksen nimeä %2$s uusi nimi on %3$s
fr: %1$s a modifié le titre de %2$s en %3$s
nl: %1$s veranderde de titel van %2$s naar %3$s
sv: %1$s ändrade titeln på %2$s till %3$s

source: Meeting time was changed to %1$s
fi: Aikaa muutettiin. Uusi tapaamisaika %1$s
fr: L'heure de la réunion a été modifiée pour %1$s
nl: Vergaderingstijd werd veranderd naar %1$s
sv: Mötestiden har ändrats till %1$s.

source: Meetin time was removed from
fi: Tapaamisaika poistettiin kokouksesta
fr: L'heure de la réunion a été retirée de
nl: Vergaderingstijd werd verwijderd van
sv: Mötestiden togs bort från

source: Meeting location was set to %1$s for %2$s
fi: Kokouksen %2$s sijainniksi asetettiin %1$s
fr: Le lieu de la rencontre a été prévu à %1$s pour %2$s
nl: Vergaderingsplaats gezet van %1$s voor %2$s
sv: Mötesplatsen har fastställts till %1$s för %2$s

source: %1$s from %2$s would like to meet you. Please respond now.
fi: %1$s yrityksestä %2$s haluaa tavata sinut. Vastaa mahdollisimman pian.
fr: %1$s de %2$s souhaite vous rencontrer. Merci de répondre rapidement.
nl: %1$s van %2$s zou u graag ontmoeten. Gelieve nu te antwoorden.
sv: %1$s från %2$s skulle vilja träffa dig. Var god svara nu.

source: %1$s would like to meet you. Please respond now.
fi: %1$s haluaa tavata sinut. Vastaa mahdollisimman pian.
fr: %1$s souhaiterait vous rencontrer. Merci de réponse rapidement.
nl: %1$s zou u graag ontmoeten. Gelieve nu te antwoorden.
sv: %1$s skulle vilja träffa dig. Var god svara nu.

source: %1$s accepted your request to meet.
fi: %1$s hyväksyi tapaamispyyntösi.
fr: %1$s a accepté votre demande de rencontre.
nl: %1$s aanvaardde uw vraag om te vergaderen.
sv: %1$s har accepterat din begäran om att träffas.

source: %1$s accepted your request and wants to double check your RSVP.
fi: %1$s hyväksyi tapaamispyyntösi ja haluaa varmistaa, että aika käy sinulle.
fr: %1$s a accepté votre demande et souhaite que vous confirmiez votre réponse.
nl: %1$s aanvaardde uw verzoek en wil uw RSVP dubbel controleren.
sv: %1$s har accepterat din begäran och vill dubbelkolla ditt OSA.

source: %1$s is looking for a suitable time for a meeting.
fi: %1$s etsii sopivaa tapaamisaikaa.
fr: %1$s recherche une heure appropriée pour une réunion.
nl: %1$s is op zoek naar een geschikt tijdstip voor een vergadering.
sv: %1$s försöker hitta en lämplig mötestid.

source: We need more input from you to schedule %1$s.
fi: Tarvitsemme lisää vastauksia löytääksemme ajan kokoukselle %1$s.
fr: Nous avons besoin de plus de données de votre part pour planifier %1$s.
nl: We hebben meer gegevens van u nodig om %1$s te plannen.
sv: Vi behöver mer information från dej för att fastställa tidpunkten för %1$s.

source: Time found for %1$s on %2$s.
fi: Kokoukselle %1$s löytyi aika: %2$s.
fr: Heure trouvée pour %1$s le %2$s.
nl: Tijd gevonden voor %1$s op %2$s.
sv: Tid hittad för %1$s på %2$s.

source: We were unable to find a suitable time for %1$s.
fi: Emme onnistuneet löytämään aikaa tapaamiselle %1$s.
fr: Nous n'avons pas pu trouver une heure appropriée pour %1$s.
nl: We konden geen geschikt tijdstip vinden voor %1$s.
sv: Vi kunde inte hitta en lämplig tid för %1$s.

source: Scheduling is stagnant. We are missing responses for %1$s.
fi: Ajan etsiminen on seisahtunut. Vastauksia puuttuu tapaamiseen %1$s liittyen.
fr: La planification stagne. Il nous manque des réponses pour %1$s.
nl: Planning staat stil. We missen antwoorden voor %1$s.
sv: Schemaläggningen är trög. Vi saknar svar för %1$s.

source: Send invite
fi: Lähetä kutsu
fr: Envoyer invitation
nl: Uitnodiging versturen.
sv: Skicka inbjudan

source: Continue using Meetin.gs PRO
fi: Jatka Meetin.gs PRO:n käyttämistä
fr: Continuer à utiliser Meetin.gs PRO
nl: Ga verder met het gebruik van Meetin.gs PRO
sv: Fortsätt använda Meetin.gs PRO

source: Upgrade to Meetin.gs PRO
fi: Ryhdy PRO-käyttäjäksi
fr: Passez à la version Meetin.gs PRO
nl: Upgrade naar Meetin.gs PRO
sv: Uppgradera till Meetin.gs PRO

source: Your Meetin.gs trial has expired
fi: Meetin.gs PRO koekäyttöjaksosi on päättynyt
fr: Votre période d'essai Meetin.gs a expiré
nl: Het proefabonnement voor Your Meetin.gs is verlopen
sv: Din utvärderingsperiod av Meetin.gs har gått ut

source: Upgrade Meetin.gs now to secure a seamless transition after your trial ends. You will not be charged for the trial period anyways.
fi: Päivitä Meetin.gs tilisi varmistaaksesi palvelun saumattoman jatkumisen koekäyttöjaksosi jälkeen. Annamme sinulle jäljellä olevaa kokeäyttöjaksoasi vastaavan ajan veloituksetta.
fr: Passez à la version supérieure de Meetin.gs dès maintenant pour une transition fluide après l'arrêt de votre période d'essai. La période d'essai ne vous sera pas facturée dans tous les cas.
nl: Upgrade Meetin.gs nu om een ​​naadloze overgang te garanderen nadat de proefperiode eindigt. U zult in ieder geval niet in rekening worden gebracht voor de proefperiode.
sv: Uppgradera Meetin.gs nu för att säkra en sömlös övergång efter att din utvärdering tagit slut. Du kommer ändå inte att debiteras för utvärderingstiden.

source: Thank you for trying Meetin.gs PRO. Upgrade now and claim your first year as a Meetin.gs PRO user for half the price.
fi: Kiitos, että kokeilit Meetin.gs PRO:ta. Päivitä tilisi nyt niin saat Meetin.gs PRO:n ensimmäiseksi vuodeksi puoleen hintaan.
fr: Merci d'essayer Meetin.gs PRO. Abonnez-vous dès maintenant pour profiter de la première année de Meetin.gs PRO à moitié prix.
nl: Bedankt voor het uitproberen van Meetin.gs PRO. Upgrade nu en eis uw eerste jaar als Meetin.gs PRO-gebruiker voor de helft van de prijs.
sv: Tack för att du provat på Meetin.gs PRO. Uppgradera nu för rätten att få ett första år som Meetin.gs PRO-användare för halva priset.

source: Additional Meet Me pages is a Meetin.gs PRO feature.
fi: Useammat Meet Me -sivut ovat Meetin.gs PRO:n ominaisuus.
fr: Les pages Rencontrez-moi supplémentaires sont une fonctionnalité Meetin.gs PRO.
nl: Extra Meet Me pagina's is een Meetings PRO functie
sv: Flera Möt mig-sidor är en PRO-funktion hos Meetin.gs.

source: Google Hangouts, Microsoft Lync and custom options are PRO features.
fi: Google Hangouts, Microsoft Lync ja omavalintaisten työkalujen käyttäminen ovat PRO-ominaisuuksia.
fr: Google Hangouts, Microsoft Lync et les options de personnalisation sont des fonctionnalités PRO.
nl: Google Hangouts, Microsoft Lync en aangepaste opties zijn PRO functies.
sv: Google Hangouts, Microsoft Lync och anpassade alternativ är PRO-funktioner.

source: Meetings with more than 6 participants is a PRO feature.
fi: Yli kuuden hengen kokousten järjestäminen on Meetin.gs PRO ominaisuus.
fr: Les rencontres avec plus de six participants est une fonctionnalité PRO.
nl: Vergaderingen met meer dan 6 deelnemers is een PRO-kenmerk.
sv: Möten med över 6 deltagare är en PRO-funktion.

source: Configuring user rights on a per meeting basis is a PRO feature.
fi: Kokouskohtainen käyttöoikeuksien asettaminen on PRO-ominaisuus
fr: La configuration des droits d'utilisateur sur la base du nombre de rendez-vous est une fonctionnalité PRO.
nl: Het configureren van gebruikersrechten per vergadering is onderdeel van het PRO-pakket.
sv: Att konfigurera användares rättigheter per möte är en PRO-funktion.

source: / month
fi: / kuukausi
fr: / mois
nl: / maand
sv: / månad

source: Benefits for upgrading:
fi: Päivittämisestä saatavat hyödyt:
fr: Avantages de la version supérieure :
nl: Voordelen van upgraden:
sv: Fördelar vid uppgradering:

source: Save everyone from the pain of scheduling meetings.
fi: Pelasta itsesi ja muut aikataulutuksen aiheuttamalta tuskalta.
fr: Épargnez à tout le monde la corvée de planifier des rendez-vous.
nl: Bespaar iedereen de lasten van het plannen van vergaderingen.
sv: Låt alla slippa plågan som är mötesorganisation

source: Avoid the hassle by gathering all the meeting materials into one place.
fi: Vältä turha sähellys koostamalla kokousmateriaalit yhteen paikkaan.
fr: Évitez les prises de tête en regroupant tous les contenus de rendez-vous à un seul endroit.
nl: Bespaar u de moeite door all het vergadermateriaal op een plaats te verzamelen.
sv: Undvik problem genom att samla allt mötesmaterial på ett ställe

source: No more access codes: Join in with phone, Skype, Lync and Hangouts with a single tap.
fi: Ei enää pin-koodeja tai salasanoja – Liity kokoukseen yhdellä täppäyksellä käyttäen puhelinta, Skypeä, Lynciä tai Hangoutsia.
fr: Plus de codes d'accès : participez par téléphone, Skype, Lync et Hangouts avec une simple touche.
nl: Geen toegangscodes meer: Neem deel met uw telefoon, Skype, Lync en Hangouts door middel van een enkele tik.
sv: Inga fler accesskoder: Var med via telefon, Skype, Lync och Hangouts med ett enda tryck.

source: Be notified of meeting updates in an instant.
fi: Saat välittömästi tiedon kokouksessa tapahtuneista muutoksista.
fr: Soyez prévenu de toutes les informations nouvelles qui concernent vos rendez-vous en un instant.
nl: Blijf in een flits op de hoogte van vergaderingsupdates.
sv: Få aviseringar om mötesuppdateringar ögonblickligen.

source: Unlimited meeting schedulers
fi: Rajaton määrä tapaamiskalentereita
fr: Planificateurs de rendez-vous illimités
nl: Onbeperkt aantal vergadering planners
sv: Obegränsat antal schemaläggare för möten

source: Expanded live communication tools
fi: Laajennettu valikoima etätyökaluja
fr: Outils de communication directe étendus
nl: Uitgebreide tools voor live communicatie
sv: Utvidgade verktyg för kommunikation live

source: Visual customization and branding
fi: Ulkoasun muokkaus ja brändääminen
fr: Personnalisation visuelle et branding
nl: Visuele aanpassing en het promoten van een merknaam
sv: Visuell anpassning och branding

source: Unlimited meeting participants
fi: Rajaton määrä osallistujia
fr: Participants illimités pour la réunion
nl: Onbeperkt aantal deelnemers aan vergaderingen
sv: Obegränsat antal mötesdeltagare

source: Unlimited meeting materials
fi: Rajoittamattomat kokousmateriaalit
fr: Documents de réunion illimités
nl: Onbeperkt vergadermateriaal
sv: Obegränsat mötesmaterial

source: Later
fi: Myöhemmin
fr: Plus tard
sv: Senare

source: Free gift! Access the full suite for 30 days.
fi: Testaa täyttä tuotetta maksutta 30 päivää.
fr: Cadeau ! La série complète à votre disposition pendant 30 jours.
nl: Gratis geschenk! Krijg voor 30 dagen toegang tot het volledige pakket.
sv: Gratis gåva! Få tillgång till hela programsviten i 30 dagar.

source: Have a good look at our service at your convenience without any commitments. Embrace the full potential offered for increased meeting productivity and let us know what you think.
fi: Tutustu palveluun kaikessa rauhassa ilman minkäänlaisia sitoumuksia. Paranna kokoustesi laatua hyödyntämällä palvelun monipuolisia ominaisuuksia ja kerro meille mitä mieltä olet.
fr: Testez nos services comme il vous convient et sans engagement. Laissez-vous tenter par le plein potentiel offert pour une productivité améliorée de vos rendez-vous et dîtes-nous ce que vous en pensez.
nl: Bekijk op uw gemak en geheel vrijblijvend onze service. Omarm de mogelijkheden voor verhoogde productiviteit bij vergaderingen en laat ons weten wat u vindt.
sv: Titta ordentligt på vår tjänst när det passar dig utan att binda dig till något. Ta in den fulla potentialen för bättre mötesproduktivitet, och berätta för oss vad du tycker.

source: Free
fi: Ilmainen
fr: Gratuit
nl: Gratis
sv: Ledig

source: 1 month trial
fi: Kuukauden koekäyttö
fr: Période d'essai d'un mois.
nl: 1 maand op proef
sv: 1 månads provperiod

source: Explore the full suite for free for 30 days with the following benefits:
fi: Mitä hyötyä palvelu tarjoaa? Kokeile 30 päivän ajan ja:
fr: Explorez la série complète gratuitement pendant 30 jours avec les avantages suivants :
nl: Verken gratis het volledige pakket voor 30 dagen met de volgende voordelen:
sv: Utforska hela programsviten gratis i 30 dagar med följande förmåner:

source: Do you want to hear more or extend your trial? %(L$Schedule a meeting%) with our Head of Customer Happiness Antti and he will be happy to assist you.
fi: Tarvitsetkö pidemmän koekäyttöjakson tai haluatko lisätietoa palvelusta? %(L$Sovi tästä puhelinneuvottelu%) asiakaspalvelustamme vastaavan Antti Aallon kanssa.
fr: Vous voulez en savoir plus ou prolonger votre période d'essai ? %(L$Planifiez un rendez-vous%) avec notre Responsable de la Satisfaction Client Antti et il sera ravi de vous aider.
nl: Wilt u meer horen of uw proeftijd verlengen? %(L$Plan een vergadering%) met onze hoofd klanttevredenheid Antti Alto en hij zal u graag van dienst zijn.
sv: Vill du veta mer, eller förlänga din provperiod? %(L$Schedule a meeting%) med vår Nöjda Kunder-chef Antti Aalta, så hjälper han dig gladeligen.

source: Ok, lets go!
fi: Aloita!
fr: D'accord, c'est parti !
nl: Ok, hier gaan we!
sv: Okej, vi kör!

source: Start a free 30 day Meetin.gs PRO trial
fi: Meetin.gs PRO 30:ksi päiväksi koekäyttöön!
fr: Démarrer un essai gratuit de Meetin.gs PRO de 30 jours
nl: Begin met een gratis 30 dagen proef voor Meetin.gs PROFESSIONEEL
sv: Starta en gratis 30-dagars utvärdering av Meetin.gs PRO

source: Additional Meet Me pages is a Meetin.gs PRO feature. We offer you a free 30 day trial including multiple Meet Me pages and other great PRO features. Would you like to start your free trial now?
fi: Useamman Meet Me -sivun luominen on PRO-ominaisuus. Saat Meetin.gs PRO:n 30:ksi päiväksi ilmaiseen testikäyttöön, jonka aikana voit luoda rajattoman määrän Meet Me -sivuja. Testikäytön aikana pääset kokemaan myös kaikki muut PRO:n lisätoiminnallisuudet. Haluatko aloittaa koekäytön nyt?
fr: Les pages Me Rencontrer additionnelles sont une fonctionnalité PRO de Meetin.gs. Nous vous offrons un essai gratuit de 30 jours incluant les pages Me Rencontrer multiples et d'autres formidables fonctionnalités PRO. Voulez-vous démarrer votre essai gratuit maintenant ?
nl: Additional Meet Me-pagina´s is een PROFESSIONELE functie van Meetin.gs. We bieden u gratis 30 dagen op proef aan met inbegrip van meerdere Meet Me-pagina´s en andere belangrijke PROFESSIONELE functies. Wilt u nu beginnen met uw gratis proefperiode?
sv: Flera Möt mig-sidor är en PRO-funktion hos Meetin.gs. Vi erbjuder dig en gratis 30-dagars utvärdering, som inkluderar flera Möt mig-sidor och andra bra PRO-funktioner. Vill du börja med din gratis utvärdering nu?

source: Google Hangouts, Microsoft Lync and custom options are PRO features. We offer you a free 30 day trial including all live communication tools and other great PRO features. Would you like to start your free trial now?
fi: Google Hangouts, Microsoft Lync ja omavalintaisten työkalujen hyödyntäminen on PRO-ominaisuus. Saat Meetin.gs PRO:n 30:ksi päiväksi ilmaiseen testikäyttöön, joka sisältää kaikki etäkokoustyökalut sekä muut PRO:n lisätoiminnallisuudet. Haluatko aloittaa koekäytön nyt?
fr: Google Hangouts, Microsoft Lync et les options personnalisées sont des fonctionnalités PRO. Nous vous offrons un essai de 30 jours incluant tous les outils de communication en live et d'autres fonctionnalités PRO formidables. Voulez-vous commencer votre essai gratuit maintenant ?
nl: Google Hangouts, Microsoft Lync en aangepaste opties zijn PROFESSIONELE functies. We bieden u gratis 30 dagen op proef aan met inbegrip van alle live-communicate-instrumenten en andere belangrijke PROFESSIONELE functies. Wilt u nu beginnen met uw gratis proefperiode?
sv: Google Hangouts, Microsoft Lync och anpassade alternativ är PRO-funktioner. Vi erbjuder dig en gratis 30-dagars utvärdering, som inkluderar alla live-kommunikationsverktyg och andra bra PRO-funktioner. Vill du börja med din gratis utvärdering nu?

source: Meetings with more than 6 participants are a PRO feature. We offer you a free 30 day trial including including all the benefits of Meetin.gs PRO.
fi: Yli kuuden hengen kokoukset ovat PRO-ominaisuus. Saat Meetin.gs PRO:n 30:ksi päiväksi ilmaiseen testikäyttöön, joka sisältää kaikki PRO:n lisätoiminnallisuudet.
fr: Les réunions avec plus de 6 participants sont une fonctionnalité PRO. Nous vous offrons un essai gratuit de 30 jours incluant tous les avantages de Meetin.gs PRO.
nl: Vergaderingen met meer dan 6 deelnemers zijn een PRO functie. We bieden u een gratis 30 dagen proefabonnement aan, inculsief alle voordelen van Meetin.gs PRO.
sv: Möten med fler än 6 deltagare är en PRO-funktion. Vi erbjuder dig en gratis 30-dagars utvärdering, inkluderande alla fördelar av Meetin.gs PRO.

source: Configuring user rights on a per meeting basis is a PRO feature. We offer you a free 30 day trial including the user rights configuration and other great PRO features. Would you like to start your free trial now?
fi: Kokouskohtainen käyttöoikeuksien asettaminen on PRO-ominaisuus. Saat Meetin.gs PRO:n 30:ksi päiväksi ilmaiseen koekäyttöön, jonka aikana voit rauhassa kokeilla tätä ja kaikkia muita hyödyllisiä PRO-ominaisuuksia. Haluatko aloittaa koekäytön nyt?
fr: La configuration des droits d'utilisateur sur la base du nombre de rendez-vous est une fonctionnalité PRO. Nous vous offrons une période d'essai gratuite qui comprend la configuration des droits d'utilisateur et d'autres fonctionnalités PRO très utiles. Voulez-vous démarrer votre période d'essai maintenant ?
nl: Het configureren van gebruikersrechten per vergadering is onderdeel van het PRO-pakket. We bieden u een gratis proefversie van 30 dagen inclusief de functie om gebruikersrechten te configureren en andere geweldige PRO-functies. Wilt u nu uw gratis proefperiode starten?
sv: Att konfigurera användares rättigheter per möte är en PRO-funktion. Vi erbjuder dig en gratis 30-dagars provperiod, inklusive funktionen att konfigurera användares rättigheter och andra fantastiska PRO-funktioner. Vill du börja din gratis provperiod nu?

source: Start trial
fi: Aloita koekäyttö
fr: Démarrer l'essai
nl: Begin proef
sv: Starta utvärderingsversion

source: Connecting your calendar
fi: Kalenterin yhdistäminen
fr: Connexion de votre calendrier
nl: Uw kalender wordt verbonden.
sv: Ansluter din kalender
