Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_front-*.po
Languages: fi, fr, nl, sv

source: We've sent the meeting request
fi: Kokouspyyntö on lähetetty
fr: Nous avons envoyé la demande de rendez-vous
nl: We hebben de ontmoetingsaanvraag opgestuurd
sv: Vi har skickat mötesförfrågan

source: %1$s will now accept or decline your request.
fi: Seuraavaksi käyttäjä %1$s joko hyväksyy tai hylkää kokouspyyntösi.
fr: %1$s vont accepter ou décliner votre demande.
nl: %1$s zal nu uw aanvraag aanvaarden of verwerpen.
sv: %1$s kommer nu att acceptera eller avböja din förfrågan.

source: Where:
fi: Paikka:
fr: Où :
nl: Waar:
sv: Var:

source: Who:
fi: Osallistujat:
fr: Qui :
nl: Wie:
sv: Vem:

source: Add to calendar:
fi: Lisää kalenteriisi:
fr: Ajouter à l'agenda :
nl: Aan kalender toevoegen:
sv: Lägg till kalender:

source: Google calendar
fi: Google kalenteri
fr: Google Agenda
nl: Google-kalender
sv: Google-kalendern

source: Other ICS
fi: Muu ICS
fr: Autre ICS
nl: Andere ICS
sv: Annan ICS

source: What happens next? The recipient will now accept or decline your request to meet. We will send you a notification when we have a response.
fi: Välitämme nyt vastaanottajalle tapaamispyyntösi. Hän joko hyväksyy tai hylkää sen. Toimitamme sinulle ilmoituksen heti kun saamme vastauksen.
fr: Que se passe-t-il ensuite ? Le destinataire va accepter ou décliner votre demande de rendez-vous. Nous vous enverrons une notification lorsque nous aurons une réponse.
nl: Wat gebeurt er nadien? De ontvanger zal nu uw ontmoetingsvraag aanvaarden of afslaan. We zullen u een aankondiging sturen wanneer we een antwoord hebben.
sv: Vad händer härnäst? Mottagaren kommer nu att acceptera eller avböja din förfrågan om att mötas. Vi kommer att meddela dig när vi har ett svar.

source: Back to matchmaking list
fi: Palaa matchmaking-listaukseen
fr: Retour à la liste de rapprochement
nl: Terug naar matchmaking-lijst
sv: Tillbaka till matchmaking-lista

source: Do you want to have a similar meeting page? It's easy and works with your calendar.
fi: Haluatko samanlaisen kokoussivun? Käyttöönotto on helppoa ja sivu toimii kalenterisi kanssa.
fr: Voulez-vous avoir une page de rencontre similaire ? C'est facile et ça fonctionne avec votre agenda.
nl: Wilt u een gelijkaardige ontmoetingspagina hebben? Het is makkelijk en het werkt met uw kalender.
sv: Vill du ha en liknande mötessida? Det är enkelt och funkar med din kalender.

source: Claim your free Meet Me page now
fi: Varaa Meet Me -sivusi nyt
fr: Réclamez votre page Me Rencontrer gratuite maintenant
nl: Eis uw gratis ontmoet-me-pagina nu
sv: Gör anspråk på din gratis Möt mig-sida nu

source: Check your inbox to continue
fi: Tarkista sähköpostisi jatkaaksesi
fr: Vérifiez votre boîte de réception pour continuer
nl: Bekijk uw inbox om verder te gaan
sv: Kolla din inkorg för att fortsätta

source: We have sent you an email to %(B$%1$s%) from %(B$info@meetin.gs%).
fi: Lähetimme sinulle sähköpostin osoitteeseen %(B$%1$s%) osoitteestamme %(B$info@meetin.gs%).
fr: Nous vous avons envoyé un e-mail à %(B$%1$s%) venant de %(B$info@meetin.gs%).
nl: We hebben u een e-mail gestuurd naar %(B$%1$s%) van %(B$info@meetin.gs%).
sv: Vi har skickat ett mejl till %(B$%1$s%) från %(B$info@meetin.gs%).

source: Open the email and %(B$confirm your request to meet%) by following the link in the email. If you have not received the email, please check your spam folder.
fi: Avaa sähköpostisi ja %(B$vahvista tapaamispyyntö%) seuraamalla saamassasi sähköpostissa olevaa linkkiä. Jos et näe viestiä, tarkista roskapostilaatikkosi.
fr: Ouvrez l'e-mail et %(B$confirmez votre requête de rencontre%) en cliquant sur le lien dans l'e-mail. Si vous n'avez pas reçu l'e-mail, veuillez vérifier votre dossier de courrier indésirable.
nl: Open de e-mail en %(B$bevestig uw ontmoetingsvraag%) door de link te volgen in de e-mail. Als u de e-mail niet ontvangen hebt, gelieve uw spam-map te bekijken.
sv: Öppna mejlet och %(B$bekräfta din förfrågan att mötas%) genom att följa länken i mejlet. Om du inte har fått mejlet, vänligen kolla din skräppost.

source: You have %(B$24 hours%) to confirm, after which the reservation we're holding will be released to others.
fi: Sinulla on nyt %(B$24 tuntia%) aikaa vahvistaa pyyntösi. Tämän jälkeen tekemäsi varaus vapautuu jälleen muiden saataville.
fr: Vous avez %(B$24 heures%) pour confirmer, après quoi la réservation que nous retenons sera mise à disposition d'autres personnes.
nl: U heeft %(B$24 uur%) om te bevestigen, waarna de reservering aan anderen zal worden vrijgegeven.
sv: Du har %(B$24 timmar%) på dig att bekräfta. Efter det försvinner din bokning och blir tillgänglig för andra.

source: Confirm your registration
fi: Vahvista rekisteröinti
fr: Confirmez votre inscription
nl: Bevestig uw registratie
sv: Bekräfta din registrering

source: Check your email %(B$%1$s%) and follow the instructions on how to complete the registration to the matchmaking.
fi: Tarkista sähköpostisi %(B$%1$s%) ja seuraa sinne lähetettyjä ohjeita viimeistelläksesi rekisteröitymisesi matchmaking-palveluun.
fr: Vérifiez votre e-mail %(B$%1$s%) et suivez les instructions sur comment compléter votre inscription au rapprochement.
nl: Bekijk uw e-mail %(B$%1$s%) en volg de instructies over hoe de registratie voor de matchmaking te vervolledigen.
sv: Kolla din e-post %(B$%1$s%) och följ instruktionerna för hur du slutför registreringen till matchmakingen.

source: The email was sent from %(B$info@meetin.gs%). Be sure to check your junk mail folder in case you did not receive the email.
fi: Viesti on lähetetty osoitteesta %(B$info@meetin.gs%). Mikäli et löydä viestiä sähköpostistasi tarkista, ettei se ole joutunut roskapostiin.
fr: L'e-mail a été envoyé par %(B$info@meetin.gs%). Veuillez vous assurez de vérifier votre dossier de courrier indésirable au cas où vous n'auriez pas reçu le mail.
nl: De e-mail werd gestuurd vanuit %(B$info@meetin.gs%). Bekijk zeker uw junkmailfolder in het geval u de e-mail niet ontvangen hebt.
sv: Mejlet skickades från %(B$info@meetin.gs%). Försäkra dig om att du kollat din skräppost om du inte fått mejlet.

source: Mobile Upload Instructions
fi: Ohjeet tiedostojen lähettämiseen mobiililla
fr: Instructions pour l'envoi par mobile
nl: Instructies voor mobiele upload
sv: Instruktioner för mobil uppladdning

source: You can mail materials to:
fi: Voit lähettää materiaalit sähköpostitse osoitteeseen:
fr: Vous pouvez envoyer des éléments par mail à :
nl: U kunt materialen e-mailen naar:
sv: Du kan e-posta material till:

source: Mail Integration
fi: Sähköposti-integraatio
fr: Intégration au mail
nl: Mail-integratie
sv: Integrering av e-post

source: You can add comments and material by mailing to the meeting's unique address. Text will be added as meeting notes and attachments as meeting materials.
fi: Voit lähettää kommentteja ja kokousmateriaaleja kokouksen yksilölliseen sähköpostiosoitteeseen. Teksti lisätään kokoussivulle muistiinpanoina ja liitetiedostot kokousmateriaaleina.
fr: Vous pouvez ajouter des commentaires et des éléments en envoyant un mail à l'adresse unique de la rencontre. Du texte sera ajouté en tant que notes de réunion et les pièces jointes comme des éléments de réunion.
nl: U kunt commentaren en materiaal toevoegen door naar het enige ontmoetingsadres te mailen. Tekst zal toegevoegd worden als ontmoetingsnota´s en bijlagen als ontmoetingsmaterialen.
sv: Du kan lägga till kommentarer och material genom att e-posta till mötets unika adress. Text kommer att läggas till som mötesanteckningar och bilagor som mötesmaterial.

source: You can join the meeting by sending this email:
fi: Voit liittyä kokoukseen lähettämällä tämän sähköpostin:
fr: Vous pouvez rejoindre la rencontre en envoyant cet e-mail :
nl: U kunt deelnemen aan de ontmoeting door deze e-mail te versturen:
sv: Du kan gå med i mötet genom att skicka detta mejl:

source: To:
fi: Vastaanottaja:
fr: À :
nl: Naar:
sv: Till:

source: Subject:
fi: Aihe:
fr: Sujet :
nl: Onderwerp:
sv: Ämne:

source: JOIN
fi: LIITY
fr: DEVENIR MEMBRE
nl: DEELNEMEN
sv: GÅ MED

source: Easy way for others to invite themselves
fi: Helppo tapa, jolla muut voivat kutsua itsensä
fr: Moyen facile pour les autres de s'inviter eux-mêmes
nl: Een makkelijke manier voor anderen om zichzelf uit te nodigen
sv: Enkelt sätt för andra att bjuda in sig själva

source: Sometimes you don't know the email addresses for all of the people you are meeting with. If you are in the meeting with them, you can just share the meeting email address from above and ask them to send in an email with JOIN %1$s as the subject.
fi: Aina sinulla ei välttämättä ole niiden henkilöiden sähköpostia, jotka haluat tavata. Tällöin voit jakaa muilla keinoin kokouksen sähköpostiosoitteen ja pyytää heitä lähettämään siihen viestin, jonka otsikkona on JOIN %1$s.
fr: Quelques fois vous ne connaissez pas les adresses e-mail de toutes les personnes que vous allez rencontrer. Si vous êtes dans la rencontre avec eux, vous pouvez juste partager l'adresse e-mail de la rencontre ci-dessus et leur demander d'envoyer un e-mail avec REJOINDRE %1$s comme sujet.
nl: Soms kent u de e-mailadressen niet van alle mensen die u ontmoet. Als u met hen op de ontmoeting bent, kunt u gewoon het bovenstaande e-mailadres van de ontmoeting delen en hen vragen een e-mail te sturen met DEELNEMEN %1$s als onderwerp.
sv: Ibland känner du inte till e-postadresserna för alla personer du har möten med. Om du befinner dig i mötet med dem kan du dela mötets e-postadress ovan och be dem skicka ett mejl, med ANSLUT %1$s som ämne.

source: ORGANIZE A MEETING
fi: JÄRJESTÄ KOKOUS
fr: ORGANISER UNE RENCONTRE
nl: ORGANISEER EEN ONTMOETING
sv: ORGANISERA ETT MÖTE

source: Create a New Meeting
fi: Luo uusi tapaaminen
fr: Créer une nouvelle rencontre
nl: Creëer een nieuwe ontmoeting
sv: Skapa ett nytt möte

source: The meeting is over. Do you want to organize a follow-up meeting?
fi: Kokous on ohi. Haluatko järjestää kokoukselle jatkoa?
fr: La rencontre est terminée. Voulez-vous organiser un suivi de rencontre ?
nl: De vergadering is voorbij. Wilt u een follow-up organiseren?
sv: Mötet är över. Vill du organisera ett uppföljningsmöte?

source: Schedule a follow-up
fi: Järjestä jatkokokous
fr: Arranger un suivi
nl: Plan een follow-up
sv: Schemalägg en uppföljning

source: Click "Confirm" to customize and send the confirmation after preparing the meeting page.
fi: Valmistele kokoussivu ja paina "Vahvista". Lopuksi pääset vielä muokkaamaan lähetettävää kutsuviestiä.
fr: Cliquer sur « Confirmer » pour personnaliser et envoyer la confirmation après avoir préparé la page de la rencontre.
nl: Klik op 'bevestigen' om aan te passen en verstuur de bevestiging na het voorbereiden van de ontmoetingspagina.
sv: Klicka på "bekräfta" för att anpassa och skicka bekräftelsen efter förberedande av mötessidan.

source: Click "Ready" to customize and send the invitations after preparing the meeting page.
fi: Valmistele kokoussivu ja paina "Valmis". Pääset vielä muokkaamaan osallistujille lähetettävää kutsua.
fr: Cliquez sur « Prêt » pour personnaliser et envoyer les invitations après avoir préparé la page de la rencontre.
nl: Klik op 'klaar' om aan te passen en verstuur de uitnodigingen na het voorbereiden van de ontmoetingspagina.
sv: Klicka på "klar" för att anpassa och skicka inbjudningar efter förberedelse av mötessidan.

source: You can set the meeting "Ready" after adding at least one participant.
fi: Lisää vähintään yksi osallistuja, jotta voit asettaa kokouksen valmiiksi ja lähettää kutsut.
fr: Vous pouvez afficher la rencontre comme « Prête » après avoir ajouté au moins un participant.
nl: U kunt de ontmoeting op 'klaar' zetten nadat u tenminste één deelnemer hebt toegevoegd.
sv: Du kan göra mötet "klart" efter att du har lagt till minst en deltagare.

source: Draft
fi: Luonnos
fr: Brouillon
nl: Ontwerp
sv: Utkast

source: This meeting is not yet confirmed. Fill in the meeting details and click confirm to proceed.
fi: Kokousta ei ole vielä vahvistettu. Täytä kokouksen tiedot ja paina "vahvista"-painiketta edetäksesi.
fr: Cette rencontre n'est pas encore confirmée. Remplissez les détails de la rencontre et cliquez sur confirmer pour poursuivre.
nl: Deze ontmoeting is nog niet bevestigd. Vul de ontmoetingsdetails in en klik op bevestigen om verder te gaan.
sv: Detta möte är ännu inte bekräftat. Fyll i mötesdetaljerna och klicka på "bekräfta" för att fortsätta.

source: This meeting is a draft. Fill in the meeting details and choose who you want to invite. We will send the invitations after you click ready.
fi: Tämä kokous on luonnos. Täytä kokouksen tiedot ja valitse osallistujat. Kutsut lähetetään kun painat "Valmis"-painiketta.
fr: Cette rencontre est un brouillon. Remplissez les détails de la rencontre et choisissez qui vous voulez inviter. Nous n'enverrons les invitations qu'après que vous cliquiez sur prêt.
nl: Deze ontmoeting is een ontwerp. Vul de ontmoetingsdetails in en kies wie u wilt uitnodigen. We zullen de uitnodigingen opsturen nadat u op klaar hebt geklikt.
sv: Detta möte är ett utkast. Fyll i mötesdetaljerna och välj vem du vill bjuda in. Vi kommer att skicka inbjudningarna först efter att du klickar på "klart".

source: This meeting is a draft. Fill in the meeting details and choose who you want to invite. We will send the invitations only after you are ready.
fi: Tämä kokous on luonnos. Täytä kokouksen tiedot ja valitse osallistujat. Kutsut lähetetään vasta kun olet valmis.
fr: Cette rencontre est un brouillon. Remplissez les détails de la rencontre et choisissez qui vous voulez inviter. Nous n'enverrons les invitations que lorsque vous serez prêt.
nl: Deze ontmoeting is een ontwerp. Vul de ontmoetingsdetails in en kies wie u wilt uitnodigen. We zullen de uitnodigingen opsturen nadat u klaar bent.
sv: Detta möte är ett utkast. Fyll i mötesdetaljerna och välj vem du vill bjuda in. Vi kommer att skicka inbjudningarna först när du är klar.

source: Ready
fi: Valmis
fr: Prêt
nl: Klaar
sv: Klar

source: You need to add people before setting the meeting ready.
fi: Sinun täytyy lisätä osallistujia ennen kuin kokous voidaan asettaa valmiiksi.
fr: Vous devez ajouter des personnes avant d'afficher la rencontre comme prête.
nl: U moet mensen toevoegen vooraleer u de ontmoeting instelt als klaar.
sv: Du måste lägga till personer innan du gör mötet "klart".

source: Are you attending the meeting?
fi: Osallistutko kokoukseen?
fr: Assisterez-vous à la rencontre ?
nl: Volgt u de ontmoeting?
sv: Kommer du att delta i mötet?

source: Attending
fi: Läsnä
fr: Participe
nl: Volgen
sv: Deltar

source: Not attending
fi: Poissa
fr: Ne participera pas
nl: Geen attentie
sv: Deltar inte

source: Can we help you get started?
fi: Voimmeko auttaa sinut alkuun?
fr: Pouvons-nous vous aider à démarrer ?
nl: Kunnen we u helpen om te kunnen beginnen?
sv: Kan vi hjälpa dig att komma igång?

source: Watch tutorial
fi: Katso pikaohjeistus
fr: Regarder le tutoriel
nl: Oefening bekijken
sv: Se handledning

source: Hide forever
fi: Piilota pysyvästi
fr: Cacher définitivement
nl: Voor altijd verbergen
sv: Dölj alltid

source: No notes found.
fi: Yhtään muistiinpanoa ei löydetty.
fr: Pas de notes trouvées.
nl: Geen nota´s gevonden.
sv: Inga anteckningar hittades.

source: Choose a meeting...
fi: Valitse tapaaminen...
fr: Choisissez une rencontre...
nl: Kies een ontmoeting...
sv: Välj ett möte...

source: Remove file
fi: Poista tiedosto
fr: Enlever le fichier
nl: Bestand verwijderen
sv: Ta bort fil

source: Are you sure you want to remove
fi: Oletko varma, että haluat poistaa
fr: Êtes-vous sûr(e) de vouloir retirer
nl: Bent u zeker dat u wilt verwijderen
sv: Är du säker på att du vill ta bort?

source: Confirm remove
fi: Vahvista poistaminen
fr: Confirmer le retrait
nl: Bevestig verwijderen
sv: Bekräfta borttagning

source: Are you sure you want to remove %1$s?
fi: Haluatko varmasti poistaa kokouksen %1$s?
fr: Êtes-vous sûr(e) de vouloir retirer %1$s ?
nl: Bent u zeker dat u %1$s wilt verwijderen?
sv: Är du säker på att du vill ta bort %1$s?

source: Remove document
fi: Poista dokumentti
fr: Retirer le document
nl: Document verwijderen
sv: Ta bort dokument

source: Leave meeting
fi: Poistu kokouksesta
fr: Quitter la rencontre
nl: Ontmoeting verlaten
sv: Lämna möte

source: Are you sure you want to remove yourself from this meeting? You need to be invited to access it again.
fi: Oletko varma, että haluat poistua tästä kokouksesta. Päästäksesi käsiksi kokoukseen liittyviin tietoihin, täytyy jonkun lähettää sinulle uusi kutsu.
fr: Êtes-vous sûr(e) de vouloir vous retirer de cette rencontre ? Vous devrez être invité pour y regagner l'accès.
nl: Bent u zeker dat u zichzelf wilt verwijderen uit deze ontmoeting? U moet worden uitgenodigd om opnieuw toegang te krijgen.
sv: Är du säker på att du vill ta bort dig själv från detta möte? Du måste bjudas in för att komma åt det igen.

source: No
fi: Ei
fr: Non
nl: Nee
sv: Nej

source: Rename Material
fi: Nimeä materiaali uudelleen
fr: Renommer l'élément
nl: Andere naam geven aan materiaal
sv: Byt namn på material

source: Rename
fi: Nimeä uudelleen
fr: Renommer
nl: Andere naam geven
sv: Byt namn

source: Rename Document
fi: Uudelleennimeä dokumentti
fr: Renommer le document
nl: Andere naam geven aan document
sv: Byt namn på dokument

source: Replace Material
fi: Korvaa materiaali
fr: Remplacer l'élément
nl: Materiaal vervangen
sv: Ersätt material

source: Choose a file from your computer
fi: Valitse tiedosto tietokoneeltasi
fr: Choisissez un fichier depuis votre ordinateur
nl: Kies een bestand uit uw computer
sv: Välj en fil från din dator

source: Replacing the material will retain all the associated comments.
fi: Korvatessasi materiaalin toisella, kaikki siihen liittyvät kommentit säilyvät.
fr: Remplacer l'élément conservera tous les commentaires associés.
nl: Door het materiaal te vervangen, zullen alle geassocieerde commentaren behouden blijven.
sv: Alla associerade kommentarer kommer att finnas kvar när materialet byts ut.

source: RSVP status
fi: RSVP:n tila
fr: Statut RSVP

source: Confirm changes
fi: Vahvista muutokset
fr: Confirmer les changements
nl: Veranderingen bevestigen
sv: Bekräfta ändringar

source: We'll notify everyone about the changed time.
fi: Ilmoitamme osallistujille muuttuneesta ajasta.
fr: Nous préviendrons tout le monde des changements d'horaires.
nl: We zullen iedereen inlichten over het gewijzigde tijdstip.
sv: Vi meddelar alla om den ändrade tiden.

source: Ask participants to RSVP again?
fi: Pyydä osanottajien RSVP uudestaan?
fr: Demander à nouveau aux participants de bien vouloir confirmer leur présence ?
nl: Vraag deelnemers opnieuw om een RSVP?
sv: Be deltagarna att svara igen?

source: Note that we'll clear the old answers if you ask for new RSVP.
fi: Huomioi, että hävitämme vanhat vastaukset mikäli pyydät RSVP:n uudestaan.
fr: Sachez que nous effacerons les anciennes réponses si vous souhaitez une nouvelle demande de confirmation de présence.
nl: Let op dat we de oude antwoorden wissen als u om een nieuw RSVP vraagt.
sv: Observera att vi rensar alla gamla svar om du ber om nya svar

source: Date and time settings
fi: Aikatauluasetukset
fr: Réglages de la date et de l'heure
nl: Datum- en tijdsinstellingen
sv: Datum- och tidsinställningar

source: OR
fi: TAI
fr: OU
nl: OF
sv: ELLER

source: Manage scheduling options
fi: Hallinnoi aikatauluehdotuksia
fr: Gérer les options de planification
nl: Beheer planningsopties
sv: Hantera alternativ för schemaläggning

source: Date locked
fi: Päivämäärä lukittu
fr: Date verrouillée
nl: Datum vergrendeld
sv: Låst datum

source: This is meeting is linked to a matchmaking event.
fi: Tämä kokous on
fr: Ce rendez-vous est lié à un événement de mise en relation.
nl: Deze vergadering is gekoppeld aan een matchmaking evenement
sv: Det här mötet är länkat till ett matchmakingevent.

source: Choose the Meeting Location
fi: Valitse kokouspaikka
fr: Choisissez le lieu du rendez-vous
nl: Kies de ontmoetingslocatie
sv: Välj mötesplats

source: Do you need a physical meeting space near %1$s (%(L$change%))? Here are a few options:
fi: Tarvitsetko fyysisen tapaamistilan lähellä kaupunkia %1$s (%(L$vaihda%))? Tässä muutamia vaihtoehtoja:
fr: Avez-vous besoin d'un lieu de rendez-vous physique près de %1$s (%(L$changer%))? Voici quelques options :
nl: Hebt u een fysieke ontmoetingsplaats nodig dichtbij %1$s (%(L$veranderen%))? Hier zijn enkele opties:
sv: Behöver du en fysisk plats för mötet nära %1$s (%(L$ändra%))? Här är några alternativ:

source: Skip
fi: Ohita
fr: Passer
nl: Overslaan
sv: Hoppa över

source: Location locked
fi: Sijainti lukittu
fr: Lieu verrouillé
nl: Locatie gesloten
sv: Låst plats

source: Set Title
fi: Aseta otsikko
fr: Régler le titre
nl: Titel instellen
sv: Skriv rubrik

source: Download vCard
fi: Lataa vCard
fr: Télécharger une vCard
nl: vCard downloaden
sv: Ladda ner vCard

source: Looking a bit empty here. Fill out your profile so others know who you are.
fi: Profiilisi näyttää melko tyhjältä. Täytä se, jotta muut näkevät kuka olet.
fr: Ça à l'air un peu vide par ici. Remplissez votre profil pour que les autres sachent qui vous êtes.
nl: Het zier er hier nogal leeg uit. Vul uw profiel in zodat anderen weten wie u bent.
sv: Det ser lite tomt ut här. Fyll i din profil så andra vet vem du är.

source: Fill profile
fi: Täydennä profiili
fr: Remplir le profil
nl: Profiel invullen
sv: Fyll i profil

source: Options
fi: Asetukset
nl: Opties
sv: Alternativ

source: Send updates through email for this meeting
fi: Lähetä päivityksiä kokoukseen sähköpostitse
fr: Envoyer des mises à jour pour cette rencontre via e-mail
nl: Stuur voor deze ontmoeting updates via e-mail
sv: Skicka uppdateringar via e-post för detta möte

source: Manage
fi: Hallinnoi
fr: Gérer
nl: Beheren
sv: Ha hand om

source: Participant can manage this meeting?
fi: Saako tämä osallistuja hallinnoida kokousta?
fr: Le participant peut gérer cette rencontre ?
nl: Kan deze deelnemer de ontmoeting leiden?
sv: Deltagare kan sköta detta möte?

source: Resend invite
fi: Lähetä kutsu uudelleen
fr: Renvoyer une invitation
nl: Uitnodiging opnieuw opsturen
sv: Skicka inbjudan på nytt

source: Remove participant
fi: Poista osallistuja
fr: Enlever un participant
nl: Deelnemer verwijderen
sv: Ta bort deltagare

source: New meeting
fi: Uusi tapaaminen
fr: Nouveau rendez-vous
nl: Nieuwe ontmoeting
sv: Nytt möte

source: Welcome to Your Meeting Page
fi: Tervetuloa kokoussivullesi
fr: Bienvenue sur votre Page Rendez-vous
nl: Welkom op jouw ontmoetingspagina
sv: Välkommen till ditt mötessidan

source: This is where you collaborate around the meeting. Start from scratch or use an existing calendar event as a foundation for the meeting:
fi: Kaikki yksittäiseen tapaamiseen liittyvä tieto ja materiaali taltioidaan tänne. Valitse luodaanko uusi kokous tyhjästä vai olemassaolevan kalenterimerkinnän pohjalta.
fr: C'est ici que vous collaborez autour du rendez-vous. Démarrez de zéro ou utilisez un agenda d'événement existant comme base pour le rendez-vous :
nl: Dit is waar je samenwerkt met betrekking tot de ontmoeting. Start vanaf het begin of gebruik een bestaand kalenderevenement als basis voor de ontmoeting:
sv: Här samarbetar ni kring mötet. Starta från grunden eller använd en befintlig kalenderhändelse som grund för mötet:

source: Blank meeting
fi: Tyhjä kokous
fr: Rendez-vous vide
nl: Lege ontmoeting
sv: Tomt möte

source: Copy from calendar
fi: Kopioi kalenterista
fr: Copier depuis l'agenda
nl: Kopieer van kalender
sv: Kopiera från kalender

source: Welcome to the meeting page. Can we help you get started?
fi: Tervetuloa kokoussivulle. Voimmeko auttaa sinut alkuun?
fr: Bienvenue sur la page de rencontre. Pouvons-nous vous aider à démarrer ?
nl: Welkom op de ontmoetingspagina. Kunnen we u helpen om te beginnen?
sv: Välkommen till mötessidan. Kan vi hjälpa dig att komma igång?
