Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_back-*.po
Languages: fi, fr, nl, sv

source: New time suggestions are waiting for your reply. You can respond on the meeting page.
fi: Uudet aikatauluehdotukset odottavat vastaustasi. Vastaa helposti kokoussivulla.
fr: De nouvelles suggestions d'horaires sont en attente de réponse de votre part. Vous pouvez répondre sur la page réunion.
nl: Nieuwe tijdsuggesties wachten op je antwoord. Je kan antwoorden op de vergaderpagina.
sv: Nya förslag om tidpunkter väntar på ditt svar. Du kan svara på mötets hemsida.

source: Unanswered times:
fi: Ajankohdat, joihin et ole vastannut:
fr: Les horaires non renseignés :
nl: Onbeantwoorde tijden:
sv: Ej besvarade tidpunkter:

source: Unanswered time:
fi: Vastaamaton ehdotus:
fr: Temps sans réponse :
nl: Onbeantwoorde tijd:
sv: Obesvarad tid:

source: Answer now
fi: Vastaa nyt
fr: Répondez maintenant
nl: Antwoord nu
sv: Svara nu

source: %(B$Tip:%) To respond by email, reply to this message with the word SCHEDULE.
fi: %(B$Vinkki:%) Voit vastata sähköpostitse lähettämällä tähän viestiin vastauksen, jossa lukee sana SCHEDULE.
fr: %(B$Conseil:%) Pour donner votre réponse par e-mail, répondez à ce message en indiquant le mot SCHEDULE.
nl: %(B$Tip:%) om te antwoorden per email, antwoord op dit bericht met het woord SCHEDULE.
sv: %(B$Tip:%) Besvara meddelandet med SCHEDULE för att svara via e-post.

source: New scheduling options:
fi: Uusia aikaehdotuksia:
fr: Nouvelles options de planification :
nl: Nieuwe plan opties:
sv: Nya alternativ för tidsplanering.

source: New scheduling option:
fi: Uusia aikaehdotuksia:
fr: Nouvelle option de planification :
nl: Nieuwe planning optie:
sv: Nya alternativ för schemaläggning:

source: Your scheduling response for
fi: Aikatauluvastauksesi liitttyen kokoukseen
fr: Votre réponse pour l'événement planifié
nl: Uw antwoord op de planning voor
sv: Ditt svar beträffande tidpunkten för

source: This is what we have received so far:
fi: Tähän mennessä saamamme vastaukset:
fr: Voici ce que nous avons reçu jusqu'à présent :
nl: Dit is wat we tot nog toe hebben ontvangen
sv: Detta är vad vi fått hittills

source: You still have one unanswered suggestion.
fi: Sinulla on edelleen yksi vastaamaton aikaehdotus.
fr: Vous avez encore %1$s de suggestions sans réponse.
nl: Je hebt nog %1$s onbeantwoorde voorstellen.
sv: Du har fortfarande %1$s obesvarade förslag.

source: To respond by email, reply to this message with the word SCHEDULE.
fi: Vastaa aikatauluehdotuksiin sähköpostitse vastaamalla tähän viestiin sanalla SCHEDULE
fr: Pour donner votre réponse par e-mail, veuillez répondre à ce message en indiquant le mot PLANIFICATION.
nl: Om te antwoorden per email, antwoord op dit bericht met het woord SCHEDULE.
sv: För att svara via e-post, besvara detta meddelande med ordet SCHEDULE.

source: Confirmation: Your scheduling response received
fi: Vahvistus: Saimme vastauksesi
fr: Confirmation : Vos réponses sur la programmation ont été reçues
nl: Bevestiging: Je antwoorden op de planning ontvangen
sv: Bekräftelse: Vi har tagit emot dina svar beträffande tidsplaneringen.

source: Time is set for
fi: Kokouksen aika on jo asetettu
fr: L'horaire est fixé à
nl: De tijd is vastgesteld op
sv: Tidpunkten har fastställts för

source: You already responded scheduling for
fi: Olet jo vastannut aikaehdotuksiin
fr: Vous avez déjà répondu pour un événement planifié le
nl: U heeft al geantwoord tijdens het plannen van
sv: Du har redan svarat beträffande tidsplaneringen för

source: No open scheduling options for
fi: Ei avoimia ehdotuksia kokoukselle
fr: Pas d'options de planification ouverte pour
nl: Geen open plan opties voor
sv: Inga öppna alternativ beträffande tidpunkter för

source: The meeting will be on %(B$%1$s%)
fi: Kokous järjestetään %(B$%1$s%)
fr: La réunion se tiendra le %(B$%1$s%)
nl: De vergadering zal om %(B$%1$s%) zijn.
sv: Tidpunkten för mötet är den %(B$%1$s%)

source: To change your answers by email, reply RESCHEDULE to this message. You also can do this on the meeting page.
fi: Voit muuttaa vastauksiasi sähköpostitse vastaamalla tähän viestiin sanalla RESCHEDULE. Voit tehdä muutokset myös kokoussivulta käsin.
fr: Pour modifier vos réponses par e-mail, répondez à ce message en indiquant RESCHEDULE. Il est également possible d'effectuer cette opération sur la page réunion.
nl: Antwoord RESCHEDULE op dit bericht om uw antwoorden te wijzigen. U kunt dit ook op de vergaderpagina doen.
sv: För att ändra ditt svar via e-post, besvara detta meddelande med RESCHEDULE. Du kan även ändra svaret på mötets hemsida.

source: The time suggestions for %1$s haven't been set up yet, or the meeting organizer has removed all the previous times.
fi: Aikaehdotuksia kokoukselle %1$s ei ole vielä asetettu tai kokouksen järjestäjä on poistanut kaikki aiemmat ehdotukset.
fr: Les suggestions de date pour %1$s n'ont pas encore été fixées, ou l'organisateur de la réunion a supprimé toutes les dates antérieures.
nl: De tijdsuggesties voor %1$s zijn niet ingesteld, of de organisator van de vergadering heeft alle voorgaande tijden verwijderd.
sv: Tidsrekommendationerna för %1$s har inte ställts in än eller så har mötesanordnaren tagit alla tidigare tider.

source: The time for %1$s has been already set
fi: Kokoukselle %1$s on jo asetettu aika
fr: L'horaire pour %1$s est déjà fixé.
nl: De tijd voor %1$s is al ingesteld.
sv: Tidpunkten för %1$s är redan fastställd

source: No new scheduling options for %1$s
fi: Ei uusia ehdotuksia kokouksen %1$s ajaksi
fr: Pas d'options de planification pour %1$s
nl: Geen nieuwe planning opties voor %1$s
sv: Inga nya schemaalternativ för %1$s

source: No scheduling options for %1$s
fi: Ei aikatauluehdotuksia kokoukselle %1$s
fr: Pas d'options de planification pour %1$s
nl: Geen planning opties voor %1$s.
sv: Inga schemaalternativ för %1$s

source: Scheduling option for
fi: Aikataulutus kokoukselle
fr: Option de planification pour
nl: Plan optie voor
sv: Vald schemaläggning för

source: Your previous answer:
fi: Edellinen vastauksesi:
fr: Votre réponse précédente :
nl: Uw vorige antwoord:
sv: Ditt förra svar

source: To change your answer, reply to this message with either YES or NO depending on your availability. If you don't want to change it, don't do anything.
fi: Voit vaihtaa vastaustasi lähettämällä paluuviestissä sanan YES tai NO. Mikäli et halua muuttaa vastaustasi, älä reagoi viestiin mitenkään.
fr: Pour modifier votre réponse, répondez à ce message par OUI ou NON en fonction de votre disponibilité. Si vous ne souhaitez pas la modifier, aucune action de votre part n'est requise.
nl: Om uw antwoord te wijzigen, beantwoord u deze boodschap met een JA of een NEE, afhankelijk van uw beschikbaarheid. Als u het niet wil wijzigen doet u niets.
sv: För att ändra ditt svar, besvara detta meddelande antingen JA eller NEJ enligt din tillgänglighet. Om du inte vill ändra svaret, gör ingenting.

source: Or manage your answers on the meeting page.
fi: Voit myös hallinnoida vastauksiasi suoraan kokoussivulla.
fr: Ou gérez vos réponses sur la page réunion.
nl: Of beheer uw antwoorden op de vergaderpagina.
sv: Eller hantera dina svar på mötets hemsida.

source: %1$s rescheduling: is %2$s ok for you?
fi: Etsitään uutta aikaa kokoukselle %1$s: Sopiiko sinulle %2$s?
fr: Modification de la planification de %1$s : est-ce que %2$s vous convient ?
nl: herplanning van %1$s: Is %2$s geschikt voor u?
sv: Ändring av tidsplanen för %1$s. Går %2$s bra för dig?

source: %1$s scheduling: is %2$s ok for you?
fi: Etsitään aikaa kokoukselle %1$s: Sopiiko sinulle %2$s?
fr: Programmation de %1$s : est-ce que %2$s vous convient ?
nl: Planning van %1$s: is dit voor u?
sv: Tidsplanering för %1$s: passar %2$s bra för dig?

source: Scheduling reminder for
fi: Muistutus tapaamisen aikataulutuksesta:
fr: Rappel de planification pour
nl: Herinnering inplannen om
sv: Påminnelse om schemaläggning för

source: Don't forget to inform others about your availability.
fi: Älä unohda ilmoittaa muille sinulle sopivia aikoja.
fr: N'oubliez pas d'informer les autres de votre disponibilité.
nl: Vergeet niet anderen over uw beschikbaarheid te informeren.
sv: Glöm inte att informera andra om din tillgänglighet.

source: Does this time suit you?
fi: Sopiiko tämä aika sinulle?
fr: Ces horaires vous conviennent-ils ?
nl: Komen deze tijden je uit?
sv: Passar dessa tidpunkter dig?

source: Reminder: help to schedule %1$s
fi: Muistutus: auta löytämään aika kokoukselle %1$s
fr: Rappel : contribuez à planifier %1$s
nl: Herinnering: help om %1$s in te plannen.
sv: Påminnelse: hjälp med att schemalägga %1$s

source: Unfortunately we could not process the meeting invitation sent to %1$s
fi: Valitettavasti emme voineet käsitellä sähköpostiosoitteeseen %1$s lähetettyä kutsua
fr: Nous n'avons pas pu traiter l'invitation à la réunion envoyée à %1$s
nl: Helaas konden we de uitnodiging om te vergaderen die is verstuurd naar %1$s niet verwerken.
sv: Tyvärr kunde vi inte behandla mötesinbjudningen som skickades till %1$s

source: The invite didn't contain adequate information for creating a meeting.
fi: Kutsu ei sisältänyt riittävästi tietoa, jotta kokous olisi voitu luoda.
fr: L'invitation ne contenait pas d'informations adéquates pour créer une réunion.
nl: De uitnodiging bevatte onvoldoende informatie om een vergadering aan te maken.
sv: Inbjudningen innehöll inte tillräcklig information för att ett möte skulle kunna skapas.

source: Please contact our support if the problem persists.
fi: Ole yhteydessä tukeen, mikäli ongelma ei häviä.
fr: Veuillez contacter notre service assistance si le problème persiste.
nl: Neem contact op met onze beheerafdeling als het probleem blijft bestaan.
sv: Kontakta vår support om problemet kvarstår.

source: Problems processing the meeting invitation
fi: Ongelma kokouskutsun käsittelyssä
fr: Il y a des problèmes dans le traitement de l'invitation à la réunion
nl: Problemen met het verwerken van de uitnodiging voor de vergadering.
sv: Det har uppstått problem med behandlingen av din mötesinbjudan.

source: Unfortunately we could not process the meeting invitation sent to %1$s. We could not find the ICS calendar data in your email.
fi: Valitettavasti emme voineet käsitellä sähköpostiosoitteeseen %1$s lähetettyä kutsua. Emme löytäneet ICS-kalenteritietoa sähköpostiviestistäsi.
fr: Nous n'avons malheureusement pas été en mesure de traiter l'invitation à la réunion envoyée à %1$s. Nous n'avons pas trouvé les données du calendrier ICS dans votre e-mail.
nl: Helaas konden we de uitnodiging voor vergadering die is verstuurd naar %1$s niet verwerken. We konden de ICS agendagegevens niet vinden in uw email.
sv: Tyvärr kunde vi inte behandla mötesinbjudningen som skickats till %1$s. Vi kunde inte hitta några kalenderdata i ICS-format i ditt e-postmeddelande.

source: Problem with your meeting invitation
fi: Kokouskutsussasi ilmeni ongelma
fr: Il y a un problème avec l'invitation à la réunion
nl: Probleem met uw uitnodiging voor vergadering
sv: Problem med din mötesinbjudan

source: Unfortunately we could not process the meeting invitation sent to %1$s.
fi: Valitettavasti emme voineet käsitellä sähköpostiosoitteeseen %1$s lähetettyä kutsua.
fr: Nous n'avons malheureusement pas pu traiter l'invitation à la réunion envoyée à %1$s .
nl: Helaas konden we de uitnodiging voor de vergadering die is verstuurd aan %1$s niet verwerken.
sv: Tyvärr kunde vi inte behandla mötesinbjudningen som skickats till %1$s

source: Meetin.gs could not parse the calendar file contained in your email.
fi: Meetin.gs ei pystynyt käsittelemään lähettämässäsi sähköpostissa ollutta kalenterimerkintää.
fr: Meetin.gs n'a pas pu lire le fichier calendrier joint à votre e-mail.
nl: Meetin.gs kon het agendabestand in uw email niet ontleden.
sv: Meetin.gs kunde inte tolka kalenderfilen som fanns i ditt e-postmeddelande.

source: It seems that you don't have a Meetin.gs account yet. Please click below to sign up and start having awesome meetings now.
fi: Näyttää siltä, että sinulla ei ole vielä Meetin.gs-tiliä. Kirjaudu palveluun heti, säästä aikaa ja vaivaa järjestämällä tehokkaampia ja laadukkaampia kokouksia.
fr: Il semble que vous n'ayez pas encore de compte Meetin.gs. Veuillez cliquer ci-dessous dès maintenant afin de vous enregistrer et commencer à organiser de supers réunions.
nl: Het lijkt er op dat u nog geen Meetin.gs account heeft. Klik alstublieft hieronder om in te schrijven en begin met het houden van geweldige vergaderingen.
sv: Det verkar som om du inte har något konto på Meetin.gs ännu. Var snäll och klicka här nedan för att registrera dig och börja sammankalla möten nu.

source: Sign up
fi: Rekisteröidy
fr: Inscrivez-vous
nl: Lid worden
sv: Registrera dig

source: Here's your login link to Meetin.gs. Keep in mind, that this link is personal. You can use it whenever you need to login. If you lose it, you can request a new link from our site
fi: Tässä on kirjautumislinkkisi Meetin.gs-palveluun. Huomioi, että tämä linkki on henkilökohtainen. Pidä huolta ettei se joudu muiden haltuun. Mikäli hukkaat kirjautumislinkin, voit aina pyytää uuden verkkosivuiltamme.
fr: Voici le lien de votre identifiant sur Meetin.gs. Rappelez-vous que ce lien est personnel. Vous pouvez l'utiliser dès que vous souhaitez vous connecter. Si vous le perdez, vous pouvez demander un nouveau lien depuis notre site
nl: Hier is uw link om in te loggen op Meetin.gs. Onthoud dat deze link persoonlijk is. U kunt het gebruiken wanneer u maar wilt om in te loggen. Als u het kwijt raakt, kunt u op onze site een nieuwe link aanvragen.
sv: Här är din Inloggningslänk till Meetin.gs. Kom ihåg, att denna länk är personlig. Du kan använda den när du behöver logga in. Om du förlorar det, kan du begära en ny länk från vår webbplats

source: A few suggestions on what to do next to get the most out of the service, improve your productivity and get meetings done:
fi: Tässä muutama ehdotus, joiden avulla saat palvelustamme mahdollisimman suuren hyödyn ja parannat kokoustesi tehokkuutta:
fr: Quelques suggestions sur ce que vous pouvez faire maintenant pour profiter de tous les avantages du service, améliorer votre productivité et effectuer des réunions :
nl: Enkele suggesties hoe u het meeste uit onze dienst kan halen, uw productiviteit kan verhogen en vergaderingen gedaan kan krijgen.
sv: Några förslag på vad du kan göra härnäst för att få ut det mesta av tjänsten, förbättra produktiviteten och ha möten:

source: Keep track of meetings while on the move:
fi: Pysy kärryillä kokouksistasi ollessasi liikkeellä:
fr: Continuez à suivre vos réunions lors de vos déplacements :
nl: Blijf onderweg op de hoogte van vergaderingen:
sv: Håll koll på möten på rörlig fot:

source: %(B$Manage meetings right on your browser%) and schedule meetings with people on LinkedIn and more - Install the %(L$Chrome extension%)
fi: %(B$Hallinnoi kokouksia suoraan selaimestasi%) ja sovi tapaamisia ihmisten kanssa suoraan Linkedinistä, Gmailista ja muista suosituista palveluista asentamalla %(L$Chrome lisäosa%)
fr: %(B$Gérez les réunions sur votre navigateur%) et organisez des réunions avec des gens sur LinkedIn et plus - Installez l'%(L$extension Chrome%)
nl: %(B$Beheer vergaderingen direct in je browser%) en plan vergaderingen met mensen op LinkedIn en meer. Installeer de %(L$Chrome extensie%).
sv: %(B$Hantera möten direkt i din webbläsare%) och schemalägg möten med personer på LinkedIn och mer - Installera %(L$Chrome-tillägget%)

source: %(B$Save time scheduling meetings%) - Share your %(L$Meet Me page%)
fi: %(B$Säästä kokousjärjestelyihin tuhlaantuvaa aikaa%) jakamalla %(L$Meet Me -sivusi%)
fr: %(B$Passez moins de temps à programmer les réunions%) - Partagez votre%(L$page Rencontrez-Moi%)
nl: %(B$Bespaar tijd met vergaderingen plannen%) - Deel uw %(L$introductiepagina%)
sv: %(B$Spara tid på att schemalägga möten%) - Dela din %(L$Möt mig-sida%)

source: Meetin.gs: login information and next steps
fi: Meetin.gs: Sisäänkirjautuminen ja seuraavat askeleet
fr: Meetin.gs : informations de connexion et prochaines étapes
nl: Meetin.gs informatie over inloggen en volgende stappen:
sv: Meetin.gs: inloggningsinformation och nästa steg

source: Important changes to
fi: Tärkeitä muutoksia kokoukseen
fr: Des modifications importantes sur
nl: Belangrijke wijzigingen aan
sv: Viktiga ändringar av

source: The meeting time has been set.
fi: Tapaamisaika on asetettu.
fr: L'horaire de la réunion a été fixé.
nl: Het tijdstip van de vergadering is vastgesteld
sv: Tidpunkten för mötet har fastställts.

source: The meeting has new time - update your calendar.
fi: Tapaamisaika on asetettu. Aika päivittää kalenterimerkintäsi.
fr: L'horaire de la réunion a été modifié - mettez votre calendrier à jour.
nl: De vergadering heeft een nieuwe tijd. Werk uw agenda bij.
sv: Tidpunkten för mötet har ändrats - uppdatera din kalender.

source: The meeting time has been set - update your calendar.
fi: Tapaamisaika on asetettu. Aika päivittää kalenterimerkintäsi.
fr: La réunion a été fixée - mettez à jour votre calendrier.
nl: De vergadertijd is ingesteld. Werk uw agenda bij.
sv: Tidpunkten för mötet är fastställd - uppdatera din kalender.

source: The meeting time has been removed.
fi: Tapaamisen aika on poistettu.
fr: L'horaire de cette réunion à été supprimé.
nl: De vergadertijd is verwijderd.
sv: Mötet har tagits bort

source: Attention: Your RSVP required for %1$s
fi: Huomio: RSVP vaaditaan kokoukselle %1$s
fr: Attention : votre réponse est requise pour %1$s
nl: Let op: uw bevestiging is benodigd voor %1$s
sv: OBS: Du måste besvara inbjudan till %1$s

source: Attention: Time has been updated for %1$s
fi: Huomio: Kokouksen %1$s aika on muutettu
fr: Attention : La date pour %1$s a été mise à jour
nl: Attentie: De tijd voor %1$s is bijgewerkt.
sv: Observera: Tidpunkten för %1$s har ändrats.

source: Attention: Time has been set for %1$s
fi: Huomio: Kokouksen %1$s aika on asetettu
fr: Attention : Date a été fixée pour %1$s
nl: Attentie: De tijd is ingesteld voor %1$s
sv: OBS! Tidpunkten har fastställts för %1$s

source: Attention: Time has been removed from %1$s
fi: Huomio: Kokouksen %1$s ajankohta on poistettu
fr: Attention : Date a été enlevée de %1$s
nl: Attentie: De tijd is van %1$s verwijderd.
sv: OBS: Tidpunkten har tagits bort från %1$s

source: Your PRO trial is expiring soon
fi: PRO koekäyttöjaksosi päättyy pian
fr: Votre version PRO d'essai expire bientôt
nl: Uw proefperiode voor PRO zal binnenkort aflopen.
sv: Din PRO provperiod går snart ut

source: Your PRO trial is expiring tomorrow
fi: PRO koekäyttöjaksosi päättyy huomenna
fr: Votre version PRO d'essai expire demain
nl: Uw proefperiode voor PRO eindigt morgen.
sv: Din PRO-provperiod går ut imorgon

source: Meetin.gs PRO trial just expired
fi: Meetin.gs PRO koekäyttöjaksosi päättyi
fr: Version d'essai Meetin.gs PRO vient d'expirer
nl: De proefperiode voor Meetin.gs PRO is zojuist afgelopen.
sv: Meetin.gs. PRO provperioden gick precis ut

source: %(B$After %1$s%) your account will be downgraded to the limited version.
fi: %(B$%1$s jälkeen%) tilisi palautetaan takaisin maksuttomaan versioon.
fr: %(B$Après %1$s%) votre compte sera déclassé à la version limitée.
nl: %(B$Na %1$s%) zal uw account naar de beperkte versie worden bijgesteld.
sv: %(B$Efter %1$s%) kommer ditt konto degraderas till den begränsade versionen.

source: %(B$Your trial with Meetin.gs PRO will expire tomorrow.%) Your account will be downgraded to the limited version.
fi: %(B$Meetin.gs PRO koekäyttösi päättyy huomenna.%) Käyttäjätilisi palautuu automaattisesti takaisin rajattuun ilmaisversioon.
fr: %(B$Votre essai Meetin.gs PRO expire demain.%) Votre compte sera rétrogradé à la version limitée.
nl: %(B$Uw proefperiode met Meetin.gs PRO zal morgen aflopen.%) Uw account zal naar de beperkte versie worden bijgesteld.
sv: %(B$Din provperiod med Meetin.gs PRO kommer att gå ut imorgon.%) Ditt konto kommer att degraderas till den begränsade versionen.

source: %(B$Your trial with Meetin.gs PRO has expired%) and your account has been downgraded to the limited version.
fi: %(B$Meetin.gs PRO koekäyttösi on päättynyt%) ja käyttäjätilisi on palautettu rajattuun ilmaisversioon.
fr: %(B$Votre essai Meetin.gs PRO a expiré%) et votre compte a été rétrogradé à la version limitée.
nl: %(B$Uw proefperiode met Meetin.gs PRO is afgelopen%) en uw account is gedegradeerd naar de beperkte versie.
sv: %(B$Din provperiod med Meetin.gs PRO har gått ut%) och ditt konto degraderats till den begränsade versionen.

source: Upgrade now
fi: Päivitä nyt
fr: Mettez à jour maintenant
nl: Nu upgraden
sv: Uppgradera nu

source: Upgrade Meetin.gs now to secure a seamless transition after your trial ends. We will give you free credit for the time you have left on your trial.
fi: Päivitä Meetin.gs tilisi varmistaaksesi palvelun saumattoman jatkumisen koekäyttöjaksosi jälkeen. Annamme sinulle jäljellä olevaa kokeäyttöjaksoasi vastaavan ajan veloituksetta.
fr: Mettez maintenant Meetin.gs à jour pour vous assurer une transition homogène lorsque votre version d'essai aura expiré. Nous vous offrirons du crédit pour compenser le temps qu'il vous restait sur la version d'essai.
nl: Upgrade Meetin.gs nu om een ​​naadloze overgang te garanderen nadat de proefperiode eindigt. Wij zullen u gratis krediet geven voor de tijd die u nog hebt in de proefperiode.
sv: Uppgradera Meetin.gs nu för att säkra en sömlös övergång efter att din utvärdering tagit slut. Vi kommer att ge dig gratis krediter för tiden som du har kvar på din utvärdering.

source: What's included in Meetin.gs PRO?
fi: Mitä saat hankkiessasi Meetin.gs PRO:n?
fr: Que contient Meetin.gs PRO ?
nl: Wat is er inbegrepen bij Meetin.gs PRO?
sv: Vad ingår i Meetin.gs PRO?

source: Unlimited meeting schedulers.
fi: Rajaton määrä tapaamiskalentereita.
fr: Un nombre illimité d'organisateurs de réunions.
nl: Onbegrensde vergaderingplanners
sv: Obegränsade mötesschemaläggare.

source: Expanded live communication tools.
fi: Laajennettu valikoima etätyökaluja.
fr: Des outils de communication en direct étendus.
nl: Uitgebreide live communicatie-instrumenten.
sv: Utökade kommunikationsverktyg

source: Visual customization and branding.
fi: Ulkoasun muokkaus ja kokoussivujen brändääminen.
fr: Personnalisation visuelle et image de marque.
nl: Visueel maatwerk en huisstijl.
sv: Visuell anpassning och branding.

source: Unlimited meeting participants.
fi: Rajaton määrä osallistujia.
fr: Un nombre de participants par réunion illimité.
nl: Onbegrensd aantal deelnemers aan de vergadering
sv: Obegränsade mötesdeltagare.

source: Unlimited meeting materials.
fi: Rajoittamattomat kokousmateriaalit.
fr: Un nombre de documents de réunion illimité.
nl: Onbegrensde vergadermaterialen.
sv: Obegränsat med mötesmaterial.

source: ...and more.
fi: ...ja muita ominaisuuksia.
fr: …et plus.
nl: ...en meer.
sv: ...och mer.

source: For the full description of features take a look at our %(L$plans and pricing%)
fi: Täysi kuvaus toiminnallisuuksista löytyy kotisivumme %(L$plans and pricing%) -osiosta (englanniksi).
fr: Pour obtenir la description complète des fonctionnalités, faites un tour sur nos %(L$abonnements et tarifs%)
nl: Bekijk onze %(L$plannen en tarifering%) voor een volledige beschrijving van kenmerken.
sv: För en fullständig beskrivning av funktioner ta en titt på vår %(L$planer och prissättning%)

source: Your Meetin.gs trial is about to expire
fi: Meetin.gs PRO koekäyttösi lähenee loppuaan
fr: Votre essai Meetin.gs est sur le point de se terminer
nl: Uw Meetin.gs proefperiode loopt bijna af.
sv: Din Meetin.gs provperiod håller på att ta slut

source: Meetin.gs pro trial will expire tomorrow
fi: Meetin.gs PRO koekäyttöjakso päättyy huomenna
fr: Votre essai Meetin.gs pro expire demain
nl: De proefperiode van Meetin.gs zal morgen aflopen.
sv: Meetin.gs pro provperiod går ut imorgon
