Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_back-*.po
Languages: fi, fr, nl, sv

source: Website
fi: Verkkosivu
fr: Site internet
sv: Webbsida

source: Category
fi: Kategoria
fr: Catégorie
nl: Categorie
sv: Kategori

source: Country
fi: Maa
fr: Pays
nl: Land
sv: Land

source: Founded
fi: Perustettu
fr: Créé
nl: Opgericht
sv: Grundat

source: Revenue (USD)
fi: Liikevaihto (USD)
fr: Revenu (USD)
nl: Inkomsten (Amerikaanse dollar)
sv: Intäkter (USD)

source: Funding raised
fi: Nostettu rahoitus
fr: Fonds collectés
nl: Aangeworven financiering
sv: Erhållna bidrag

source: Funding we are looking for
fi: Hakemamme rahoitus
fr: Les financements que nous recherchons
nl: Financiering die we zoeken
sv: Bidrag vi söker

source: # of employees
fi: Työntekijöiden määrä
fr: # d'employés
nl: # werknemers
sv: # anställda

source: Mainly looking for
fi: Haemme pääosin
fr: Principalement à la recherche de
nl: Hoofdzakelijk we zoeken
sv: Huvudsakligen vi söker

source: Company description
fi: Yrityksen kuvaus
fr: Description de la société
nl: Bedrijfsbeschrijving
sv: Företagsbeskrivning

source: Team
fi: Tiimi
fr: Équipe

source: Product description
fi: Tuotekuvaus
fr: Description du produit
nl: Beschrijving van het product
sv: Produktbeskrivning

source: Business model
fi: Bisnesmalli
fr: Modèle professionnel
nl: Bedrijfsmodel
sv: Affärsmodell

source: Competitors
fi: Kilpailijat
fr: Concurrents
nl: Concurrenten
sv: Konkurrenter

source: Areas of interest
fi: Kiinnostuksen kohteet
fr: Domaines d'intérêt
nl: Interessegebieden
sv: Intresseområden

source: Market
fi: Markkina
fr: Marché
nl: Markt
sv: Marknad

source: Revenue, USD
fi: Liikevaihto, USD
fr: Chiffre d'affaires (USD)
nl: Opbrengst, USD
sv: Intäkter, USD

source: Funding received, USD
fi: Saatu rahoitus, USD
fr: Financement reçu (USD)
nl: Financiering ontvangen, USD
sv: Finansiering mottagen, USD

source: Funding we are looking for, USD
fi: Rahoitus, jota haemme, USD
fr: Financement recherché (USD)
nl: Financiering waar we naar op zoek zijn, USD
sv: Finansiering vi söker, USD

source: Target market
fi: Kohdemarkkina
fr: Marché cible
nl: Doelmarkt
sv: Målmarknad

source: Signifigant investors and advisors
fi: Merkittävät sijoittajat ja neuvonantajat
fr: Investisseurs et conseillers principaux
nl: Belangrijke investeerders en adviseurs
sv: De största investerarna och rådgivarna

source: Notable milestones / metrics
fi: Huomattavat virstanpylväät ja luvut
fr: Jalons / indicateurs notables
nl: Belangrijke mijlpalen/statistieken
sv: Viktiga milstolpar / statistik

source: Other relevant information
fi: Muita merkittäviä tietoja
fr: Autres informations pertinentes
nl: Overige relevante informatie
sv: Annan relevant information

source: Sorry, this page does not exist.
fi: Pahoittelut, tätä sivua ei löytynyt.
fr: Désolés, cette page n'existe pas.
nl: Sorry, deze pagina bestaat niet
sv: Tyvärr den här sidan finns inte.

source: Here's a link back to the %(L$Meeting timeline%).
fi: Palaa tästä %(L$aikajanallesi%).
fr: Voici un lien vers l'%(L$historique de la réunion%).
nl: Hier is een link naar %(L$Ontmoeting tijdlijn%).
sv: Här är en länk till %(L$Möte tidslinje%).

source: Hi %1$s!
fi: Hei %1$s!
fr: bonjour %1$s !
nl: Hoi %1$s!
sv: Hej %1$s!

source: All email to you from Meetin.gs is currently being redirected to %1$s! Please check the inbox for that address to find your log in link for Meetin.gs.
fi: Kaikki sähköposti Meetin.gs-palvelusta ohjataan tällähetkellä osoitteeseen %1$s! Tarkista edellämainittu sähköpostisi löytääksesi kirjautumislinkin palveluun.
fr: Vos e-mails provenant de Meetin.gs sont actuellement redirigés vers %1$s ! Merci de vérifier la boîte de réception de cette adresse afin de retrouver le lien de connexion à Meetin.gs.
nl: Alle mail naar jou van Meetin.gs word op nu doorgestuurd naar %1$s! Kijk in die inbox voor dat e-mailadres om je inloglink voor Meetin.gs te vinden.
sv: Alla e-post till dig från Meetin.gs är för närvarande omdirigerad till %1$s! Vänligen kolla inkorgen för adressen för att hitta din logg i länken för Meetin.gs.

source: If this is a mistake you can recover your account by clicking %(L$this link%).
fi: Jos tämä on virhe, voit palauttaa tilisi painamalla %(L$tästä%).
fr: S'il s'agit d'une erreur, vous pouvez récupérer votre compte en cliquant sur %(L$ce lien%).
nl: Als dit een fout is kun je je account herstellen door te klikken op %(L$deze link%).
sv: Om det här är ett misstag kan du återställa ditt konto genom att klicka på %(L$den här länken%).

source: You are already a user in the service!
fi: Olet jo käyttäjänä palvelussa!
fr: Vous êtes déjà utilisateur de ce service !
nl: Je bent al een gebruiker van deze dienst!
sv: Du använder redan tjänsten!

source: We have sent a secure link to %1$s which you can use to log in and start the meeting creation process.
fi: Olemme lähettäneet turvatun linkin sähköpostitse osoitteeseen %1$s. Käytä linkkiä aloittaaksesi kokouksen järjestämisen.
fr: Nous vous avons envoyé un lien sécurisé sur %1$s que vous pouvez utiliser pour vous connecter et débuter le processus de création de réunion.
nl: We hebben een veilige link naar %1$s gestuurd waarmee je in kan loggen en het proces om nieuwe meetings te creëren kan starten.
sv: Vi har skickat en säker länk till %1$s som du kan använda för att logga in och börja skapa ett möte.

source: Spread the word, inform your friends!
fi: Levitä sanaa kertomalla kavereille ja kumppaneille!
fr: Faites passer le mot, dites-le à vos à amis !
nl: Vertel dit je vrienden!
sv: Sprid ordet, berätta för dina vänner!

source: Also follow us on Facebook and Twitter to stay updated on how to run better meetings:
fi: Seuraa meitä Facebookissa ja Twitterissä pysyäksesi perillä siitä, miten järjestät parempia ja tehokkaampia kokouksia:
fr: Vous pouvez aussi nous suivre sur Facebook et Twitter et vous tenir au courant sur la façon de mener vos réunions encore mieux :
nl: Volg ons ook op Facebook en Twitter om op de hoogte te blijven van hoe je betere meetings kunt organiseren:
sv: Följ oss på Facebook och Twitter för att hålla dig uppdaterad om hur du håller i bättre möten:

source: Follow us on Twitter
fi: Seuraa meitä Twitterissä
fr: Suivez-nous sur Twitter
nl: Volg ons op Twitter
sv: Följ oss på Twitter

source: Follow us on Facebook
fi: Seuraa meitä Facebookissa
fr: Suivez-nous sur Facebook
nl: Volg ons op Facebook
sv: Följ oss på Facebook

source: Your Meeting Analytics
fi: Kokousanalytiikkasi
fr: Vos Réunions d'Analyse
nl: Je Meeting Statistieken
sv: Dina mötesanalyser

source: In total
fi: Yhteensä
fr: En tout
nl: In totaal
sv: Totalt

source: online meetings
fi: Kokoukset verkossa
fr: réunions en ligne
sv: onlinemöten

source: spent in meetings
fi: kulutettu kokouksissa
fr: passé en réunion
nl: doorgebracht in meetings
sv: tillbringat i möten

source: average meeting length
fi: kokouksen kesto ka.
fr: durée moyenne d'une réunion
nl: gemiddelde lengte van meetings
sv: snittlängd på möten

source: average participant
fi: osallistujaa ka.
fr: moyenne des participants
nl: gemiddelde deelnemer
sv: snittdeltagare

source: Number of meetings
fi: Tapaamisten lukumäärä
fr: Nombre de réunions
nl: Aantal meetings
sv: Antal möten

source: Previous 30 days
fi: Viimeiset 30 päivää
fr: Les 30 derniers jours
nl: Afgelopen 30 dagen
sv: Senaste 30 dagarna

source: Last 30 days
fi: Viimeiset 30 päivää.
fr: 30 derniers jours
nl: Laatste 30 dagen
sv: De senaste 30 dagarna

source: Change
fi: Muutos
fr: Changer
nl: Wijzig
sv: Förändra

source: Number of meetings in the last 8 weeks
fi: Kokousten määrä viimeiseltä 8:lta viikolta
fr: Nombre de réunions au cours des 8 dernières semaines
nl: Aantal meetings in de afgelopen 8 weken
sv: Antal möten de senaste 8 veckorna

source: Number of materials
fi: Materiaalien lukumäärä
fr: Nombre de données
nl: Aantal materialen
sv: Antal material

source: meetings with materials
fi: Kokouksia, joissa on jaettu materiaaleja
fr: réunions avec documentation
nl: meetings met materiaal
sv: möten med material

source: meetings with materials
fi: Materiaaleja jaettu
fr: réunions avec documentation
nl: meetings met materiaal
sv: möten med material

source: Meetings with materials in the last 8 weeks
fi: Kokouksia, joissa on jaettu materiaaleja viimeiseltä 8:lta viikolta
fr: Réunions avec documentation au cours des 8 dernières semaines
nl: Meetings met materiaal in de afgelopen 8 weken
sv: Möten med material de senaste 8 veckorna

source: Number of shared comments in the last 30 days
fi: Jaettuja kommentteja viimeisen 30 päivän sisällä
fr: Nombre de commentaires partagés au cours des 30 derniers jours
nl: Aantal gedeelde commentaren van de afgelopen 30 dagen
sv: Antalet delade kommentarer de senaste 30 dagarna

source: meetings with discussion
fi: Kokouksia, joissa keskustelua
fr: réunions avec discussion
nl: meetings met discussie
sv: möten med diskussioner

source: Number of shared comments in the last 8 weeks
fi: Kommenttien määrä kokouksissa viimeiseltä 8:lta viikolta
fr: Nombre de commentaires partagés au cours des 8 dernières semaines
nl: Aantal gedeelde commentaren in de afgelopen 8 weken
sv: Antal delade kommentarer de senaste 8 veckorna

source: Number of participants
fi: Osallistujien määrä
fr: Nombre de participants
nl: Aantal deelnemers
sv: Antal deltagare

source: Sharing in brief
fi: Jakamisesta lyhyesti
fr: Partage en bref
nl: Deel kort overzicht
sv: Delning, en sammanfattning

source: Meetings with content shared before the meeting
fi: Kokouksia, joissa on jaettuja materiaaleja etukäteen
fr: Réunions avec contenu partagé avant la réunion
nl: Meetings met gedeeld materiaal vooraf aan de meeting
sv: Möten med innehåll som delades före mötet

source: Meetings with shared content
fi: Kokouksia, joissa jaettua sisältöä
fr: Réunions avec contenu partagé
nl: Meetings met gedeeld materiaal
sv: Möten med delat innehåll

source: Meetings with follow-ups after the meeting
fi: Kokouksia, joiden pohjalta on järjestetty jatkokokous
fr: Réunions avec suites après la réunion
nl: Meetings met een vervolgafspraak na de meeting
sv: Möten med uppföljning efter mötet

source: Time spent in meetings
fi: Kokouksissa kulutettu aika
fr: Temps passé en réunion
nl: Tijd dat je je in meetings bevindt
sv: Tid tillbringat i möten

source: of time spent in meetings
fi: aikaa vietetty kokouksissa.
fr: du temps passé en réunion
nl: van de tijd doorgebracht in meetings
sv: av tiden som har tillbringats i möten

source: of time spent in meetings*
fi: aikaa vietetty kokouksissa*
fr: de temps passé en réunion*
nl: tijd doorgebracht in meetings*
sv: av tid tillbringad i möten*

source: *Based on 160 monthly work hours.
fi: * Laskettu 160 kuukausittaisen työtunnin mukaan.
fr: *Basé sur un volume de travail mensuel de 160 heures.
nl: *Gebaseerd op 160 werkuren in de maand.
sv: *Baserat på 160 arbetstimmar per månad.

source: Meeting length on average
fi: Kokouksen keskimääräinen pituus
fr: Durée d'une réunion en moyenne
nl: Gemiddelde duur van meetings
sv: Snittlängd på möten

source: We are currently researching a way to calculate the carbon footprint of your meetings.
fi: Tutkimme paraikaa, miten kokouksen hiilijalanjälki olisi mahdollista laskea.
fr: Nous tentons actuellement de trouver un moyen de calculer l'empreinte carbone de vos réunions.
nl: We zijn op dit moment bezig een manier te vinden om het CO2-verbruik van je meetings te kunnen berekenen.
sv: Vi utvecklar just nu ett sätt att räkna ut klimatpåverkan av dina möten.

source: We will email you when the service is available.
fi: Ilmoitamme sinulle sähköpostitse kun palvelu on saatavilla.
fr: Nous vous enverrons un email quand le service sera disponible.
nl: We zullen je een e-mail sturen wanneer deze dienst beschikbaar is.
sv: Vi mejlar dig när tjänsten är tillgänglig.

source: Are you interested in this kind of data? We can email you when this feature becomes available.
fi: Oletko kiinnostunut tällaisista tiedoista? Voimme lähettää sinulle sähköpostitse ilmoituksen kun ominaisuus tulee saataville.
fr: Ce genre de données vous intéresse-t-il ? Nous pouvons vous envoyer un email lorsque ce paramètre sera disponible.
nl: Ben je geïnteresseerd in dit soort data? We kunnen je een e-mail sturen wanneer deze toepassing beschikbaar komt.
sv: Är du intresserad av den här sortens data? Vi kan mejla dig när den här funktionen blir tillgänglig.

source: Email me
fi: Lähettäkää minulle sähköpostia
fr: M'envoyer un email
nl: E-mail mij
sv: Mejla mig

source: We are currently researching a way to calculate how much your meetings cost.
fi: Tutkimme paraikaa, miten kokouksen hinta olisi määriteltävissä.
fr: Nous recherchons en ce moment un moyen de calculer le coût de vos réunions.
nl: We zijn op dit moment bezig een manier te vinden om te berekenen hoeveel je meetings kosten.
sv: Vi håller på och utvecklar ett sätt att räkna ut hur mycket dina möten kostar.

source: We did not find any connected accounts
fi: Yhtään tiliä ei ole yhdistetty
fr: Nous n'avons trouvé aucun compte connecté
nl: We konden geen verbonden accounts vinden
sv: Vi hittade inga anslutna konton

source: Your %1$s account is not yet connected to any existing Meetin.gs account. If you are already an user, please give us the email address you are using Meetin.gs with.
fi: Tilisiäsi %1$s ei ole yhdistetty palveluumme. Mikäli olet jo käyttäjä, syötä alle sähköpostiosoite, jolla olet rekisteröitynyt palveluun.
fr: Votre compte %1$s ne correspond pour l'instant à aucun compte Meetin.gs existant. Si vous êtes déjà inscrit, merci de nous communiquer l'adresse e-mail que vous utilisez sur Meetin.gs.
nl: Je %1$s account is nog niet verbonden met een bestaande Meetin.gs account. Als je al een gebruiker bent, vul dan het e-mailadres in waarmee je Meetin.gs gebruikt.
sv: Kontot %1$s förbinds inte ännu till några befintliga Meetin.gs-konton. Om du redan är en användare, vänligen ge oss den e-postadress du använder Meetin.gs med.

source: We will send you an email which you can use to confirm that you would like to log in to Meetin.gs with your %1$s account in the future.
fi: Lähetimme sinulle sähköpostin, jonka kautta sinun tulee vahvistaa, että haluat haluat antaa tälle kolmannen osapuolen palvelulle luvan kirjata sinut sisään Meetin.gs-palveluun.
fr: Nous allons vous envoyer un e-mail dont vous pourrez vous servir plus tard pour confirmer que vous souhaitez vous connecter à Meetin.gs sur votre compte %1$s.
nl: We sturen je een e-mail waarmee je kunt bevestigen dat je in de toekomst met je Meetin.gs %1$s account wilt inloggen.
sv: Vi kommer att skicka ett e-postmeddelande som du kan använda för att bekräfta att du vill logga in på Meetin.gs med kontot %1$s i framtiden.

source: Email
fi: Sähköpostiosoite
sv: E-post

source: Connect
fi: Yhdistä
fr: Connectez-vous
nl: Verbinden
sv: Anslut

source: Back to login
fi: Takaisin sisäänkirjautumissivulle
fr: Retour à la page connexion
nl: Terug naar inlog
sv: Tillbaka till inloggning

source: A login email has been sent.
fi: Sisäänkirjautumissähköposti on lähetetty.
fr: Un e-mail de connexion vous a été envoyé.
nl: Een e-mail met inloggegevens is verzonden.
sv: Ett loginmejl har skickats.

source: If you want to authorize the partner to login you directly in the future please click the button below.
fi: Jos haluat antaa partnerillemme luvan kirjata sinut suoraan sisään tulevaisuudessa, paina alla olevaa nappia.
fr: Si vous voulez dorénavant autoriser le partenaire à vous connecter directement, veuillez cliquer sur le bouton ci-dessous.
nl: Als je deze partner toe wilt staan je in het vervolg direct in te loggen, klik dan op onderstaande knop.
sv: Om du vill auktorisera din partner att logga in dig direkt i framtiden kan du klicka på knappen nedan.

source: Authorize
fi: Anna lupa
fr: Autoriser
nl: Toestaan
sv: Auktorisera

source: Check your email to continue
fi: Tarkista sähköpostisi jatkaaksesi
fr: Vérifiez votre e-mail avant de poursuivre
nl: Controleer je e-mail voordat je verdergaat
sv: Kolla din mejl för att fortsätta

source: We have now sent an email to %(B$%1$s%). Click the link within to login.
fi: Sähköposti osoitteeseen %(B$%1$s%) on nyt lähetetty. Olkaa hyvä ja seuratkaa sähköpostissa olevaa linkkiä.
fr: Nous avons envoyé un e-mail à %(B$%1$s%). Cliquez sur le lien à l'intérieur pour vous connecter.
nl: We hebben een e-mail gestuurd naar %(B$%1$s%). Klik op de link in de e-mail om in te loggen.
sv: Vi har nu skickat ett mejl till %(B$%1$s%). Klicka på länken för att logga in.

source: To ensure safe delivery of email from us in the future, please add %(B$info@meetin.gs%) to your address book.
fi: Varmistaaksesi sähköpostin kulkemisen tulevaisuudessa, kannattaa sinun lisätä sähköpostiosoite %(B$info@meetin.gs%) osoitekirjaasi.
fr: Afin que les e-mails que nous vous enverrons vous parviennent en toute sécurité, veuillez ajouter %(B$info@meetin.gs%) à votre carnet d'adresses.
nl: Voeg %(B$info@meetin.gs%) toe aan je adresboek om zeker te zijn dat onze e-mail je in de toekomst goed bereikt.
sv: För att säkerställa leverans av e-post från oss i framtiden, vänligen lägg till %(B$info@meetin.gs%) i din adressbok.

source: Welcome to the Meeting
fi: Tervetuloa Meetin.gs-palveluun
fr: Bienvenue à cette réunion
nl: Welkom in de Meeting
sv: Välkommen till mötet

source: Title://context:meeting title
fi: Otsikko:
fr: Title:
nl: Titel:
sv: Rubrik:

source: Location:
fi: Sijainti:
fr: Lieu :
nl: Locatie:
sv: Plats:

source: Time:
fi: Aika:
fr: Horaire :
nl: Tijd:
sv: Tid:

source: We need you to log in to access the meeting page.
fi: Sinun täytyy kirjautua palveluun päästäksesi tälle kokoussivulle.
fr: Vous devez vous connecter pour accéder à la page réunion.
nl: Je moet inloggen om toegang te krijgen tot de meeting-pagina.
sv: Du måste logga in för att komma åt mötessidan.

source: Choose yourself from the list to receive a login email:
fi: Valitse itsesi listasta saadaksesi sisäänkirjautumissähköposti:
fr: Sélectionnez votre nom dans la liste pour recevoir un e-mail de connexion :
nl: Kies jezelf van de lijst om een inlogmail te ontvangen:
sv: Välj dig själv från listan för att få ett loginmejl:

source: Since you have had an account with Meetin.gs before, we have sent an email to %(B$%1$s%). Please click the link within the email to continue.
fi: Koska sinulla on ennestään tili Meetin.gs-palvelun, lähetimme sinulle sähköpostin osoitteeseen %(B$%1$s%). Käytä sähköpostissa olevaa linkkiä jatkaaksesi.
fr: Comme vous avez déjà eu un compte avec Meetin.gs, nous avons envoyé un email à %(B$%1$s%). Veuillez cliquer sur le lien contenu dans l'email pour continuer.
nl: Aangezien je eerder een account bij Meetin.gs had hebben we een e-mail gestuurd naar %(B$%1$s%). Klik op de link in de e-mail om verder te gaan.
sv: Eftersom du har haft ett konto med Meetin.gs tidigare har vi skickat ett mejl till %(B$%1$s%). Klicka på länken i mejlet för att fortsätta.

source: To ensure safe delivery of email from us in the future, please add %(L$info@meetin.gs%) to your address book.
fi: Varmistaaksesi sähköpostin kulkemisen tulevaisuudessa, kannattaa sinun lisätä sähköpostiosoite %(L$info@meetin.gs%) osoitekirjaasi.
fr: Pour permettre à nos futurs emails de bien vous parvenir, veuillez ajouter %(L$info@meetin.gs%) à votre liste d'adresse.
nl: Voeg %(L$info@meetin.gs%) toe aan je adresboek om zeker te weten dat onze e-mails in de toekomst goed aankomen.
sv: För att säkerställa säker leverans av e-post från oss i framtiden, vänligen lägg till %(B$info@meetin.gs%) i din adressbok.

source: Login to continue
fi: Kirjaudu sisään jatkaaksesi
fr: Identifiez-vous pour continuer
nl: Inloggen om verder te gaan
sv: Logga in för att fortsätta

source: Login with Facebook
fi: Kirjaudu Facebook-tilillä
fr: Connexion avec Facebook
nl: Log in met Facebook
sv: Logga in med Facebook

source: Login with Google
fi: Kirjaudu Google-tilillä
fr: Connexion avec Google
nl: Inloggen met Google
sv: Logga in med Google

source: OR
fi: TAI
fr: OU
nl: OF
sv: ELLER

source: Log in
fi: Kirjaudu sisään
fr: Connexion
nl: Inloggen
sv: Logga in

source: Send a login link to my email:
fi: Lähetä sisäänkirjautusmislinkki sähköpostiini:
fr: Envoyer un lien de connexion à mon adresse email :
nl: Stuur een inloglink naar mijn e-mailadres:
sv: Skicka en länk för att logga in till min mejl:

source: Send
fi: Lähetä
fr: Envoyer
nl: Verzenden
sv: Skicka

source: You have successfully logged out
fi: Uloskirjautuminen onnistui
fr: Vous vous êtes déconnecté avec succès
nl: Je bent succesvol uitgelogd
sv: Du har loggat ut

source: Use 5 seconds to share Meetin.gs with your friends:
fi: Käytä tovi jakamalla Meetin.gs-palvelu ystäviesi kesken:
fr: Prenez 5 secondes pour partager Meetin.gs avec vos amis :
nl: Neem 5 seconden om Meetin.gs met je vrienden te delen:
sv: Ta 5 sekunder och dela med dig av Meetin.gs med dina vänner:

source: For feedback, please head over to our %(L$support forums%).
fi: Palautetta voit antaa %(L$tukifoorumillamme%).
fr: Pour soumettre un commentaire, veuillez vous rendre sur nos %(L$forums d'aide%).
nl: Ga voor feedback naar onze %(L$support forums%).
sv: För feedback, vänligen gå till våra %(L$supportforum%).

source: Log in again
fi: Kirjaudu uudelleen
fr: Se connecter à nouveau
nl: Log opnieuw in
sv: Logga in igen

source: Meeting materials
fi: Materiaalit
fr: Données de réunion
nl: Materialen voor meeting
sv: Mötesmaterial

source: No Material for this meeting.
fi: Kokoukseen ei ole liitetty materiaaleja
fr: Aucune donnée pour cette réunion.
nl: Geen materiaal voor deze meeting.
sv: Inget material till det här mötet.

source: Participants
fi: Osallistujat
nl: Deelnemers
sv: Deltagare

source: Loading...
fi: Ladataan...
fr: En cours...
nl: Laden...
sv: Laddar...

source: Mobile upload instructions
fi: Ohjeet tiedostojen lähettämiseen mobiililaitteella
fr: Instructions de mise à jour mobile
nl: Instructies voor mobiel uploaden
sv: Mobiluppladdningsinstruktioner

source: %1$s has invited you to %2$s
fi: %1$s kutsui sinut tapaamiseen %2$s
fr: %1$s vous a invité(e) à %2$s
nl: %1$s heeft je uitgenodigd voor %2$s
sv: %1$s har bjudit in dig till %2$s

source: Please confirm a few things to proceed:
fi: Vahvista muutama asia jatkaaksesi:
fr: Veuillez apporter quelques confirmations pour continuer :
nl: Bevestig een paar dingen voordat je verder gaat:
sv: Vänligen bekräfta några saker för att fortsätta:

source: Is this the email you wish to receive meeting updates to?
fi: Onko tämä sähköposti, johon haluat saada tiedon kokouksiin liittyvistä muutoksista?
fr: Voulez-vous recevoir les mises à jour de réunion à cette adresse email ?
nl: Is dit het e-mailadres waarop je updates van meetings wilt ontvangen?
sv: Är det här mejladressen som du vill få uppdateringar om möten till?

source: If not, %(L$change your email%).
fi: %(L$Vaihda sähköpostiosoitetta%), mikäli haluat ilmoitukset toisaalle.
fr: Si non, %(L$changer votre email%).
nl: Wil je dit niet, %(L$verander je e-mailadres%).
sv: Om inte, %(L$Ändra din mejl%).

source: Is this your current time?
fi: Onko tämä nykyinen aikasi?
fr: Est-ce votre heure actuelle ?
nl: Is dit je huidige tijd?
sv: Är det här din nuvarande tid?

source: If not, change your time zone:
fi: Vaihda aikavyöhykkeesi, jos se on väärin:
fr: Si non, changez votre fuseau horaire :
nl: Pas je tijdzone aan wanneer dit niet het geval is:
sv: Om inte, ändra din tidszon:

source: Before we proceed, we need to be sure that we show the time correctly for you.
fi: Meidän täytyy varmistaa, että ajat näytetään sinulle oikein ennen kuin jatkamme.
fr: Auparavant, nous devons nous assurer que nous vous montrons correctement la date.
nl: Voor we verder gaan moeten we zeker weten dat de tijd correct weergegeven wordt voor jou.
sv: Innan vi fortsätter måste vi säkerställa att vi visar din rätta tid.

source: Continue
fi: Jatka
fr: Continuez
nl: Doorgaan
sv: Fortsätt
