Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_back-*.po
Languages: fi, fr, nl, sv

source: The service is powered by Meetin.gs - the smartest way to meet, online or face-to-face. Put your meetings on the cloud and make them accessible from any device. Claim your own Meet Me page for personal or business use.
fi: Tämä matchmaking on rakennettu käyttäen Meetin.gs-palvelua. Viemme kokouksesi pilveen ja mahdollistamme niihin pääsyn kaikista päätelaitteistasi. Varaa oma Meet Me -sivu omaan jokapäiväiseen käyttöösi. Meetin.gs - The smartest way to meet, online or face-to-face.
fr: Ce service est opéré par Meetin.gs - la façon la plus futée de se réunir en ligne ou en face à face. Mettez vos réunions sur le Cloud et elles seront accessibles depuis n'importe quel appareil. Demandez votre propre page Meet Me pour votre usage personnel ou professionnel.
nl: Deze service wordt aangeboden door Meetin.gs - de slimste manier om elkaar te ontmoeten, online of oog-in-oog. Zet je meetings in de cloud, en maak ze toegankelijk voor elk apparaat. Maak een eigen Ontmoet Mij-pagina voor persoonlijk of zakelijk gebruik.
sv: Tjänsten drivs av Meetin.gs - den smartaste vägen att mötas, online eller i verkligheten. Sätt dina möten i molnet och gör dem tillgängliga från valfri enhet. Skapa din egen Möt Mig-sida för personligt eller affärsmässigt bruk.

source: The service saves you time organizing meetings and it is free to use.
fi: Palvelu säästää aikaa ja tehostaa kokouksia. Lisäksi se on ilmainen käyttää.
fr: Ce service vous permet de gagner du temps dans l'organisation de vos réunions et il est gratuit.
nl: De dienst is gratis en bespaart je tijd in het organiseren van meetings.
sv: Tjänsten gör det snabbare att organisera möten och den är gratis att använda.

source: Continue setup for personal use
fi: Ota palvelu jokapäiväiseen käyttöösi
fr: Poursuivez la configuration pour un usage personnel
nl: Ga door met de set-up voor persoonlijk gebruik
sv: Fortsätta ställa in för personlig användning

source: A few suggestion on what to do next:
fi: Mitä tehdä seuraavaksi? Tässä muutama ehdotus:
fr: Quelques suggestions sur la prochaine étape :
nl: Enkele suggesties voor wat nu te doen:
sv: Några förslag på vad du kan göra nu:

source: Keep track of meetings on your phone:
fi: Pysy ajan tasalla kokoustesi kanssa käyttäen puhelintasi:
fr: Suivez vos réunions sur votre téléphone :
nl: Houdt je meetings bij op je telefoon:
sv: Håll reda på möten med din mobiltelefon.

source: Download the %(L$iPhone App%)
fi: Lataa %(L$iPhone applikaatio%)
fr: Téléchargez %(L$l'Appli iPhone%)
nl: Download de %(L$iPhone App%)
sv: Hämta %(L$iPhone appen%)

source: Download the %(L$Android App%)
fi: Lataa %(L$Android applikaatio%)
fr: Téléchargez %(L$l'Appli Android%)
nl: Download de %(L$Android App%)
sv: Hämta %(L$Android appen%)

source: Manage meetings right on your browser and schedule meetings with people on LinkedIn and more - Install the %(L$Chrome extension%)
fi: Hallinnoi kokouksia suoraan selaimestasi ja sovi tapaamisia ihmisten kanssa suoraan Linkedinistä, Gmailista ja muista suosituista palveluista asentamalla %(L$Chrome lisäosa%)
fr: Gérez les réunions directement depuis votre navigateur et organisez des réunions avec des gens sur LinkedIn et autre - Installez l' %(L$extension Chrome%)
nl: Beheer vergaderingen direct in je browser en plan vergaderingen in met mensen op LinkedIn en meer. Installeer de %(L$Chrome extensie%)
sv: Hantera möten direkt på din webbläsare och schemalägg möten med människor på LinkedIn och mer - installera %(L$Chrome-tillägget%)

source: Need help getting started? Read one of our %(L$tutorials%)
fi: Tuntuuko palvelun käyttäminen vaikealta? Tutustu uusille käyttäjille laadittuun %(L$ohjeistukseen%)
fr: Vous avez besoin d'aide pour démarrer ? Consultez l'un de nos %(L$tutoriels%)
nl: Hulp nodig in het begin? Lees een van onze %(L$tutorials%)
sv: Behöver du hjälper med att komma igång? Läs en av våra %(L$handledningar%)

source: Get advice from our %(L$support forums%)
fi: Hae neuvoa %(L$tukifoorumilta%)
fr: Trouvez des conseils dans nos %(L$forums d'assistance%)
nl: Krijg advies van onze %(L$support forums%)
sv: Få råd från våra %(L$supportforum%)

source: Welcome to %1$s
fi: Tervetuloa tilaisuuteen %1$s
fr: Bienvenue à %1$s
nl: Welkom bij %1$s
sv: Välkommen till %1$s

source: Your e-mail %(B$%1$s%) is already in our system - Been with us before, have you? Welcome back.
fi: Sähköpostisi %(B$%1$s%) löytyy jo järjestelmästämme. Tervetuloa takaisin!
fr: Votre adresse email %(B$%1$s%) est déjà dans notre système - vous nous connaissez déjà, n'est-ce pas ? Bon retour parmi nous.
nl: Je email %(B$%1$s%) zit al in ons systeem. U bent hier al eerder geweest, niet? Welkom terug.
sv: Din e-post %(B$%1$s%) är redan i vårt system - har du varit med oss innan? Välkommen tillbaka.

source: Please, click the button below to confirm your meeting request with %(B$%1$s%).
fi: Vahvista käyttäjälle %(B$%1$s%) lähetettävä kokouspyyntö.
fr: Veuillez cliquer sur le bouton ci-dessous pour confirmer votre demande de réunion avec %(B$%1$s%).
nl: Klik alstublieft op onderstaande knop om uw vergaderverzoek met %(B$%1$s%) te bevestigen.
sv: Klicka på knappen nedan för att bekräfta din mötesförfrågan med %(B$%1$s%).

source: Confirm meeting request
fi: Vahvista kokouspyyntö
fr: Confirmer demande de réunion
nl: Vergaderverzoek bevestigen.
sv: Bekräfta mötesförfrågan

source: Confirm your request for a meeting with %1$s
fi: Vahvista kokouspyyntösi käyttäjän %1$s kanssa
fr: Confirmez votre demande de réunion avec %1$s.
nl: Bevestig uw aanvraag voor een vergadering met %1$s
sv: Bekräfta din begäran om ett möte med %1$s

source: You're almost there!
fi: Melkein valmista
fr: Vous avez bientôt terminé !
nl: U bent bijna klaar!
sv: Du är nästan där!

source: Your request to meet with %1$s is almost complete.
fi: Käyttäjälle %1$s lähetettävä kokouspyyntösi on melkein valmis.
fr: Votre demande de réunion avec %1$s est presque terminée.
nl: Uw aanvraag om te vergaderen met %1$s is bijna compleet.
sv: Din begäran att träffa %1$s är nästan klar.

source: To confirm the meeting and to verify your email address, click on the button below.
fi: Vahvista sähköpostiosoitteesi ja viimeistele kokouspyyntö oheisesta painikkeesta.
fr: Pour confirmer la réunion et vérifier votre adresse email, cliquez sur le bouton ci-dessous.
nl: Klik op onderstaande knop om de vergadering te bevestigen en uw email te controleren.
sv: För att bekräfta mötet och verifiera din e-postadress klickar du på knappen nedan.

source: You have received an invitation to meet!
fi: Olet saanut tapaamispyynnön!
fr: Vous avez reçu une invitation à une réunion !
nl: U heeft een uitnodiging om te vergaderen ontvangen!
sv: Du har fått en inbjudan att mötas!

source: %1$s suggested the following agenda:
fi: %1$s ehdotti seuraavaa agendaa:
fr: %1$s a suggéré le programme suivant :
nl: %1$s heeft de volgende agenda voorgesteld:
sv: %1$s föreslog följande dagordning:

source: %1$s from %2$s suggested the following agenda:
fi: %1$s yrityksestä %2$s ehdotti seuraavanlaista agendaa:
fr: %1$s de %2$s propose le programme suivant :
nl: %1$s van %2$s heeft de volgende agenda voorgesteld:
sv: %1$s från %2$s föreslog följande agenda:

source: Please answer as soon as possible. Accepting the meeting request will take you to the online meeting page to send the invitation. If you decline the request, you will get the opportunity to respond why you cannot meet.
fi: Vastaa pyyntöön mahdollisimman nopeasti. Pyynnön hyväksymyminen vie sinut valmistelemaan kokoussivua ja lähettämään varsinaisen kokouskutsun. Mikäli kieltäydyt pyynnöstä, saat mahdollisuuden vastata ja selittää miksi kieltäydyit.
fr: Veuillez répondre aussi vite que possible. Accepter la demande de réunion vous emmènera sur la page de réunion en ligne pour envoyer l'invitation. Si vous refusez la demande, vous aurez l'occasion de préciser pourquoi vous ne pouvez pas participer à la réunion.
nl: Antwoord alstublieft zo snel mogelijk. Het vergaderverzoek accepteren zal u naar de online vergaderpagina brengen om de uitnodiging te versturen. Wanneer u het verzoek afwijst zal u de mogelijkheid krijgen om te antwoorden waarom u niet kan vergaderen.
sv: Snälla svara så snart som möjligt. Accepteras mötesbegäran tas du till onlinemötet för att skicka inbjudan. Om du inte accepterar begäran, får du möjlighet att svara på varför du inte kan träffas.

source: Accept
fi: Hyväksy
fr: Accepter
nl: Accepteren
sv: Acceptera

source: Decline
fi: Hylkää
fr: Refuser
nl: Wijs af
sv: Refusera

source: Accept or decline on the meeting page:
fi: Hyväksy tai hylkää kokoussivu:
fr: Acceptez ou déclinez sur la page réunion :
nl: Accepteer of wijs af op de meeting-pagina:
sv: Acceptera eller refusera på mötessidan:

source: %1$s has requested a meeting at %2$s
fi: %1$s ehdotti tapaamista tilaisuudessa %2$s
fr: %1$s a requis une réunion à %2$s
nl: %1$s heeft een vergadering aangevraagd om %2$s.
sv: %1$s har begärt ett möte på %2$s

source: %1$s from %2$s has requested a meeting at %3$s
fi: %1$s yrityksestä %2$s ehdotti tapaamista tilaisuudessa %3$s
fr: %1$s de %2$s a demandé une réunion à %3$s
nl: %1$s van %2$s heeft een vergadering verzocht om %3$s
sv: %1$s från %2$s har begärt ett möte %3$s

source: %1$s has requested a meeting with you
fi: %1$s haluaa tavata sinut
fr: %1$s a requis une réunion avec vous
nl: %1$s heeft een vergadering met u aangevraagd
sv: %1$s har begärt ett möte med dig

source: %1$s from %2$s has requested a meeting with you
fi: %1$s yrityksestä %2$s haluaa tavata sinut
fr: %1$s de %2$s a demandé une réunion avec vous
nl: %1$s van %2$s heeft een vergadering met uw verzocht
sv: %1$s från %2$s har bett om ett möte med dig

source: %1$s is still waiting for your response.
fi: %1$s odottaa edelleen vastaustasi.
fr: %1$s attend toujours votre réponse.
nl: %1$s wacht nog steeds op uw antwoord.
sv: %1$s fortfarande väntar på ditt svar.

source: %1$s proposed the following agenda:
fi: %1$s ehdotti seuraavaa agendaa:
fr: %1$s a proposé le programme suivant :
nl: %1$s heeft de volgende agenda voorgesteld:
sv: %1$s föreslog följande dagordning:

source: Please, respond as soon as possible.
fi: Ole hyvä ja vastaa mahdollisimman pian.
fr: Veuillez répondre aussi vite que possible.
nl: Antwoord alstublieft zo snel mogelijk.
sv: Snälla, svara så snart som möjligt.

source: Please respond to the meeting request from %1$s
fi: Ole hyvä ja vastaa käyttäjän %1$s lähettämään tapaamispyyntöön
fr: Veuillez répondre à la demande de réunion de %1$s
nl: Beantwoord het vergaderverzoek van %1$s.
sv: Vänligen svara på mötesförfrågan från %1$s

source: Sorry,
fi: Pahoittelumme,
fr: Désolés,
sv: Beklagar,

source: %1$s declined your request to meet with the following message:
fi: %1$s kieltäytyi tapaamispyynnöstäsi lähettäen seuraavan viestin:
fr: %1$s a décliné votre demande de réunion avec le message suivant :
nl: %1$s heeft uw verzoek afgewezen met de volgende boodschap:
sv: %1$s avböjde din begäran att mötas med följande meddelande:

source: %1$s from %2$s declined your request to meet with the following message:
fi: %1$s yrityksestä %2$s kieltäytyi tapaamispyynnöstäsi lähettäen seuraavan viestin:
fr: %1$s de %2$s a refusé votre demande de rencontre avec le message suivant :
nl: %1$s van %2$s heeft uw verzoek afgewezen met de volgende boodschap:
sv: %1$s från %2$s avböjde din begäran att mötas med följande meddelande:

source: %1$s declined your request to meet.
fi: %1$s kieltäytyi tapaamispyynnöstäsi.
fr: %1$s a refusé votre demande de réunion.
nl: %1$s heeft uw vergaderverzoek afgewezen.
sv: %1$s avböjde din begäran att mötas.

source: %1$s from %2$s declined your request to meet.
fi: %1$s yrityksestä %2$s kieltäytyi tapaamispyynnöstäsi.
fr: %1$s de %2$s a décliné votre invitation de rencontre.
nl: %1$s van %2$s heeft uw vergaderverzoek afgewezen.
sv: %1$s från %2$s avböjde din begäran att mötas.

source: What was this about?
fi: Mistä on kyse?
fr: Quel était le sujet ?
nl: Waar ging dit over?
sv: Vad handlade detta om?

source: You now have %(B$%1$s slots available%) to request a meeting at %2$s.
fi: Sinulla on nyt %(B$%1$s kpl käytettävissä olevia aikoja%) tapaamisten ehdottamiseen tilaisuudessa %2$s.
fr: Vous avez maintenant %(B$%1$s créneaux disponibles%) pour demander une réunion à %2$s.
nl: U heeft nu %(B$%1$s tijdsdelen beschikbaar%) om een vergadering aan te vragen bij %2$s.
sv: Du har nu %(B$%1$s platser tillgängliga) att begära ett möte på %2$s.

source: Try to schedule another meeting.
fi: Yritä sopia toinen tapaaminen.
fr: Essayer d'organiser une autre réunion.
nl: Probeer een andere vergadering in te plannen.
sv: Försök att schemalägga ett möte.

source: You have requested a meeting with %(B$%1$s%) from %(B$%2$s%).
fi: Olet ehdottanut tapaamista henkilön %(B$%1$s%) kanssa yrityksestä %(B$%2$s%).
fr: Vous avez demandé une réunion avec %(B$%1$s%) de %(B$%2$s%).
nl: U heeft een vergadering aangevraagd met %(B$%1$s%) van %(B$%2$s%).
sv: Du har begärt ett möte med %(B$%1$s%) från %(B$%2$s%).

source: You have requested a meeting with %(B$%1$s%).
fi: Olet ehdottanut tapaamista henkilön %(B$%1$s%) kanssa.
fr: Vous avez demandé une réunion avec %(B$%1$s%).
nl: U heeft een vergadering aangevraagd met %(B$%1$s%).
sv: Du har begärt ett möte med %(B$%1$s).

source: What happens next? The other person will now accept or decline your request to meet. We will send you a notification when we have a response (expect this within a few days).
fi: Välitämme nyt vastaanottajalle tapaamispyyntösi. Hän joko hyväksyy tai hylkää sen. Toimitamme sinulle ilmoituksen heti kun saamme vastauksen (tämän pitäisi tulla muutamassa päivässä).
fr: Que se passe-t-il maintenant ? L'autre personne va accepter ou refuser la demande de réunion. Nous vous enverrons une notification quand nous aurons une réponse (dans quelques jours).
nl: Wat gebeurt hierna? De andere persoon zal nu uw vergaderverzoek accepteren of afwijzen. We zullen u een notificatie sturen wanneer we een antwoord hebben (verwacht dit binnen een paar dagen).
sv: Vad händer härnäst? Den andra personen kommer nu acceptera eller avböja din begäran att mötas. Vi kommer skicka dig ett meddelande när vi har ett svar (vänta dig detta inom några dagar).

source: If you have any questions, please contact %(L$support@meetin.gs%).
fi: Mikäli sinulla on mitään kysyttävää, voit olla meihin yhteydessä sähköpostitse osoitteella %(L$support@meetin.gs%).
fr: Si vous avez des questions, n'hésitez pas à contacter %(L$support@meetin.gs%).
nl: Neem contact op met %(L$support@meetin.gs%) als u vragen heeft.
sv: Om du har några frågor får du gärna kontakta %(L$support@meetin.gs%).

source: Organize another meeting at the %1$s.
fi: Järjestä uusi tapaaminen tilaisuuteen %1$s.
fr: Organiser une autre réunion au %1$s.
nl: Organiseer een andere vergadering bij de %1$s.
sv: Ordna ett nytt möte på %1$s.

source: While waiting, why don't you setup your own meet me page?
fi: Odotellessasi voit esimerkiksi pystyttää oman Meet Me -sivusi.
fr: Pendant que vous patientez, pourquoi ne pas organiser votre propre page rencontrez-moi ?
nl: Waarom richt u niet uw eigen introductiepagina in terwijl u wacht?
sv: Medan du väntar, varför inte ställa in din egen Möt mig-sida?

source: We have sent your meeting request
fi: Tapaamispyyntösi on nyt lähetetty
fr: Nous avons envoyé votre demande de réunion
nl: We hebben uw vergaderverzoek verstuurd.
sv: Vi har skickat din mötesförfrågan

source: Your request to meet has been sent to %1$s from %2$s
fi: Tapaamispyyntösi henkilölle %1$s yrityksestä %2$s on lähetetty
fr: Votre demande de réunion a été envoyée à %1$s de %2$s
nl: Uw verzoek om te vergaderen is verstuurd naar %1$s van %2$s.
sv: Din begäran att mötas har skickats till %1$s från %2$s

source: Your request to meet has been sent to %1$s
fi: Tapaamispyyntösi käyttäjälle %1$s on lähetetty
fr: Votre demande de réunion a été envoyée à %1$s
nl: Uw verzoek om te vergaderen is verstuurd naar %1$s.
sv: Din begäran att mötas har skickats till %1$s

source: Time to get ready for %1$s.
fi: Aika valmistautua kokoukseen %1$s.
fr: Tenez-vous prêt pour %1$s.
nl: Tijd om voor te bereiden voor %1$s.
sv: Dags att göra dig klar för %1$s.

source: This is a summary of your upcoming meetings during the event:
fi: Tässä kooste sovituista tapaamisistasi tilaisuudessa:
fr: Voici un résumé de vos réunions à venir durant l'événement :
nl: Dit is een samenvatting van uw aanstaande vergaderingen gedurende het evenement:
sv: Detta är en sammanfattning av dina kommande möten under evenemanget:

source: Consider reviewing the meetings one more time and checking if there are any agenda items or materials, that you might have missed. Preparing well is one of the key factors for holding an efficient meeting.
fi: Harkitse käyväsi vielä läpi tulevat tapaamiset sekä erityisesti niissä jaetut materiaalit ja agendat. Riittävä valmistautuminen on yksi tehokkaan kokouksen tärkeimmistä edellytyksistä.
fr: Examinez les réunions encore une fois et vérifiez s'il y a des programmes ou des données que vous auriez pu ne pas voir. Une bonne préparation est l'un des facteurs clé pour une réunion efficace.
nl: Overweeg om de vergaderingen nog een keer te controleren om te zien of u er nog agenda items of materialen zijn die u gemist zou kunnen hebben. Een goede voorbereiding is een van de sleutelfactoren om een efficiënte vergadering te houden.
sv: Överväg att granska möten en gång och kontrollera om det finns några punkter på dagordningen eller material som du kanske har missat. Förberedelser är en av de viktigaste faktorerna för att hålla ett effektivt möte.

source: (Not confirmed)
fi: (Ei vahvistettu)
fr: (Non confirmé)
nl: (niet bevestigd)
sv: (Inte bekräftat)

source: View to confirm the meeting
fi: Katso kokouksen tiedot ja vahvista
fr: Afficher pour confirmer la réunion
nl: Bekijken om de vergadering te bevestigen.
sv: Visa för att bekräfta mötet

source: View meeting details
fi: Katso kokouksen tiedot
fr: Afficher les détails de la réunion
nl: Bekijk details van de vergadering.
sv: Visa mötesinformation

source: IMPORTANT: Some of your meetings are not confirmed.
fi: TÄRKEÄÄ: Kaikkia kokouksiasi ei ole vielä vahvistettu.
fr: IMPORTANT : certaines de vos réunions ne sont pas confirmées.
nl: BELANGRIJK: Enkele van uw vergaderingen zijn niet bevestigd.
sv: VIKTIGT: Vissa av dina möten har inte bekräftats.

source: You have not accepted or declined all the meeting requests you received or you have not confirmed, that the online meeting page is ready to be shared with the participants. Both of these actions may be completed on each meeting page.
fi: Et ole hyväksynyt tai hylännyt kaikkia vastaanottamiasi tapaamispyyntöjä tai kaikkia kokoussivujasi ei ole vielä viimeistelty ja jaettu osallistujien kesken. Voit tehdä nämä asiat kuhunkin kokoukseen liittyvällä sivulla.
fr: Vous n'avez pas accepté ni décliné les notifications de réunions qui vous ont été envoyées ou vous n'avez pas confirmé que la page réunion en ligne était prête à être partagée avec tous les participants. Ces deux actions peuvent être effectuées sur chaque page réunion.
nl: U heeft nog niet alle vergaderverzoeken die u heeft ontvangen geaccepteerd of afgewezen of u heeft nog niet bevestigd dat de online vergaderpagina klaar is om met de deelnemers te delen. Deze acties kunnen beide op iedere vergaderpagina worden afgemaakt.
sv: Du har inte accepterat eller refuserat alla mötesförfrågningar du har fått eller inte har bekräftat, att sidan online-möte är redo att delas med deltagarna. Båda dessa åtgärder kan slutföras på varje mötessida.

source: You should do this now as the matchmaking will not be completed otherwise.
fi: Vaaditut toimet tulisi suorittaa pikimmiten, sillä muuten matchmaking jää kesken eikä tapaaminen toteudu.
fr: Nous vous conseillons de le faire maintenant ou la mise en relation ne sera pas complète.
nl: U zult dit nu moeten doen omdat het koppelen anders niet tot stand zal komen.
sv: Du bör detta nu eftersom matchmaking inte slutförs annars.

source: General instructions for meetings at %1$s:
fi: Yleisiä ohjeita liittyen tapaamisiin tilaisuudessa %1$s:
fr: Instructions générales pour les réunions à %1$s :
nl: Algemene instructies voor vergaderingen bij %1$s:
sv: Allmänna instruktioner för möten på %1$s:

source: Did you know, that you can use your mobile device to easily access all the information related to your meetings during %1$s? It's easy.
fi: Tiesitkö, että pääset näppärästi käsiksi tapaamistesi tietoihin mobiilisti myös tapahtuman %1$s aikana?
fr: Saviez-vous que vous pouvez utiliser votre appareil mobile pour accéder facilement aux informations liées à vos réunions pendant %1$s ? C'est très simple.
nl: Wist u dat u uw mobiele apparaat kan gebruiken om makkelijk toegang te krijgen tot alle aan uw vergadering gerelateerde informatie gedurende %1$s? Het is eenvoudig.
sv: Visste du att du kan använda din mobila enhet för att enkelt komma åt all information relaterad till dina möten under %1$s? Det är lätt.

source: Get Meetin.gs app for your iOS device now:
fi: Lataa Meetin.gs applikaatio iOS laitteeseesi nyt:
fr: Téléchargez dès maintenant l'application Meetin.gs pour votre appareil iOS :
nl: Krijg de Meetin.gs app voor uw mobiele apparaat met iOS nu:
sv: Få Meetin.gs-appen för iOS nu:

source: Or scan the code:
fi: Tai skannaa koodi näytöltä:
fr: Ou scanner le code :
nl: of scan de code:
sv: Eller skanna koden:

source: %1$s: Your scheduled meetings
fi: %1$s: Sovitut tapaamisesi
fr: %1$s : vos réunions programmées
nl: %1$s: Uw geplande vergaderingen
sv: %1$s: Dina planerade möten

source: During the %1$s event you will be able to view your scheduled meetings also from our mobile site. Access meeting details, materials, participants and more.
fi: %1$s tilaisuuden aikana pääset käsiksi tapaamistesi tietoihin myös mobiilisivumme kautta. Näet muun muassa tapaamisten yksityiskohdat ja osallistujat sekä pääset käsiksi kokousmateriaaleihin.
fr: Au cours de l'événement %1$s, vous pourrez aussi visualiser les réunions planifiées depuis notre site mobile. Vous aurez accès aux informations liées à cette réunion, aux documents, aux participants et plus encore.
nl: Tijdens het %1$s event kun je je geplande meetings ook via onze mobiele website bekijken. Bekijk details van de meeting, materiaal, deelnemers, en meer.
sv: Under händelsen %1$s kommer du även att kunna visa din planerade möten från vår mobila webbplats. Kom åt mötesdetaljer, material, deltagare och mycket mer.

source: Simply open this email on your mobile device and tap the button below:
fi: Avaa oheinen linkki mobiililaitteellasi.
fr: Il suffit d'ouvrir cet e-mail sur votre appareil mobile et taper sur le bouton ci-dessous :
nl: Open simpelweg deze e-mail op je mobiel apparaat en tik op de onderstaande knop:
sv: Öppna bara det här mejlet på din mobil och tryck på knappen nedan:

source: Open the list of meetings
fi: Lista tapamisistasi
fr: Ouvrir la liste des réunions
nl: Open de lijst van meetings
sv: Öppna listan med möten

source: If you have any questions regarding the meetings at the venue such as the exact location, speak to the staff at the event registration & info and they will be happy to help you.
fi: Mikäli sinulla ilmenee itse tilaisuudessa tapaamisiin liittyviä kysymyksiä esimerkiksi taapaamisten sijainnista, käänny suoraan henkilökunnan puoleen.
fr: Si vous avez des questions relatives aux réunions, comme sur le lieu exact, adressez-vous au personnel dans la catégorie inscription à l'événement et informations. Ils seront heureux de vous aider.
nl: Als je vragen hebt over de meetings op deze locatie, zoals de exacte locatie, spreek dan met het personeel op de event registratie & info and zij zullen je graag verder helpen.
sv: Om du har några frågor angående möten på platsen som den exakta adressen, tala med personalen på registrering & info så kommer de hjälpa dig.
