Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_front-*.po
Languages: fi, fr, nl, sv

source: Already a user? Login here
fi: Oletko jo käyttäjä? Kirjaudu sisään.
fr: Déjà utilisateur ? Se connecter ici
nl: Reeds een gebruiker? Hier inloggen
sv: Redan registrerad som användare? Logga in här

source: Linkedin Profile
fi: LinkedIn-profiili
fr: Profil Linkedin
nl: LinkedIn Profiel
sv: Profil på Linkedin

source: Suggest below the best time to meet with %1$s.
fi: Ehdota parasta tapaamisaikaa henkilön %1$s kanssa.
fr: Suggérez en dessous le meilleur moment pour rencontrer %1$s
nl: Stel hieronder de beste tijd voor om %1$s te ontmoeten.
sv: Föreslå nedan den bästa tiden att träffa %1$s.

source: Connected calendars: %1$s active %2$s inactive and %3$s new calendars
fi: Yhdistetyt kalenterit: käytössä %1$s, poissa käytöstä %2$s ja uusia kalentereita %3$s kappaletta.
fr: Agendas connectés : %1$s actif(s) %2$s inactif(s) et %3$s nouveaux agendas
nl: Verbonden kalenders: %1$s actief %2$s inactief en %3$s nieuwe kalenders
sv: Anslutna kalendrar: %1$s aktiva %2$s inaktiva och %3$s nya kalendrar

source: change
fi: Vaihda
fr: changer
nl: wijzigen
sv: ändra

source: ( NOTE: Calendars not configured )
fi: (HUOM: Kalenterin asetuksia ei ole määritelty)
fr: ( NOTE : Agendas non configurés )
nl: (LET OP: Kalenders niet geconfigureerd)
sv: ( OBS: Kalendrar är inte konfigurerade )

source: Select which calendars you want to check for your availability
fi: Valitse ne kalenterit, joiden perusteella rajaamme mahdolliset tapaamisajat:
fr: Sélectionnez sur quels agendas vous voulez vérifier votre disponibilité
nl: Selecteer welke kalenders u wilt controleren op uw beschikbaarheid
sv: Välj vilka kalendrar du vill kolla angående din tillgänglighet

source: Do you want to claim a %(B$Meet Me%) page?
fi: Tahdotko varata %(B$tapaamissivusi%)?
fr: Voulez-vous demander une page %(B$Rencontrez-moi%) ?
nl: Wilt u een %(B$ontmoet me%) pagina vorderen?
sv: Vill du hävda en %(B$Meet Me%)-sida?

source: You are about to register for matchmaking. First select and claim your personal URL above. Next we'll take you to create and customize your own %(B$Meet Me%) page for the event. It enables people to use a handy scheduler to easily propose meetings with you. Later you will also be able to create additional schedulers for your personal use.
fi: Olet rekisteröitymässä matchmaking-palveluun. Aloita valitsemalla ja varaamalla oma henkilökohtainen osoitteesi. Seuraavaksi siirrymme luomaan sinulle oman %(B$Meet Me%) -sivun tapahtumaa varten. Meet Me -sivu sallii muiden osallistujien valita näppärästä tapaamiskalenterista kummallekin sopivia tapaamisaikoja. Myöhemmin voit luoda useampia tapaamiskalentereita omaan hekilökohtaiseen käyttöösi.
fr: Vous êtes sur le point de vous inscrire aux rencontres. Commencez par sélectionner et revendiquer votre URL personnelle ci-dessus. Nous allons ensuite vous proposer de créer et de personnaliser votre propre page %(B$Me Rencontrer%) pour l'événement. Cela permet aux gens d'utiliser un emploi du temps pratique pour vous proposer facilement des réunions. Vous pourrez ensuite créer d'autres emplois du temps pour votre usage personnel.
nl: U staat op het punt u te registeren voor matchmaking. Selecteer eerst en eis uw persoonlijke URL bovenaan. Daarna nemen we u mee om uw eigen %(B$Ontmoet me%) pagina voor het evenement aan te maken en aan te passen. Het laat mensen toe een handig plan te gebruiken om makkelijk ontmoetingen met u voor te stellen. Later zult u ook in staat zijn om extra plannen aan te maken voor uw persoonlijk gebruik.
sv: Du håller på att registrera dig för matchning. Välj först din personliga URL ovan. Sedan ska du skapa och anpassa din egen %(B$Möt mig%) för händelsen. Den gör att andra kan använda ett bekvämt schemaläggningsverktyg för att föreslå möten med dig. Senare kommer du också att kunna skapa ytterligare schemaläggare för personlig användning.

source: %(B$Meet Me%) page is your private or public meeting scheduler page through which other people can propose meetings with you.
fi: %(B$Tapaamissivu%) on yksityisesti tai julkisesti jaettava tapaamiskalenteri, jonka kautta muut henkilöt voivat ehdottaa sinulle tapaamisia teille kummallekin sopivana ajankohtana.
fr: La page %(B$Rencontrez-moi%) est votre page de planification de rendez-vous privée ou publique par laquelle d'autres personnes peuvent vous proposer des rendez-vous.
nl: %(B$Meet Me%)-pagina is uw eigen of publieke agenda-pagina voor ontmoetingen via de welke andere personen ontmoetingen met u kunnen voorstellen.
sv: %(B$Meet Me%)-sidan är din privata eller offentliga möteshanterare genom vilken andra personer kan föreslå möten med dig.

source: Save & continue
fi: Tallenna ja jatka
fr: Enregistrer et continuer
nl: Opslaan & doorgaan
sv: Spara & fortsätt

source: Preview
fi: Esikatsele
fr: Aperçu
nl: Voorbeeld
sv: Förhandsgranskning

source: Edit meeting scheduler
fi: Muokkaa tapaamiskalenteria
fr: Modifier planificateur de rendez-vous
nl: Vergaderplanner bewerken
sv: Redigera mötesschemaläggare

source: Meeting scheduler name
fi: Tapaamiskalenterin nimi
fr: Nom du planificateur de la rencontre
nl: Naam vergadering planner
sv: Namn på mötesschemaläggare

source: Meeting with %1$s
fi: Tapaaminen käyttäjän %1$s kanssa
fr: Rendez-vous avec %1$s
nl: Ontmoeting met %1$s
sv: Möte med %1$s

source: Hide from the public cover page
fi: Piilota julkiselta kansisivulta
fr: Cacher de la page de couverture publique
nl: Verbergen van de openbare voorpagina
sv: Dölj från den offentliga framsidan

source: Enable direct link & custom background
fi: Salli suora linkki ja mukautettu tausta
fr: Activation du lien direct et de l'arrière-plan personnalisé
nl: Directe link & aangepaste achtergrond inschakelen
sv: Aktivera direktlänk och anpassad bakgrund

source: Ask for email authentication from requesters
fi: Vaadi kutsujalta sähköpostitunnistautuminen
fr: Demander une authentification par courriel des requérants
nl: Vraag alle aanvragers naar e-mail-identificatie
sv: Be om e-mailautentisering av begärande

source: Configure Meet Me page
fi: Määrittele tapaamissivun asetukset
fr: Configurer la page Me Rencontrer
nl: Configureer Meet Me pagina
sv: Konfigurera Möt mig-sida

source: Direct link
fi: Suora linkki
fr: Lien direct
nl: Rechtstreekse link
sv: Direktlänk

source: copy to clipboard
fi: kopioi leikepöydälle
fr: Copier dans le presse-papier
nl: kopiëren naar plakbord
sv: kopiera till urklipp

source: Your greeting on the %(B$Meet Me%) page:
fi: Tervehdyksesi %(B$Meet Me%) -sivullasi:
fr: Votre salutation sur la page %(B$Me Rencontrer%) :
nl: Uw groet op de
sv: Din hälsning på %(B$Möt mig%)-sidan:

source: Pitch video link:
fi: Linkki esittelyvideoon:
fr: Lien de la vidéo de présentation :
nl: Link naar pitchfilmpje:
sv: Länk till säljvideo:

source: The pitch video will be shared with relevant investors and should focus on your team, product, market, opportunity, stage of your company and what you are looking for. Product demos are also great. The video behind this link should be max 2 minutes.
fi: Esittelyvideo jaetaan sijoittajille. Videon kannattaa käsitellä tiimiä, tuotetta, markkinaa, nähtyjä mahdollisuuksia, yrityksen tilaa ja sitä, minkälaisia asioita olette hakemassa. Myös puhtaat tuote-esittelyt sopivat. Videon kesto kannattaa rajata noin kahteen minuuttiin.
fr: La vidéo de présentation sera partagée avec les investisseurs potentiels et devrait se concentrer sur votre équipe, votre produit, votre marché, votre opportunité, sur le stade auquel se trouve votre entreprise et sur ce que vous recherchez. Les démonstrations de produits sont également une bonne idée. La vidéo derrière ce lien ne devrait pas durer plus de deux minutes.
nl: Het pitchfilmpje zal worden gedeeld met relevante investeerders en moet de nadruk leggen op uw team, product, markt, mogelijkheden, fase van uw bedrijf en waar u naar op zoek bent. Productdemonstraties zijn ook erg goed. Het filmpje achter deze link mag maximaal 2 minuten zijn.
sv: Säljvideon kommer att delas med relevanta investerare och bör fokusera på ditt team, produkt, marknad, möjlighet, företagets status och det du letar efter. Produktdemonstrationer är också jättebra. Videon bakom denna länk bör vara max 2 minuter.

source: Change background
fi: Vaihda tausta
fr: Changer le fond d'écran
nl: Achtergrond wijzigen
sv: Ändra bakgrund

source: Communication
fi: Viestintävälineet
nl: Communicatie
sv: Kommunikation

source: Calendars
fi: Kalenterit
fr: Agendas
nl: Kalenders
sv: Kalendrar

source: Date picker
fi: Päivämäärän valitsin
fr: Sélecteur de date
nl: Datumprikker
sv: Datumväljare

source: Preset materials
fi: Ennalta-asetetut materiaalit
fr: Contenus prédéfinis
nl: Materialen vooraf instellen
sv: Förinställ material

source: Meeting location:
fi: Kokouspaikka:
fr: Lieu de la rencontre :
nl: Vergader locatie:
sv: Mötesplats:

source: The meeting location is fixed for this event.
fi: Tämän kokouksen sijainti on ennalta määritelty.
fr: Le lieu de rendez-vous est fixé pour cet événement.
nl: De vergaderingsplaats is vastgelegd voor dit evenement.
sv: Mötesplatsen för denna händelse går inte att ändra.

source: Default meeting location
fi: Oletuspaikka tapaamisille
fr: Lieu de rencontre par défaut
nl: Standaard vergaderlocatie
sv: Standard mötesplats

source: Choose the live communication tool for the scheduler.
fi: Valitse etätyökalu tälle tapaamiskalenterille.
fr: Choisir l'outil de communication en live pour le planificateur.
nl: Kies de tool voor live communicatie voor de planner.
sv: Välj det verktyg för schemaläggaren för kommunikation live.

source: Lync address (SIP)
fi: Lync-osoite (SIP)
fr: Adresse Lync (SIP)
nl: Lync-adres (SIP)
sv: Lync-adress (SIP)

source: Preset agenda and upload materials for all the meetings that are booked using this scheduler. You will be able to fine-tune each individual meeting before sharing the meeting page with participants.
fi: Määritä tämän tapaamiskalenterin kautta luoduille tapaamisille vakiomuotoinen agenda ja lataa ennalta määrätyt aineistot. Ennen tapaamissivun jakamista pääset vielä muokkaamaan ennalta asetettuja materiaaleja ja agendaa.
fr: Prédéfinissez un agenda et mettez en ligne des contenus pour tous les rendez-vous programmés en utilisant ce planificateur. Vous pourrez peaufiner chaque rendez-vous individuel avant de partager la page de rendez-vous avec les participants.
nl: Stel agenda vooraf in en upload materialen voor alle meetings die geboekt zijn door middel van deze planner. U zult in staat zijn om elke individuele meeting tot de puntjes uit te werken voor het delen van de meeting met deelnemers.
sv: Förinställ agendan och ladda upp material till alla möten som bokas med denna schemaläggare. Du kan skräddarsy varje individuellt möte innan du delar mötessidan med deltagarna.

source: Preset meeting title
fi: Ennalta-asetettu kokouksen nimi
fr: Prédéfinir titre de rendez-vous
nl: Stel titel meeting vooraf in
sv: Förinställ mötestitel

source: Preset meeting agenda
fi: Vakiomuotoinen agenda
fr: Prédéfinir agenda de rendez-vous
nl: Stel agenda meeting vooraf in
sv: Förinställ mötesagenda

source: Preset meeting materials are a PRO feature of Meetin.gs.
fi: Ennalta-asetetut materiaalit ovat PRO-ominaisuus.
fr: Les contenus de rendez-vous prédéfinis sont une fonctionnalité PRO de Meetin.gs.
nl: Het vooraf instellen van materialen voor de meeting is een PRO functie van Meetin.gs.
sv: Att förinställa mötesmaterial är en PRO-funktion i Meetin.gs.

source: Get your Meetin.gs PRO now to start enjoying all the features included in the full suite.
fi: Päivitä Meetin.gs-tilisi PRO versioon ja ala käyttämään tätä ja muita palvelun maksullisia ominaisuuksia.
fr: Obtenez dès maintenant votre Meetin.gs PRO pour profiter de toutes les fonctionnalités comprises dans la série complète.
nl: Krijg nu uw Meetin.gs PRO om te genieten van alle functies inbegrepen in de volledige versie.
sv: Skaffa Meetin.gs PRO nu och åtnjut alla funktioner som är inkluderade i paketet.

source: Start your free 30-day PRO trial to explore all the features included in the full suite.
fi: Aloita veloitukseton 30 päivän koekäyttöjakso kokeillaksesi kaikkia palvelun ominaisuuksia.
fr: Démarrez votre période d'essai PRO gratuite de 30 jours afin d'explorer toutes les fonctionnalités comprises dans la série complète.
nl: Start uw gratis PRO proefperiode van 30 dagen om alle functies te bekijken die bij de volledige versie zijn inbegrepen.
sv: Starta din gratis 30-dagars PRO testperiod för att undersöka alla funktioner som är inkluderade i det kompletta programmet.

source: Start your free trial
fi: Aloita ilmainen koekäyttö
fr: Démarrez votre période d'essai gratuite.
nl: Start met uw gratis proefperiode.
sv: Starta din gratis testperiod

source: Connect your Google Calendar so we can take your calendar into account:
fi: Yhdistä Google-kalenterisi palvelumme kanssa, jotta voimme huomioida sovitut tapaamisesi.
fr: Connectez votre Agenda Google pour que nous puissions prendre votre calendrier en compte :
nl: Verbind uw Google Kalender zodat we rekening kunnen houden met uw kalender:
sv: Anslut din Google Kalender så att vi kan ta med din kalender i beräkning:

source: Preview availability
fi: Esikatselu
fr: Aperçu de la disponibilité
nl: Voorbeeld beschikbaarheid
sv: Tillgänglighet för förhandsvisning

source: Time zone:
fi: Aikavyöhyke:
fr: Fuseau horaire :
nl: Tijdzone:
sv: Tidszon:

source: Set time zone for the times shown
fi: Aseta aikavyöhyke näytettäviä aikoja varten
fr: Établir le fuseau horaires pour les heures affichées
nl: Stel tijdzone in voor de getoonde tijden
sv: Ställ in tidszon för tiderna som visas

source: Highlight the times you want to make available for others to schedule a meeting with you at %1$s:
fi: Merkkaa vihreäksi ne ajat, joina haluat mahdollistaa tapaamisten sopimisen kanssasi tilaisuudessa %1$s:
fr: Mettez en évidence les heures que vous voulez rendre disponibles pour les autres pour arranger une rencontre avec vous à %1$s :
nl: Markeer de tijdstippen die u beschikbaar wilt maken voor anderen om een vergadering met u te plannen op %1$s:
sv: Markera tiderna du vill göra tillgängliga för andra, att schemalägga ett möte med dig på %1$s:

source: People can schedule a meeting with me only between the time slots highlighted below on a weekly basis:
fi: Kanssani voi sopia kokouksia viikoittain ainoastaan alapuolella korostettuina aikoina:
fr: Les gens ne peuvent arranger une rencontre avec moi que durant les périodes mises en évidence ci-dessous toutes les semaines :
nl: Mensen kunnen alleen op de hieronder gemarkeerde uren wekelijks een vergadering met mij plannen.
sv: Personer kan endast schemalägga ett möte med mig mellan tidsluckorna markerade nedan, varje vecka:

source: Note: Your Google Calendar will be taken into account to further block out unavailable time slots.
fi: Huom: Google-kalenteriisi tehdyt merkinnät huomioidaan, kun rajaamme mahdollisia tapaamisaikoja.
fr: Note : Votre Agenda Google sera pris en compte pour bloquer ultérieurement les périodes indisponibles.
nl: Let op: Er wordt rekening gehouden met uw Google Kalender om onbeschikbare uren te blokkeren.
sv: Obs: Din Google Kalender kommer att räknas med för att vidare räkna bort otillgängliga tidsluckor.

source: Previous meeting
fi: Edellinen tapaaminen
fr: Réunion précédente
nl: Vorige vergadering
sv: Tidigare möte.

source: Next meeting
fi: Seuraava tapaaminen
fr: Prochaine réunion
nl: Volgende vergadering
sv: Nästa möte.

source: Meeting length
fi: Tapaamisen kesto
fr: Durée du rendez-vous
nl: Vergaderingslengte
sv: Möteslängd

source: The meeting length is fixed for this event.
fi: Kokousten kesto on ennalta määrätty tässä tilaisuudessa.
fr: La durée de la rencontre est fixée pour cet événement.
nl: De vergaderingslengte is vastgelegd voor dit evenement.
sv: Möteslängden för denna händelse kan inte ändras.

source: Time between meetings
fi: Tapaamisten välille varattu aika
fr: Temps entre les rencontres
nl: Tijd tussen vergaderingen
sv: Tid mellan möten

source: Reserve time between meetings
fi: Varaa aikaa tapaamisten välille
fr: Réserver du temps entre des réunions
nl: Maak tijd vrij tussen vergaderingen
sv: Reservera tid mellan möten

source: Advance notice
fi: Etukäteisilmoitus
fr: Avancer la notification
nl: Voorafgaande kennisgeving
sv: Förhandsavisering

source: Remove scheduler
fi: Poista tapaamiskalenteri
fr: Retirer le planificateur
nl: Verwijder planner
sv: Ta bort schemaläggare

source: Are you sure you want to remove %1$s. There is no undo.
fi: Oletko varma, että haluat poistaa tapaamiskalenterin %1$s? Toimintoa ei voi peruuttaa.
fr: Êtes-vous sûr de vouloir supprimer %1$s. Il est impossible d'annuler.
nl: Weet u zeker dat u %1$s wilt verwijderen? U kunt deze beslissing niet ongedaan maken.
sv: Är du säker på att du vill ta bort %1$s? Det går inte att ångra.

source: view page
fi: Katso sivu
fr: voir la page
nl: pagina bekijken
sv: visa sida

source: sharing
fi: Jakaminen
fr: Partage
nl: delen
sv: delning

source: skip
fi: ohita
fr: passer
nl: sla over
sv: hoppa över

source: Configure your %(B$Meet Me%) page
fi: Määrittele tapaamissivusi asetukset
fr: Configurez votre page %(B$Me Rencontrer%)
nl: Configureer uw %(B$Meet Me%) pagina
sv: Konfigurera din %(B$Möt mig%)-sida

source: Claim your free %(B$Meet Me%) page now
fi: Varaa ilmainen %(B$Meet Me%) -sivusi nyt
fr: Demandez votre page %(B$Rencontrez-moi%) gratuite dès maintenant
nl: Eis uw gratis %(B$Ontmoet me%) pagina nu
sv: Få din gratis %(B$Möta mig%) sida nu

source: Edit profile
fi: Muokkaa profiilia
fr: Éditer le profil
nl: Profiel bewerken
sv: Redigera profil

source: Welcome to my meet me page. Unfortunately I have not made any of my calendars public yet!
fi: Tervetuloa tapaamissivulleni. Valitettavasti en ole asettanut yhtään tapaamiskalenteriani julkiseksi.
fr: Bienvenue sur ma page rencontrez-moi. Malheureusement je n'ai rendu aucun de mes agendas public pour le moment !
nl: Welkom op mijn 'ontmoet me'-pagina. Helaas heb ik nog geen van mijn agenda's openbaar gemaakt.
sv: Välkommen till min Möt mig-sidan. Tyvärr har jag inte ännu publicerat mina kalendrar.

source: Welcome to my meet me page. Please choose what kind of a meeting you would like to schedule with me below:
fi: Tervetuloa tapaamissivulleni. Valitse alta minkälaisen tapaamisen haluaisit järjestää kanssani.
fr: Bienvenue sur ma page « me rencontrer ». Merci de choisir le type de réunion que vous souhaitez programmer avec moi ci-dessous :
nl: Welkom op mijn 'ontmoet me'-pagina. Kies hieronder wat voor soort ontmoeting je graag met mij af wil spreken.
sv: Välkommen till min Möt mig -sidan. Var god och välj vilken typ av möte du vill schemalägga med mig nedan:

source: Edit greeting text
fi: Muokkaa tervehdystekstiä.
fr: Modifier texte de salutation
nl: Bewerk begroetingstekst
sv: Redigera välkomsttexten

source: Drag to reorder
fi: Järjestä uudestaan raahaamalla
fr: Faites glisser pour réarranger
nl: Sleep om te herorganiseren
sv: Dra för att ändra ordningsföljden

source: Meeting with
fi: Tapaa
fr: Réunion avec
nl: Meeting met
sv: Möte med

source: Private
fi: Yksityinen
fr: Privé
nl: Privé
sv: Privat

source: Remove Meet Me page
fi: Poista Meet Me sivu
fr: Enlever la page Rencontrez-moi
nl: Verwijder Ontmoet Mij pagina
sv: Ta bort Meet Me-sidan

source: Add new meeting scheduler
fi: Lisää uusi tapaamiskalenteri
fr: Ajouter un nouveau planificateur de rencontre
nl: Voeg nieuwe vergaderplanner toe
sv: Lägg till ny mötesschemaläggare

source: Start by adding your first meeting scheduler
fi: Luo ensimmäinen tapaamiskalenterisi
fr: Commencez en ajoutant votre premier planificateur de rencontre
nl: Begin met het toevoegen van uw eerste vergaderplanner
sv: Börja med att lägga till din första mötesschemaläggare

source: Edit welcoming text
fi: Muokkaa tervetulo-tekstiä
fr: Éditer le texte de bienvenue
nl: Bewerk welkomsttekst
sv: Redigera välkomsttext

source: Hello! I have made my calendar available to you. Please click on the button below to start scheduling the meeting.
fi: Hei! Tässä avoin kokouskalenterini, jonka kautta löydät meille helposti yhteisen tapaamisajan. Aloita ajan haku alla olevasta painikkeesta.
fr: Bonjour ! Je vous ai donné accès à mon agenda. Veuillez cliquer sur le bouton ci-dessous pour commencer à planifier la rencontre.
nl: Hallo! Ik heb mijn kalender beschikbaar voor u gemaakt. Klik o onderstaande knop om te beginnen met het plannen van de vergadering.
sv: Hej! Jag har gjort min kalender tillgänglig för dig. Vänligen klicka på knappen nedan för att börja schemalägga mötet.

source: --- Select ---
fi: --- Valitse ---
fr: --- Sélectionner ---
nl: --- Selecteren ---
sv: --- Välj ---

source: Main Meet me page
fi: Ensisijainen Meet Me -sivu
fr: Page Me Rencontrer principale
nl: Belangrijkste Meet Me pagina
sv: Huvudsaklig Möt mig-sida

source: The time period has been set as:
fi: Aikajakso on määritelty seuraavasti:
fr: La période a été réglée pour :
nl: De periode is ingesteld als:
sv: Tidsperioden har ställts in som:

source: Scheduler availability
fi: Tavoitettavuus kalenterissa
fr: Disponibilité du planificateur
nl: Beschikbaarheid van de dienstregeling
sv: Schemaläggarens tillgänglighet

source: Live starting today
fi: Tästä päivästä lähtien
fr: En direct à commencer d'aujourd'hui
nl: Live vanaf vandaag
sv: Live börjar idag

source: Preset time period
fi: Ennalta määrättynä ajanjaksona
fr: Période de temps préréglée
nl: Tijdsperiode vooraf instellen
sv: Förinställd tidsperiod

source: Starting date and time
fi: Aloitusajankohta
fr: Date et heure de démarrage
nl: Begindatum en -tijd
sv: Startdatum och -tid

source: Ending date and time
fi: Lopetusaika
fr: Date et heure de fin
nl: Einddatum en -tijd
sv: Slutdatum och -tid

source: Checking url...
fi: Tarkastetaan osoitetta...
fr: Vérification de l'URL
nl: URL controleren...
sv: Kollar url...

source: Share your %(B$meet me%) page
fi: Jaa %(B$tapaamissivusi%)
fr: Partagez votre page %(B$Me Rencontrer%)
nl: Deel uw %(B$meet me%) pagina
sv: Dela din %(B$möt mig%)-sida

source: Continue
fi: Jatka
fr: Continuer
nl: Doorgaan
sv: Fortsätt

source: Back
fi: Takaisin
fr: Retour
nl: Terug
sv: Tillbaka

source: Choose Meet Me Page to share:
fi: Valitse jaettava tapaamissivu:
fr: Choisissez une page Me Rencontrer à partager :
nl: Kies ervoor Meet Me P
sv: Välj Möt mig-sida att dela:

source: Meet Me Cover Page
fi: Meet Me -kansisivu
fr: Page de couverture « me rencontrer »
nl: Meet Me Voorpagina
sv: Möt mig-framsida

source: Default Meet Me page
fi: Oletus Meet Me -sivu
fr: Page Me Rencontrer par défaut
nl: Standaard Meet Me pagina
sv: Standard Möt mig-sida

source: Copy to clipboard
fi: Kopioi leikepöydälle
fr: Copier dans le presse-papiers
nl: Kopiëren naar plakbord
sv: Kopiera till urklipp

source: Copy and paste the following tagline to your email signature:
fi: Kopioi ja liitä tämä sähköpostisi allekirjoitukseen:
fr: Copiez-collez le slogan suivant dans votre signature e-mail :
nl: Kopieer en plak de volgende tagline naar uw e-mail handtekening:
sv: Kopiera och klistra in den följande taglinen till din e-postsignatur:

source: Schedule a meeting: %1$s
fi: Löydä aika kokoukselle: %1$s
fr: Organiser une rencontre : %1$s
nl: Plan een vergadering: %1$s
sv: Schemalägg ett möte: %1$s

source: Share with your social networks
fi: Jaa sosiaalisissa kanavissa
fr: Partager avec vos réseaux sociaux
nl: Deel met uw sociale netwerken
sv: Dela med dina sociala nätverk

source: Share the Meet Me page with the contacts in your social networks:
fi: Jaa tapaamissivu sosiaalisissa verkostoissa olevien kontaktiesi kanssa
fr: Partagez la page Rencontrez-moi avec les contacts de vos réseaux sociaux :
nl: Deel de Meet Me pagina met de contacten in je sociale netwerken:
sv: Dela Möt mig-sidan med kontakterna i dina sociala nätverk:
