Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_front-*.po
Languages: fi, fr, nl, sv

source: Type an email, a name or a meeting name
fi: Syötä sähköposti, henkilön nimi tai kokouksen nimi.
fr: Entrez un e-mail, un nom ou un nom de réunion
nl: Typ een e-mail, een naam of de naam van een meeting
sv: Ange en e-postadress, ett namn eller namnet på ett möte

source: HINT: You can also copy & paste a list of email addresses above (separated by a comma).
fi: Vinkki: Voit myös kopioida tähän sähköpostiosoitelistan (osoitteet pilkulla eroteltuna).
fr: CONSEIL : Vous pouvez également copier-coller une liste d'adresses e-mail ci-dessus (séparées par des virgules).
nl: TIP: Je kunt ook een lijst van e-mailadressen hierboven kopiëren en plakken (gescheiden door een komma).
sv: TIPS: Du kan även kopiera och klistra in en lista av e-postadresser ovan (separerade med kommatecken).

source: not found.
fi: Ei löydy.
fr: non trouvé(e).
nl: niet gevonden.
sv: hittades ej

source: not found yet, we are still working to fetch your contacts...
fi: Mitään ei löytynyt. Käsittelemme edelleen yhteystietojasi...
fr: pas encore trouvés, nous continuons d'essayer de rapatrier vos contacts…
nl: nog niet gevonden, we zijn nog bezig je contacten op te halen....
sv: ej hittad ännu, vi håller fortfarande på att hämta dina kontakter...

source: Address book is empty.
fi: Osoitekirja on tyhjä.
fr: Le carnet d'adresse est vide.
nl: Adresboek is leeg.
sv: Den här adressboken är tom.

source: We are working hard to fetch your contacts...
fi: Työskentelemme hakeaksemme yhteystietojasi...
fr: Nous faisons de notre mieux pour rapatrier vos contacts…
nl: We zijn bezig je contacten op te halen....
sv: Vi håller på att hämta dina kontakter...

source: Address book
fi: Osoitekirja
fr: Carnet d'adresses
nl: Adresboek
sv: Adressbok

source: Add all
fi: Lisää kaikki
fr: Tout ajouter
nl: Voeg alles toe
sv: Lägg till alla

source: Selected:
fi: Valittu:
fr: Sélectionné(e) :
nl: Geselecteerd:
sv: Markerade:

source: Click here to select all
fi: Valitse tästä kaikki
fr: Cliquez ici pour tout sélectionner
nl: Klik hier om alles te selecteren
sv: Klicka här för att markera alla

source: Add
fi: Lisää
fr: Ajouter
nl: Toevoegen
sv: Lägg till

source: %1$s is already added.
fi: %1$s on jo lisätty.
fr: %1$s a déjà été ajouté(e).
nl: %1$s is al toegevoegd
sv: %1$s har redan lagts till.

source: Add %1$s
fi: Lisää %1$s
fr: Ajouter %1$s
nl: Voeg %1$s toe
sv: Lägg till %1$s

source: Email is required.
fi: Sähköposti vaaditaan.
fr: L'e-mail est requis.
nl: E-mail is vereist.
sv: E-postadress måste anges.

source: Sorry, the 15 min reservation on the slot expired and we freed it. Please try again.
fi: Valintasi vanhentui ja aika vapautettiin jälleen muiden saataville. Poimittuasi ajan, sinulla on 15 minuuttia aikaa vahvistaa valintasi. Ole hyvä ja yritä uudstaan.
fr: Désolés, les 15 minutes de réservation du créneau ont expiré et il a été libéré. Veuillez réessayer.
nl: Sorry, de reservering van 15 minuten van de ruimte is verlopen en we hebben het vrijgegeven. Probeer het opnieuw.
sv: Tyvärr gick 15 min-reservationen på platsen ut och vi frigjorde den. Försök igen.

source: Saving profile failed. Please try again!
fi: Profiilin tallennus epäonnistui. Ole hyvä ja yritä uudestaan.
fr: La sauvegarde du profil a échoué. Veuillez réessayer !
nl: Opslaan van het profiel mislukt. Probeer het opnieuw.
sv: Sparande av profil misslyckades. Var god försök igen!

source: Loading calendar...
fi: Ladataan kalenteria...
fr: Chargement du calendrier...
nl: Agenda wordt geladen...
sv: Laddar kalender...

source: Searching for free times...
fi: Haetaan vapaita aikoja...
fr: Recherche d'heures libres...
nl: Zoeken naar onbelemmerde tijden...
sv: Söker efter lediga tider...

source: Stopped searching after 8 weeks with no free times.
fi: Emme löytäneet vapaita aikoja seuraavaan kahdeksaan viikkoon. Haku lopetettiin.
fr: Arrêt des recherches après 8 semaines sans temps libre.
nl: Gestopt met zoeken na 8 weken met geen beschikbare tijden.
sv: Slutat söka efter 8 veckor utan lediga tider.

source: Reserving...
fi: Varataan...
fr: Réservation…
nl: Reservering bezig...
sv: Reserverar ...

source: Oops, something went wrong. Please try again!
fi: Jokin meni pieleen. Yritä uudelleen!
fr: Oups, une erreur est survenue. Merci de réessayer !
nl: Jammer, er ging iets mis. Probeer het opnieuw!
sv: Hoppsan, något blev fel. Försök igen!

source: Elisa (Finland)
fi: Elisa (Suomessa)
fr: Elisa (Finlande)

source: 9 EUR / month
fi: 9 EUR / kuukausi
fr: 9 EUR / mois
nl: 9 EUR/maand
sv: 9 Euro/månad

source: Telia (Sweden)
fi: Telia (Ruotsissa)
fr: Telia (Suède)
nl: Telia (Zweden)
sv: Telia (Sverige)

source: 79 SEK / month
fi: 79 SEK / kuukausi
fr: 79 SEK / mois
nl: 79 SEK/maand
sv: 79 kr/månad

source: Saving...
fi: Tallennetaan...
fr: Enregistrement…
nl: Aan het opslaan...
sv: Sparar...

source: Done
fi: Valmis
fr: Fait
nl: Klaar
sv: färdig

source: No free times for week %1$s.
fi: Viikolla %1$s ei ole vapaita aikoja.
fr: Aucun horaire de libre pour la semaine %1$s.
nl: Geen beschikbare tijden voor week %1$s.
sv: Inga lediga tider i vecka %1$s.

source: Choose
fi: Valitse
fr: Choisir
nl: Kies
sv: Välj

source: Are you sure you want to leave the page? Unsaved changes will be lost. Save changes by clicking the "Save" button below the editor.
fi: Oletko varma, että haluat poistua sivulta? Tallentamattomat muutokset menetetään. Tallenna muutokset painamalla "Tallenna"-painiketta sivun alaosasta.
fr: Êtes-vous sûr(e) de vouloir quitter la page ? Toute modification non enregistrée sera perdue. Enregistrez les modifications en cliquant sur le bouton « Enregistrer » sous l'éditeur.
nl: Weet u zeker dat u de pagina wilt verlaten? Niet opgeslagen wijzigingen zullen verloren gaan. Sla wijzigingen op door op "Opslaan" te klikken, onder de bewerker.
sv: Är du säker på att du vill lämna sidan? Ändringar som inte sparats går förlorade. Spara ändringarna genom att klicka på "Spara"-knappen nedanför redigeraren.

source: Creating follow-up...
fi: Luodaan seuraavaa kokousta...
fr: Création de la suite…
nl: Follow-up creëren
sv: Skapar uppföljning...

source: Invite resent for %1$s
fi: Uusi kutsu lähetetty käyttäjälle %1$s
fr: Invitation pour %1$s envoyée à nouveau
nl: Uitnodiging opnieuw zenden voor %1$s
sv: Inbjudan har skickats igen beträffande %1$s

source: %1$s has been removed succesfully
fi: %1$s on nyt poistettu
fr: %1$s a été retiré(e) avec succès
nl: %1$s is succesvol verwijderd
sv: %1$s har tagits bort

source: Uploading %1$s
fi: Lähetetään %1$s
fr: Envoi de %1$s
nl: Aan het uploaden %1$s
sv: Laddar upp %1$s

source: Search for a city or a location:
fi: Etsi kaupunkia tai sijaintia:
fr: Chercher une ville ou un lieu :
nl: Zoek naar een stad of een locatie:
sv: Sök efter en stad eller plats.

source: No nearby locations found for %1$s people on %2$s.
fi: Läheltä ei löydetty tilaa %1$s hengelle aikana %2$s.
fr: Aucun lieu à proximité n'a été trouvé pour %1$s personnes sur %2$s.
nl: Geen nabije locaties gevonden voor %1$s mensen op %2$s.
sv: Inga näraliggande platser hittades för %1$s deltagare den %2$s.

source: Added following pending users: %1$s
fi: Uusia käyttäjiä, joilta odotetaan vahvistusta: %1$s
fr: Les utilisateurs en attente suivants ont été ajoutés : %1$s
nl: Volgende openstaande gebruikers toegevoegd: %1$
sv: Följande deltagare har lagts till i avvaktan på svar: %1$s

source: You need to add people.
fi: Sinun täytyy lisätä henkilöitä.
fr: Vous devez ajouter des personnes.
nl: U moet mensen toevoegen.
sv: Du måste lägga till deltagare.

source: Meeting confirmed
fi: Tapaaminen on vahvistettu
fr: Réunion confirmée
nl: Vergadering bevestigd
sv: Mötet bekräftades

source: You are now "Attending".
fi: Sinut on merkitty läsnäolevaksi.
fr: Vous êtes maintenant « Présent »
nl: U "neemt nu deel"
sv: Du är nu "Deltagare".

source: You are now "Not Attending".
fi: Sinut on merkitty poissolevaksi.
fr: Vous êtes maintenant « Absent ».
nl: U "Neemt nu geen deel"
sv: Du är nu "Icke deltagare".

source: Upload photo
fi: Lähetä kuva
fr: Envoyer une photo
nl: Foto uploaden
sv: Ladda upp ett foto

source: Uploading done. Processing.
fi: Valmis. Tiedostoa käsitellään.
fr: Mise en ligne terminée. Traitement en cours.
nl: Het uploaden is gedaan. Verwerking.
sv: Uppladdning avslutad. Behandlar.

source: Are you sure you want to change the material? Unsaved changes will be lost. Save changes by clicking the "Save" button below the editor.
fi: Oletko varma, että haluat vaihtaa käsiteltävää kokousmateriaalia? Tallentamattomat muutokset katoavat. Tallenna muutokset painamalla "Tallenna"-painiketta tekstieditorin alapuolella.
fr: Voulez-vous vraiment changer le contenu ? Les changements non-enregistrés seront perdus. Enregistrez les changements en cliquant sur le bouton « Enregistrer » sous l'éditeur.
nl: Weet u zeker dat u het materiaal wilt wijzigen? Niet opgeslagen wijzigingen zullen verloren gaan. Sla wijzigingen op door op "Opslaan" te klikken onder de editor.
sv: Är du säker på att du vill ändra materialet? Ändringar som inte sparats förloras. Spara ändringar genom att klicka på knappen "Spara" under redigeraren.

source: Oops, we couldn't find any future meetings. Please click "Continue with blank" to continue manually.
fi: Emme löytäneet yhtään tulevaa kokousta. Paina "jatka tyhjällä" jatkaaksesi manuaalista kokouksenluontia.
fr: Oups, aucune réunion future n'a été trouvée. Veuillez cliquer sur « Continuer avec une réunion vierge » pour continuer manuellement.
nl: Oeps, we konden geen toekomstige vergaderingen vinden. "Ga door met blanco" om handmatig door te gaan.
sv: Hoppsan, vi kunde inte hitta några framtida möten. Klicka på "Fortsätt med tom" för att fortsätta manuellt.

source: Untitled meeting
fi: Nimetön kokous
fr: Rendez-vous sans titre
nl: Naamloze vergadering
sv: Möte utan rubrik

source: Next
fi: Seuraava
fr: Suivant
nl: Volgend
sv: Nästa

source: People have shared these materials. Click on a material to see more of it.
fi: Osallistujat ovat jakaneet oheiset kokousmateriaalit. Voit painaa kutakin nähdäksesi enemmän.
fr: Des personnes ont partagé ces contenus. Cliquez sur un contenu pour en voir les détails.
nl: Mensen hebben deze dingen gedeeld. Klik op iets om er meer van te zien.
sv: Många har delat det här materialet. Klicka på ett material för att se mer av det.

source: Meeting Materials
fi: Materiaalit
fr: Contenus de rendez-vous
nl: Hulpmiddelen voor afspraken
sv: Mötesmaterial

source: Here you can comment and print the selected material.
fi: Voit kommentoida ja printata valitun materiaalin.
fr: Ici vous pouvez commenter et imprimer le contenu sélectionné.
nl: Hier kun je het geselecteerde materiaal becommentariëren en printen.
sv: Här kan du kommentera och skriva ut det valda materialet.

source: Current Material Preview
fi: Materiaalin esikatselu
fr: Aperçu du contenu actuel
nl: Inzage vooraf in het huidige materiaal
sv: Förhandsgranskning av aktuellt material

source: These people will get notified if materials or meeting details change. You can invite more people from the 'invite' button.
fi: Nämä henkilöt saavat ilmoituksen, mikäli kokousmateriaaleja tai kokouksen tietoja muutetaan. Voit kutsua lisää osanottajia painamalla "Kutsu"-painiketta.
fr: Ces personnes seront prévenues si des contenus ou certaines informations concernant le rendez-vous changent. Vous pouvez inviter davantage de personnes avec le bouton « inviter ».
nl: Deze mensen krijgen bericht, wanneer materiaal of details over de meeting veranderen. Je kunt meer mensen uitnodigen via de knop 'uitnodiging'.
sv: De här människorna kommer att meddelas som material eller mötesdetaljer ändras. Du kan bjuda in fler människor via knappen "bjud in".

source: Meeting Participants
fi: Kokouksen osallistujat
fr: Participants au rendez-vous
nl: Deelnemers aan de meeting
sv: Mötesdeltagare

source: Thanks!
fi: Kiitos!
fr: Merci !
nl: Dank je!
sv: Tack!

source: Do you like what you see? Open the menu and click the Add new -button to start organizing meetings - give it a try, it's free.
fi: Pidätkö näkemästäsi? Klikkaa painiketta helpoittaaksesi tapaamisten järjestämistä ja parantaaksesi niiden laatua. Palvelu on ilmainen. Kokeile heti.
fr: Aimez-vous ce que vous voyez ? Ouvrez le menu et cliquez sur le bouton Ajouter nouveau pour commencer à organiser vos rendez-vous - faites l'essai, c'est gratuit.
nl: Bevalt het u wat u ziet? Open het menu en klik op de knop "nieuw toevoegen" om te beginnen met het organiseren van vergaderingen - probeer het, het is gratis.
sv: Tycker du om det du ser? Öppna menyn och klicka på Lägg till ny-knappen för att börja organisera möten - prova på, det är gratis.

source: Organize Your Own Meetings
fi: Järjestä oma kokouksesi
fr: Organisez vos propres rendez-vous.
nl: Organiseer je eigen meetings
sv: Organisera dina egna möten

source: To help you out, we copied over the previous meeting's title, location, participants and materials. The meeting is now a draft. Feel free to change everything as you like. You at least need to specify the date.
fi: Kopioimme aikasemmasta kokouksesta nimen, sijainnin, osallistujat ja kokousmateriaalit. Kokous on edelleen luonnos, joten voit tehdä rauhassa muutoksia kokoussivulle. Suosittelemme ainakin määrittämään kokoukselle ajankohdan.
fr: Pour vous aider, nous avons copié le titre du rendez-vous précédent, le lieu, les participants et les contenus. Le rendez-vous est maintenant un brouillon. Vous êtes libre de changer tout ce qui plaît. Vous devez au moins préciser la date.
nl: Om je te helpen hebben we van de voorgaande meetings de titel, plaats, deelnemers en materialen gekopieerd. De meeting is nu in ontwerp. Voel je vrij om alles wat je wilt te veranderen. Je moet minimaal de datum specificeren.
sv: För att hjälpa dig har vi kopierat det tidigare mötets rubrik, plats, deltagare och underlag. Mötet är nu ett förslag. Du kan ändra allt efter dina önskemål. Du måste ange ett datum.

source: Meeting contents copied over
fi: Kokouksen sisältö kopioitu
fr: Contenus de rendez-vous copiés
nl: De inhoud van de meeting gekopieerd
sv: Mötesinnehållet kopieras över

source: Hide
fi: Piilota
fr: Cacher
nl: Verberg
sv: Dölj

source: Never show again
fi: Älä näytä uudestaan
fr: Ne plus afficher
nl: Laat niet meer zien
sv: Visa aldrig igen

source: Note: This will be in the title of the invitation email.
fi: Huom: Tämä tulee näkymään kutsuviestin otsikossa.
fr: Remarque : Cela apparaîtra dans le titre du courriel d'invitation.
nl: Let op: Dit komt in de titel van uitnodigingsmail.
sv: Obs! Detta kommer att stå i rubriken på inbjudningsmailet.

source: Set the meeting title
fi: Aseta kokouksen otsikko
fr: Définir le titre du rendez-vous
nl: Stel de titel van de meeting in
sv: Ange mötesrubriken

source: Hint: You can add multiple suggestions, if you don't know the date yet.
fi: Vinkki: Mikäli ajankohtaa ei ole vielä sovittu, voit ehdottaa useita aikoja.
fr: Astuce : Vous pouvez ajouter plusieurs suggestions, si vous ne connaissez pas encore la date.
nl: Tip: Je kunt verschillende voorstellen toevoegen, als je de datum nog niet weet.
sv: Tips: du kan lägga till flera förslag, om du inte känner till datum ännu.

source: Set the meeting date
fi: Valitse kokouksen ajankohta
fr: Fixer la date de rendez-vous
nl: Stel de datum voor de meeting vast
sv: Ställ in mötesdatum

source: Note: We won't send the invitations until you are ready.
fi: Huom: Kutsut lähetetään vasta kun olet valmis.
fr: Remarque : Nous n'enverrons pas les invitations avant que vous soyez prêt.
nl: Let wel: We sturen de uitnodigingen niet voor je klaar bent.
sv: Obs! Vi skickar inga inbjudningar förrän du är klar.

source: Add meeting participants
fi: Lisää osallistujia
fr: Ajouter des participants au rendez-vous
nl: Voeg deelnemers aan de meeting toe
sv: Lägg till mötesdeltagare

source: Hint: The meeting can be online, face-to-face or both.
fi: Vinkki: Kokoukset voidaan järjestää etänä, kasvotusten tai kumpaakin keinoa käyttäen.
fr: Astuce : le rendez-vous peut être en ligne, en tête-à-tête ou les deux.
nl: Tip: De meeting kan online zijn, face-to-face of beide.
sv: Tips: Mötet kan vara online, öga-mot-öga eller båda.

source: Set the meeting location
fi: Valitse kokouspaikka
fr: Fixer le lieu du rendez-vous
nl: Stel de ontmoetingsplaats vast
sv: Ställ in plats för mötet

source: Note: We will send the agenda later with the invitation email.
fi: Huom: Agenda toimitetaan kutsuviestin yhteydessä.
fr: Remarque : Nous enverrons l'agenda plus tard avec le courriel d'invitation.
nl: Let op: We sturen de agenda later met de mail ter uitnodiging.
sv: Obs: vi skickar agendan senare med inbjudningsmailet.

source: Fill in the agenda
fi: Täytä agenda
fr: Remplir l'agenda
nl: Vul de agenda in
sv: Fyll i agendan

source: End tutorial
fi: Päätä pikaohjeistus
fr: Terminer le tutoriel
nl: Einde handleiding
sv: Avsluta lektionen

source: You can also drag & drop materials from your desktop.%(N$%)%(N$%) Hint: Participants will be able to comment the materials.
fi: Voit raahata materiaalit tähän suoraan työpöydältäsi. %(N$%)%(N$%) Vinkki: Osallistujat pääsevät kommentoimaan heille jaettuja kokousmateriaaleja.
fr: Vous pouvez également faire glisser et déposer des contenus depuis votre bureau. %(N$%)%(N$%) Astuce : Les participants auront las possibilité de commenter les contenus.
nl: Je kunt ook materiaal van je desktop halen en plaatsen.%(N$%)%(N$%) Tip: Deelnemers kunnen opmerkingen over het materiaal maken.
sv: Du kan också dra-och-släppa material från ditt skrivbord.%(N$%)%(N$%) Tips: deltagarna kommer att kunna kommentera materialet.

source: Add materials
fi: Lisää materiaali
fr: Ajouter des contenus
nl: Voeg materiaal toe
sv: Lägg till material

source: No results found.
fi: Yhtään osumaa ei löytynyt.
fr: Aucun résultat trouvé.
nl: Geen resultaten gevonden.
sv: Inga resultat hittades.

source: We screwed up. Please try refreshing the page.
fi: Jokin meni vikaan. Yritä ladata sivu uudestaan.
fr: Nous avons fait une boulette. Veuillez recharger la page.
nl: We hebben het verprutst. Probeer de pagina te verversen.
sv: Vi gjorde fel. Uppdatera sidan.

source: please check your network connection and reload the page
fi: Tarkista verkkoyhteytesi ja lataa sivu uudelleen
fr: veuillez vérifier votre connexion au réseau et recharger la page
nl: Check je netwerkverbinding en laad de pagina opnieuw
sv: kontrollera din nätverksanslutning och ladda om sidan

source: Sorry, this Meet Me calendar has expired.
fi: Pahoittelut, tämä Meet Me -tapaamiskalenteri on vanhentunut.
fr: Désolé, cet agenda Rencontrez-moi a expiré.
nl: Sorry, deze 'Ontmoet me'-kalender is verlopen.
sv: Tyvärr har den här Träffa mig-kalendern gått ut.

source: %1$s of January
fi: %1$s. tammikuuta
fr: %1$ de janvier
nl: %1$s januari
sv: den %1$s januari

source: %1$s of February
fi: %1$s. helmikuuta
fr: %1$s de février
nl: %1$s februari
sv: den %1$s februari

source: %1$s of March
fi: %1$s. maaliskuuta
fr: %1$s de mars
nl: %1$s maart
sv: den %1$s mars

source: %1$s of April
fi: %1$s. huhtikuuta
fr: %1$s d'avril
nl: %1$s april
sv: den %1$s april

source: %1$s of May
fi: %1$s. toukokuuta
fr: %1$s mai
nl: %1$s mei
sv: den %1$s maj

source: %1$s of June
fi: %1$s. kesäkuuta
fr: %1$s juin
nl: %1$s juni
sv: den %1$s juni

source: %1$s of July
fi: %1$s. heinäkuuta
fr: %1$s juillet
nl: %1$s juli
sv: den %1$s juli

source: %1$s of August
fi: %1$s. elokuuta
fr: %1$s d'août
nl: %1$s augustus
sv: den %1$s augusti

source: %1$s of September
fi: %1$s. syyskuuta
fr: %1$s de septembre
nl: %1$s september
sv: den %1$s september

source: %1$s of October
fi: %1$s. lokakuuta
fr: %1$s d'octobre
nl: %1$s oktober
sv: den %1$s oktober

source: %1$s of November
fi: %1$s. marraskuuta
fr: %1$s de novembre
nl: %1$s november
sv: den %1$s november

source: %1$s of December
fi: %1$s. joulukuuta
fr: %1$s décembre
nl: %1$s december
sv: den %1$s december

source: Live communication tools disabled for this event.
fi: Viestintävälineitä ei voi käyttää tämän tapahtuman yhteydessä.
fr: Outils de communication en direct désactivés pour cet événement.
nl: Live-communicatie-instrumenten uitgeschakeld voor deze afspraak.
sv: Verktyg för livekommunikation har avaktiverats inför detta evenemang.

source: Working...
fi: Odota...
fr: En cours ...
nl: Aan het werken...
sv: Jobbar...

source: Meeting
fi: Tapaaminen
fr: Rencontre
nl: Vergadering
sv: Möte

source: E.g. if booked now, the first available meeting slot would be on %1$s.
fi: Esim. Tästä hetkestä laskien ensimmäinen mahdollinen tapaamisaika olisi %1$s.
fr: Par exemple, pour une réservation immédiate, le premier créneau horaire de réunion disponible serait le %1$s.
nl: bv. als u de vergadering nu boekt, zou de eerste beschikbare vergadering op %1$s plaatsvinden.
sv: Det vill säga, om du bokar det nu är den första lediga mötestiden %1$s.

source: You don't have any notifications yet.
fi: Sinulle ei ole ilmoituksia.
fr: Vous n'avez encore pas de notifications.
nl: U hebt nog geen notificaties.
sv: Du har inte fått några notifieringar ännu.

source: Starting...
fi: Aloitetaan...
fr: Démarrage…
nl: Aan het starten...
sv: Börjar...

source: Yesterday
fi: Eilen
fr: Hier
nl: Gisteren
sv: Igår

source: This week
fi: Tällä viikolla
fr: Cette semaine
nl: Deze week
sv: Den här veckan

source: Last week
fi: Viime viikko
fr: La semaine dernière
nl: Vorige week
sv: Förra veckan

source: Past
fi: Menneet kokoukset
fr: Passé
nl: Verleden
sv: Föregående

source: Scheduling
fi: Tapaamisajan sopiminen
fr: Programmation
nl: Aan het plannen
sv: Tidsplanering

source: Tasks
fi: Tehtävät
fr: Tâches
nl: Taken
sv: Arbetsuppgifter

source: Today
fi: Tänään
fr: Aujourd'hui
nl: Vandaag
sv: Idag

source: Next week
fi: Ensi viikolla
fr: La semaine prochaine
nl: Volgende week
sv: Nästa vecka

source: Future
fi: Tulevaisuudessa
fr: Futur
nl: Toekomst
sv: Kommande

source: There was an error processing the card. Please check the card details! If this problem persists, you should contact our %(L$support%).
fi: Maksun käsittelyssä tapahtui virhe. Ole hyvä ja tarkista luottokorttisi tiedot. Mikäli ongelma ei poistu, ole yhteydessä %(L$tukipalveluumme%).
fr: Une erreur s'est produite lors du traitement de la carte. Veuillez vérifier les informations de la carte ! Si ce problème persiste, contactez notre %(L$assistance%).
nl: Er was een foutmelding bij verwerken van de kaart. Bekijk alstublieft de kaartdetails! Als dit probleem aanhoudt, contacteer dan onze %(L$ondersteuning%).
sv: Ett fel uppstod under kortprocessen. Var god kontrollera kortdetaljerna! Om detta problem uppstår igen bör du kontakta vår %(L$support%).

source: You seem to already have an active PRO subscription!
fi: Sinulla on jo käytössäsi PRO tili.
fr: Il semblerait que vous ayez déjà un abonnement PRO actif !
nl: Je hebt blijkbaar al een actieve PRO abonnement!
sv: Det ser ut som om du har redan en aktiv PRO-prenumeration!

source: We seem to have an active PRO subscription associated with the provided email already! Please, %(L$log in%) and enjoy your PRO account.
fi: Palvelussamme on jo tähän sähköpostiin liitetty PRO tili. %(L$Kirjaudu sisään%) ja jatka käyttöä.
fr: Il semble que nous ayons déjà un abonnement PRO actif associé à l'adresse électronique fournie ! Veuillez %(L$vous connecter%) et profitez de votre compte PRO.
nl: We hebben blijkbaar al een actief PRO abonnement verbonden met het versterkte e-mailadres! Alstublieft, %(L$Log in%) en geniet van uw PRO account.
sv: Det ser ut som om vi redan har en aktiv PRO-prenumeration kopplad till den angivna e-mailadressen! Var god %($log in%) och åtnjut ditt PRO-konto!
