Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_front-*.po
Languages: fi, fr, nl, sv

source: Download (pdf | 0.2mb)
fi: Lataa (pdf | 0.2mb)
fr: Télécharger (PDF | 0,2 Mo)
nl: Downloaden (pdf | 0,2 mb)
sv: Ladda ner (pdf | 0,2mb)

source: Is the text too small? Click above for fullscreen.
fi: Onko teksti liian pientä? Paina yläpuolelta siirtyäksesi kokonäytön tilaan.
fr: Le texte est-il trop petit ? Cliquez ci-dessus pour passer en plein écran
nl: Is de tekst te klein? Klik bovenaan voor volledig scherm.
sv: Är texten för liten? Klicka ovan för fullskärm.

source: Download (pdf | 2mb)
fi: Lataa (pdf | 2mb)
fr: Télécharger (PDF | 2 Mo)
sv: Ladda ner (pdf | 2mb)

source: Getting Started Guide (Basic features)
fi: Uuden käyttäjän opas (perus toiminnallisuudet)
fr: Guide de démarrage (fonctionnalités de base)
nl: Handleiding om aan de slag te gaan (basisfuncties)
sv: Kom igång-guide (Grundfunktioner)

source: Getting Started Guide (Pro features)
fi: Uuden käyttäjän opas (PRO-toiminnallisuudet)
fr: Guide de démarrage (fonctionnalités Pro)
nl: Handleiding om aan de slag te gaan (professionele functies)
sv: Kom igång-guide (Pro-funktioner)

source: Email Communications Instructions
fi: Ohjeet palvelun käyttämiseen sähköpostilla
fr: Instructions sur les communications e-mail
nl: Instructies voor e-mail-communicaties
sv: Instruktioner för e-postkommunikation

source: Download (pdf | 0.7mb)
fi: Lataa (pdf | 0.7mb)
fr: Télécharger (PDF | 0,7 Mo)
nl: Downloaden (pdf | 0.7mb)
sv: Ladda ner (pdf | 0,7mb)

source: Phone number
fi: Puhelinnumero
fr: Numéro de téléphone
nl: Telefoonnummer
sv: Telefonnummer

source: Please note that Meetin.gs might still have some problems with your browser. If possible, please consider using a more modern browser while we fix things.
fi: Pelvelu ei välttämättä toimi oikein selaimellasi. Pyrimme tukemaan myös vanhempia selaimia. Suosittelemme sinua kuitenkin mahdollisuuksien mukaan päivittämään selaimesi uudempaan.
fr: Veuillez noter que Meetin.gs pourrait encore avoir quelques problèmes avec votre navigateur. Si possible, veuillez envisager d'utiliser un navigateur plus récent pendant que nous arrangeons les choses.
nl: Let op dat Meetin.gs nog enkele problemen kan hebben met uw browser. Indien mogelijk, overweeg het gebruik van een modernere browser terwijl we de dingen repareren.
sv: Vänligen notera att Meetin.gs ännu kan ha vissa problem med din webbläsare. Om det är möjligt vänligen överväg att använda en nyare webbläsare medan vi fixar det.

source: Sorry
fi: Pahoittelut
fr: Pardon
sv: Beklagar

source: Unfortunately we are unable to connect to our servers.
fi: Valitettavasti emme saa juuri nyt yhteyttä palvelimeen.
fr: Malheureusement nous ne pouvons pas établir la connexion avec nos serveurs.
nl: We zijn helaas niet in staat om aan te sluiten op onze servers.
sv: Tyvärr kan vi inte ansluta till våra servrar.

source: Try again
fi: Yritä uudestaan
fr: Réessayer
nl: Probeer opnieuw
sv: Försök igen

source: Getting Started
fi: Aloitusohje
fr: Démarrer
nl: Aan de slag gaan
sv: Kom igång

source: Powered by %(L$Meetin.gs%)
fi: Toteutettu käyttämällä %(L$Meetin.gs%)-palvelua
fr: Fonctionne grâce à %(L$Meetin.gs%)
nl: Mogelijk gemaakt door %(L$Meetin.gs%)
sv: Drivs av %(L$Meetin.gs%)

source: Blog
fi: Blogi
sv: Blogg

source: Support
fi: Tuki

source: Contact
fi: Yhteydenotto
sv: Kontakt

source: Privacy Policy
fi: Yksityisyyden suojan ehdot
fr: Politique de confidentialité
nl: Privacybeleid
sv: Integritetspolicy

source: Takedown policy
fi: Materiaalin poistamisen periaatteet
fr: Politique de retrait
nl: Takedown-beleid
sv: Borttagningspolicy

source: Terms of Service
fi: Käyttöehdot
fr: Conditions d'utilisation
nl: Dienstvoorwaarden
sv: Användarvillkor

source: Cancel registration
fi: Keskeytä rekisteröinti
fr: Annuler l'inscription
nl: Registratie annuleren
sv: Avbryt registrering

source: Search meetings
fi: Etsi kokouksia
fr: Réglages de la recherche
nl: Zoek vergaderingen
sv: Sök i möten

source: Notifications
fi: Ilmoitukset
nl: Notificaties
sv: Notifieringar

source: My Meetings
fi: Omat tapaamiset
fr: Mes rendez-vous
nl: Mijn vergaderingen
sv: Mina möten

source: Already a Meetin.gs user? Sign in here
fi: Oletko jo käyttäjä? Kirjaudu sisään.
fr: Déjà utilisateur de Meetin.gs ? Connectez-vous ici
nl: Al een gebruiker van Meetin.gs? Log dan hier in.
sv: Är du redan registrerad Meetin.gs-användare? Logga in här

source: Add new
fi: Lisää uusi
fr: Ajouter nouveau
nl: Nieuwe toevoegen
sv: Lägg till ny

source: Timeline
fi: Aikajana
fr: Historique
nl: Tijdlijn
sv: Tidslinje

source: Meet Me page
fi: Tapaamissivut
fr: Page Me Rencontrer
nl: Meet Me pagina
sv: Möt mig-sida

source: Profile
fi: Profiili
fr: Profil
nl: Profiel
sv: Profil

source: Settings
fi: Asetukset
fr: Paramètres
nl: Instellingen
sv: Inställningar

source: Logout
fi: Kirjaudu ulos
fr: Se déconnecter
nl: Uitloggen
sv: Logga ut

source: Time not set
fi: Aikaa ei ole asetettu
fr: Heure non réglée
nl: Tijd niet vastgesteld
sv: Tiden är inte inställd

source: Created on %1$s
fi: Luotu %1$s
fr: Créé le %1$s
nl: Aangemaakt op %1$s
sv: Skapades %1$s

source: Imported from Google Calendar. Click here to hide.
fi: Tuotu Google kalenterista. Paina tästä piiloittaaksesi näkyvistä.
fr: Importé depuis Google Agenda. Cliquez ici pour cacher.
nl: Geïmporteerd vanuit de Google-kalender. Klik hier om het te verbergen.
sv: Importerat från Google Kalender. Klicka här för att dölja.

source: Imported from your phone calendar. Click here to hide.
fi: Tuotu puhelimen kalenterista. Paina tästä piiloittaaksesi näkyvistä.
fr: Importé depuis l'agenda de votre téléphone. Cliquez ici pour masquer.
nl: Geïmporteerd vanuit uw telefoonkalender. Klik hier om het te verbergen.
sv: Importerat från din telefonkalender. Klicka här för att dölja.

source: More
fi: Lisää
fr: Plus
nl: Meer
sv: Mer

source: Open Skype to receive calls
fi: Avaa Skype vastaanottaaksesi puheluita
fr: Ouvrez Skype pour recevoir des appels
nl: Open Skype om gesprekken te ontvangen
sv: Öppna Skype för att ta emot samtal

source: Join Skype conference call
fi: Liity Skype-puheluun
fr: Joindre la conférence Skype
nl: Neem deel aan het Skype-conferentiegesprek
sv: Gå med i Skype-konferenssamtal

source: You need to have %(L$Skype 5.0%) or greater installed.
fi: Sinulla täytyy olla %(L$Skype 5.0%)-versio tai uudempi asennettuna.
fr: Vous devez avoir installé %(L$Skype 5.0%) ou supérieur.
nl: U moet %(L$Skype 5.0%) of groter geïnstalleerd hebben.
sv: Du måste ha installerat %(L$Skype 5.0%) eller nyare.

source: Make sure that under "Skype > Preferences > Privacy" you allow calls from anyone.
fi: Varmista Skypen asetuksista, että olet tarvittaessa sallinut puheluiden vastaanottamisen myös vierailta käyttäjiltä.
fr: Assurez-vous que sous « Skype > Préférences > Vie privée » vous autorisez les appels venant de n'importe qui.
nl: Zorg ervoor dat u onder 'Skype > Voorkeuren > Privacy' gesprekken van iedereen toelaat.
sv: Försäkra dig om att du tillåter samtal från alla under "Skype > Inställningar > Sekretess"

source: Join the teleconference
fi: Liity telekonferenssiin
fr: Rejoindre la téléconférence
nl: Neem deel aan de teleconferentie
sv: Gå med i telekonferensen

source: Is the button not working? Call manually
fi: Eikö painike toimi? Soita manuaalisesti.
fr: Le bouton ne marche pas ? Appeler manuellement
nl: Werkt de knop niet? Bel manueel
sv: Fungerar inte knappen? Ring manuellt

source: with pin %1$s
fi: Pin koodilla %1$s
fr: avec l'épingle %1$s
nl: met pin %1$s
sv: med knappnål %1$s

source: Open the Hangout
fi: Avaa Hangout
fr: Ouvrir le Hangout
nl: De Hangout openen
sv: Öppna Hangouten

source: This meeting has an active Google Hangout. Click the button above to join.
fi: Tähän kokoukseen liittyvä Google Hangout on käynnissä. Liity mukaan oheisesta painikkeesta.
fr: Cette rencontre a un Google Hangout actif. Cliquez sur le bouton ci-dessus pour rejoindre.
nl: Deze ontmoeting heeft een actieve Google Hangout. Klik op de knop bovenaan om deel te nemen.
sv: Detta möte har en aktiv Google Hangout. Klicka på knappen ovan för att gå med.

source: Please open the Hangout to allow participants to join the online conference.
fi: Avaa Hangout mahdollistaaksesi muiden osanottajien liittymisen virtuaalikokoukseen.
fr: Veuillez ouvrir le Hangout pour permettre aux participants de rejoindre la conférence en ligne.
nl: Gelieve de Hangout te openen om de deelnemers in staat te stellen deel te nemen aan de online-conferentie.
sv: Vänligen öppna Hangouten för att tillåta deltagare att gå med i onlinekonferensen.

source: Please wait while the organizer prepares the hangout.
fi: Ole hyvä ja odota kunnes järjestäjä on valmistellut hangout-tilan.
fr: Veuillez patienter pendant que l'organisateur prépare le Hangout.
nl: Gelieve te wachten terwijl de organisator de hangout voorbereidt.
sv: Vänligen vänta medan organisatören förbereder hangouten.

source: Open Lync
fi: Avaa Lync
fr: Ouvrir Lync
nl: Lync openen
sv: Öppna Lync

source: This meeting is using Microsoft Lync. Click the button above to open Lync.
fi: Tämä virtuaalikokous käyttää Microsoft Lynciä. Avaa Lync oheisesta painikkeesta.
fr: Cette rencontre utilise Microsoft Lync. Cliquez sur le bouton ci-dessus pour ouvrir Lync.
nl: Deze ontmoeting gebruikt Microsoft Lync. Klik op de knop bovenaan om Lync te openen.
sv: Detta möte använder Microsoft Lync. Klicka på knappen ovan för att öppna Lync.

source: This meeting is using a custom tool. Click the button above to join.
fi: Tässä virtuaalikokouksessa käytetään järjestäjän valitsemaa omaa työkalua. Liity mukaan oheisesta painikkeesta.
fr: Cette rencontre utilise un outil personnalisé. Cliquez sur le bouton ci-dessus pour rejoindre.
nl: Deze ontmoeting gebruikt een aangepast instrument. Klik op de knop bovenaan om deel te nemen.
sv: Detta möte använder ett anpassningsbart verktyg. Klicka på knappen ovan för att gå med.

source: Custom URL settings
fi: Oman työkalun URL asetukset
fr: Réglages personnalisés d'URL
nl: Gebruik URL-instellingen
sv: Anpassade URL-inställningar

source: Enter a link with instructions for joining the meeting with your custom tool.
fi: Syötä linkki omavalintaiseen työkaluun ja lisää ohjeet, joiden avulla osallistujat pääsevät liittymään kokoukseen.
fr: Entrez un lien avec des instructions pour rejoindre la réunion avec votre outil personnalisé.
nl: Voer een link in met instructies voor het deelnemen aan de vergadering met uw op maat gemaakte tool.
sv: Lägg in en länk med instruktioner för hur man går med i mötet med ditt specialverktyg.

source: Web address (URL)
fi: Verkko-osoite (URL)
fr: Adresse Web (URL)
nl: webadres (URL)
sv: Webadress (URL)

source: Copy the URL here
fi: Kopioi verkko-osoite tähän
fr: Copier l'URL ici
nl: Kopieer de URL hier
sv: Kopiera URL:n här

source: Name of the tool
fi: Työkalun nimi
fr: Nom de l'outil
nl: Naam van het instrument
sv: Verktygets namn

source: Tool instructions for participants
fi: Työkalun käyttöohjeet
fr: Instructions des outils pour les participants
nl: Gereedschapsinstructies voor deelnemers
sv: Verktygsinstruktioner för deltagare.

source: Hangouts settings
fi: Hangoutin asetukset
fr: Réglages Hangouts
nl: Hangouts-instellingen
sv: Hangouts-inställningar

source: Hangouts will be enabled for this meeting.
fi: Tässä kokouksessa on käytössä Google Hangouts.
fr: Hangouts sera activé pour cette rencontre.
nl: Hangouts worden mogelijk gemaakt voor deze vergadering.
sv: Hangouts kommer att vara aktiverade för detta möte.

source: NOTE: You and the participants will receive the Hangouts url before the meeting.
fi: HUOM: Toimitamme sinulle ja osallistujille osoitteen Hangoutsiin liittymistä varten ennen tapaamista.
fr: REMARQUE : Les participants et vous-même recevrez l'URL des Hangouts avant la réunion.
nl: OPMERKING: U en de deelnemers zullen de Hangouts-url voor de vergadering ontvangen.
sv: Notera: Du och deltagarna kommer att emotta Hangouts-länken innan mötet.

source: Lync settings
fi: Lync-asetukset
fr: Réglages Lync
nl: Lync-instellingen
sv: Lync-inställningar

source: Select one the options below to activate Lync for this meeting.
fi: Valitse tapa, jolla Lync-yhteys muodostetaan.
fr: Sélectionnez une des options ci-dessous pour activer Lync pour cette rencontre.
nl: Selecteer een van de onderstaande opties om Lync voor deze vergadering te activeren
sv: Välj bland alternativen nedan för att aktivera Lync för detta möte.

source: Paste your Lync invitation
fi: Kopioi Lync-kutsusi
fr: Coller votre invitation Lync
nl: Plak uw Lync-uitnodiging
sv: Klistra in din Lync-inbjudan

source: How to get the invitation?
fi: Miten kutsun saa?
fr: Comment obtenir l'invitation ?
nl: Hoe krijg je de uitnodiging?
sv: Hur får du inbjudan?

source: Office 365 user: Create a new meeting in the %(L$Web scheduler%).
fi: Office 365 käyttäjä: Luo uusi kokous %(L$Web scheduleria%) käyttämällä.
fr: Utilisateur Office 365 : Créez une nouvelle réunion dans le %(L$planificateur Web%).
nl: Office 365-gebruiker: Creëer een nieuwe vergadering in de %(L$Web scheduler%).
sv: Office 365-användare: Skapa ett nytt möte i %(L$Web scheduler%).

source: Desktop user: Press "New Lync Meeting" in your Outlook Calendar.
fi: Työpöytäsovelluksen käyttäjä: Luo uusi Lync-kokous Outlook kalenterin kautta.
fr: Utilisateur Desktop : Appuyez sur « Nouvelle réunion Lync » dans votre calendrier Outlook.
nl: PC-gebruiker: Selecteer ''Nieuwe Lync-vergadering'' in uw Outlook-kalender.
sv: Skrivbordsanvändare: Tryck på "Nytt Lync-möte" i din Outlookkalender

source: Use Lync address (SIP)
fi: Käytä Lync-osoitetta (SIP)
fr: Utiliser l'adresse Lync (SIP)
nl: Gebruik Lync-adres (SIP)
sv: Använd Lync-adress (SIP)

source: Your Lync address
fi: Lync-osoitteesi
fr: Votre adresse Lync
nl: Uw Lync-adres
sv: Din Lync-adress

source: Live communication
fi: Tapaamisen etätyökalut
fr: Communication en live
nl: Live-communicatie
sv: Kommunikation live

source: Choose the live communication tool for this meeting.
fi: Valitse kokouksessa käytettävä etätyökalu.
fr: Choisir l'outil de communication en live pour cette rencontre.
nl: Kies het live-communicatie-instrument voor deze ontmoeting.
sv: Välj live-kommunikationsverktyget för detta möte.

source: 15 minutes before the meeting participants will receive a notification containing instructions and a link to join the meeting remotely.
fi: Toimitamme osallistujille ohjeet ja linkin etätapaamiseen liittymistä varten 15 minuuttia ennen tapaamisen alkamista.
fr: 15 minutes avant la réunion, les participants recevront une notification contenant des instructions et un lien pour rejoindre la réunion à distance.
nl: 15 minuten voor de vergadering zullen deelnemers een bericht ontvangen waarin instructies en een link om aan de vergadering op afstand deel te nemen zijn opgenomen.
sv: 15 minuter före mötet för deltagarna en avisering med instruktioner och en länk för att delta i mötet på distans.

source: Skype call
fi: Skype-puhelu
fr: Appel Skype
nl: Skype-gesprek
sv: Skype-samtal

source: Teleconference
fi: Puhelinkokous
fr: Téléconférence
nl: Teleconferentie
sv: Telekonferens

source: Custom Tool
fi: Oma työkalu
fr: Outil personnalisé
nl: Aangepast instrument
sv: Anpassningsbart verktyg

source: Disable
fi: Kytke pois
fr: Désactiver
nl: Onbruikbaar maken
sv: Inaktivera

source: Skype settings
fi: Skype-asetukset
fr: Réglages Skype
nl: Skype-instellingen
sv: Skype-inställningar

source: Type in the Skype account that will be used to receive the calls from the participants.
fi: Syötä alle se Skype-tili, jota käytetään puheluiden vastaanottamiseen.
fr: Entrez le compte Skype qui sera utilisé pour recevoir les appels des participants.
nl: Voer het Skypenaam in dat gebruikt zal worden om de oproepen van de deelnemers te ontvangen.
sv: Skriv in Skype-kontot som kommer att användas för att ta emot samtal från deltagarna.

source: Skype account name
fi: Skype-tili
fr: Compte Skype
nl: Naam van de Skypenaam
sv: Namn på Skypekonto

source: NOTE: If you are not connected with the participants in Skype, remember to allow incoming calls from anyone using Skype privacy settings.
fi: HUOM: Sinun tulee sallia Skypen asetuksistasi puheluiden vastaanottaminen tuntemattomilta käyttäjltä, mikäli kaikki osallistujat eivät ole yhteystiedoissasi.
fr: REMARQUE : Si vous n'êtes pas connecté avec les participants sur Skype, n'oubliez pas d'autoriser les appels entrants de tout le monde dans les paramètres de vie privée de Skype.
nl: OPMERKING: Mocht u niet verbonden zijn met de deelnemers via Skype, vergeet dan niet alle inkomende oproepen toe te staan met de privacy-instellingen van Skype.
sv: Notera: Om du inte är uppkopplad mot deltagarna i Skype, kom ihåg att tillåta inkommande samtal från alla i Skypes sekretessinställningar.

source: Teleconference settings
fi: Puhelinkokouksen asetukset
fr: Réglages de la téléconférence
nl: Teleconferentie-instellingen
sv: Telekonferens-inställningar

source: Enter the teleconference number given by your chosen operator.
fi: Syötä numero, jonka olet saanut puhelinneuvotteluita tarjoavalta operaattoriltasi.
fr: Entrez le numéro de téléconférence donné par l'opérateur de votre choix.
nl: Voer het teleconferentienummer in dat u ontvangen heeft van de door u gekozen operator .
sv: Skriv in konferenstelefonnumret du fått av din operatör.

source: NOTE: If you know your pin code you can preset it here to allow participants to join without having to type the pin when making the call.
fi: HUOM: Pin koodia käytetään kokoukseen liittyessä. Mikäli haluat, voit esitäyttää koodisi tähän, jolloin osallistujien ei tarvitse erikseen syötttää sitä neuvotteluun liittyessään.
fr: REMARQUE : Si vous connaissez votre code PIN, vous pouvez le prédéfinir ici pour autoriser les participants à rejoindre la réunion sans avoir à taper le PIN lors de l'appel.
nl: OPMERKING: Indien u uw pincode weet, kunt u die hier vooraf instellen zodat deelnemers zich bij de vergadering kunnen voegen zonder dat zij de pincode moeten intoetsen als zij een oproep plaatsen.
sv: OBS: Om du kan din pinkod kan du programmera in den här, så att deltagare kan gå med utan att behöva skriva in pinkoden när de ringer.

source: No material for this meeting.
fi: Kokoukseen ei ole lisätty materiaaleja
fr: Pas d'élément pour cette rencontre.
nl: .Geen materiaal voor deze vergadering.
sv: Inget material för detta möte.

source: Add new material
fi: Lisää materiaali
fr: Ajouter un nouvel élément
nl: Nieuw materiaal toevoegen
sv: Lägg till nytt material

source: Drag & drop materials here
fi: Raahaa materiaalit tähän
fr: Faites glisser les éléments ici
nl: Sleep & laat materialen hier vallen
sv: Dra och släpp material här

source: %1$s wants to meet you
fi: %1$s haluaa tavata sinut
fr: %1$s veut vous rencontrer
nl: %1$s wilt u ontmoeten
sv: %1$s vill träffa dig

source: Accept or decline?
fi: Hyväksy tai hylkää.
fr: Accepter ou refuser ?
nl: Accepteren of weigeren
sv: Acceptera eller avböj?

source: Accept
fi: Hyväksy
fr: Accepter
nl: Accepteren
sv: Acceptera

source: Email settings
fi: Sähköpostiasetukset
fr: Réglages de l'e-mail
nl: E-mail-instellingen
sv: E-postinställningar

source: Meeting settings
fi: Kokouksen asetukset
fr: Réglages de la rencontre
nl: Instellingen van vergadering
sv: Inställningar för mötet

source: Manage meeting email notifications.
fi: Hallinnoi kokouksen ilmoitusasetuksia.
fr: Gérer les notifications d'e-mail de la rencontre
nl: Beheer e-mail notificaties van vergaderingen.
sv: Hantera e-postmeddelanden om mötet.

source: Participant rights
fi: Käyttöoikeudet
fr: Droits des participants
nl: Deelnemersrechten
sv: Deltagarens rättigheter

source: Decide what participants are allowed to do.
fi: Päätä mitkä oikeudet osallistujille annetaan.
fr: Décidez ce que les participants ont le droit de faire.
nl: Beslis waar deelnemers toestemming voor hebben.
sv: Bestäm vad deltagarna har tillstånd att göra.

source: Upgrade to PRO
fi: Päivitä tilistäsi PRO
fr: Mettre à niveau pour PRO
nl: Upgrade naar PRO
sv: Uppgradera till PRO

source: Customize meetings and get all the benefits of the full suite!
fi: Mukauta kokouksia ja hyödynnä palvelun muut erityisominaisuudet!
fr: Personnalisez les réunions et recevez tous les bénéfices de la version complète !
nl: Pas vergaderingen en meer aan!
sv: Anpassa möten och ännu mer!

source: Remove meeting
fi: Poista kokous
fr: Retirer la rencontre
nl: Ontmoeting verwijderen
sv: Ta bort möte

source: If you remove this meeting, you and the participants will no longer be able to access this meeting and its content.
fi: Tämä hävittää kaikki kokoukseen liittyvät tiedot ja materiaalit. Poistamisen jälkeen näihin tietoihin ei pääse enää käsiksi.
fr: Si vous retirez cette rencontre, vous et les participants ne pourrez plus accéder à cette rencontre et son contenu.
nl: Bij verwijdering van deze vergadering kunnen u en de andere deelnemers geen toegang meer tot deze vergadering en zijn inhoud verkrijgen.
sv: Om du tar bort det här mötet, kommer du och de andra deltagarna inte längre att kunna visa mötet och dess innehåll.

source: Removing meeting...
fi: Poistetaan kokousta...
fr: Suppression du rendez-vous ...
nl: Vergadering verwijderen...
sv: Tar bort möte...

source: Removing meeting... done. Redirecting to timeline.
fi: Kokous poistettu... Valimis. Palautamme sinut nyt aikajanallesi.
fr: Suppression du rendez-vous ... terminée. Redirection vers l'historique.
nl: Bezig met verwijderen van vergadering... gereed. Omleiden naar tijdlijn.
sv: Tar bort möte... klart. Skickar åter till tidslinjen.

source: Edit participant rights
fi: Hallitse osallistujien käyttöoikeuksia
fr: Modifier droits participant
nl: Deelnemersrechten bewerken
sv: Redigera deltagarens rättigheter

source: Select background
fi: Valitse tausta
fr: Sélectionner le fond d'écran
nl: Selecteer achtergrond
sv: Välj bakgrund

source: Upload your own
fi: Lataa omasi
fr: Envoyer la vôtre
nl: Upload uw eigen
sv: Ladda upp din egen

source: Please take note:
fi: Huomioi:
fr: Veuillez noter :
nl: Let op:
sv: Vänligen notera:

source: It is recommended to have at least one public meeting scheduler available to share your Meet Me cover page. Please add one now.
fi: On suositeltavaa asettaa ainakin yksi tapaamiskalenteri julkiseksi Meet Me -sivua jakaessasi. Tee se nyt.
fr: Il est recommandé d'avoir au moins un planificateur de rencontre public disponible pour partager votre page de couverture Me Rencontrer. Veuillez en ajouter un maintenant.
nl: Het wordt aanbevolen om ten minste een openbare vergadering planner beschikbaar te hebben om je Meet Me voorpagina mee te delen. Voeg er nu een toe.
sv: Det är rekommenderat att ha minst en offentlig mötesschemaläggare tillgänglig för att dela din Möt mig-framsida. Vänligen lägg till en nu.

source: When you are done you can use the "sharing" link on top of this screen to easily embed your "schedule" button and share your Meet Me cover page as well as your private meeting schedulers.
fi: Kun olet valmis, voit siirtyä jakamisvalikkoon sivun ylälaidasta. Sen kautta saat jaettua helposti Meet Me -sivusi. Voit myös luoda esimerkiksi verkkosivullesi painikkeen, jonka kautta tapaamisen sopiminen kanssasi on helpompaa kuin koskaan ennen.
fr: Après avoir fini vous pouvez utiliser le lien « Partager » en haut de cet écran pour intégrer votre bouton « emploi du temps » et partager votre page de couverture Me Rencontrer tout comme vos planificateurs de rencontres privées.
nl: Als u klaar bent kunt u de "delen" link bovenaan dit scherm gebruiken om gemakkelijk uw "plannen" knop te gebruiken en uw Meet Me voorpagina te delen, evenals uw persoonlijke vergadering planners.
sv: När du är klar kan du använda "delningslänken" överst på denna skärm för att enkelt bädda in din "schemaknapp" och dela din Möt mig-framsida, samt dina privata mötesschemaläggare.

source: Ok, got it
fi: Ok
fr: OK, je l'ai
nl: Oké, ik snap het
sv: Ok, jag förstår
