Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_back-*.po
Languages: fi, fr, nl, sv

source: Meetin.gs pro trial expired
fi: Meetin.gs PRO koekäyttöjakso päättyi
fr: Votre essai Meetin.gs pro a expiré
nl: Proefperiode Meetin.gs pro afgelopen.
sv: Meetin.gs pro provperiod gick ut

source: Your trial was about to expire but:
fi: Koekäyttöjaksosi oli päättymässä.
fr: Votre essai était sur le point de se terminer mais :
nl: Uw proefperiode stond op het punt om af te lopen maar:
sv: Din provperiod hade löpt ut men:

source: We noticed that you have not really had the chance to get up to speed with Meetin.gs. That's why we decided to extend your Meetin.gs PRO trial with another 30 days.
fi: Huomasimme kuitenkin, ettet ole juurikaan ehtinyt käyttää palveluamme. Päätimme tämän vuoksi pidentää Meetin.gs PRO:n koekäyttöjaksoasi kuukaudella.
fr: Nous avons remarqué que vous n'avez pas vraiment eu l'occasion de pleinement tester Meetin.gs. C'est pourquoi nous avons décidé de prolonger votre essai Meetin.gs PRO de 30 jours supplémentaires.
nl: We merkten op dat u nog niet echt de kans heeft gehad om Meetin.gs goed te leren kennen. Daarom hebben we besloten om uw proefperiode voor Meetin.gs PRO met nog eens 30 dagen te verlengen.
sv: Vi märkte att du inte riktigt haft chansen att komma igång med Meetin.gs. Det är därför vi beslutade att förlänga din Meetin.gs PRO rättegång med ytterligare 30 dagar.

source: Get started by organizing a meeting:
fi: Aloita tutustuminen ja järjestä kokous heti!
fr: Commencez par organiser une réunion :
nl: Begin met het organiseren van een vergadering:
sv: Börja med att organisera ett möte:

source: Organize a meeting now
fi: Järjestä kokous
fr: Organiser une réunion maintenant
nl: Organiseer nu een vergadering.
sv: Organisera ett möte nu

source: If there's anything we can help you with, please give us a shout by replying to this email.
fi: Jos voimme mitenkään auttaa, laita meille viesti. Esimerkiksi vastaamalla tähän sähköpostiin.
fr: Si nous pouvons vous aider en quoi que ce soit, n'hésitez pas à nous demander en répondant à cet e-mail.
nl: A er iets is waarmee we u kunnen helpen, laat het ons weten door deze email te beantwoorden.
sv: Om det är något vi kan hjälpa dig med, vänligen kontakta genom att svara på detta mail.

source: We have extended your Meetin.gs Pro trial
fi: Olemme jatkaneet Meetin.gs PRO koekäyttöäsi
fr: Nous avons prolongé votre essai Meetin.gs Pro
nl: We hebben uw Meetin.gs Pro proefperiode verlengd.
sv: Vi har utökat din provperiod av Meetin.gs Pro

source: To complete your registration for matchmaking, follow the link below.
fi: Paina vahvista painiketta viimeistelläksesi rekisteröitymisesi matchmaking-palveluun.
fr: Pour compléter votre inscription à l'événement, cliquez sur le lien ci-dessous.
nl: Klik op de onderstaande link om uw registratie om te koppelen af te ronden.
sv: Slutför registreringen för matchmaking genom att klicka på länken nedan.

source: Complete registration
fi: Viimeistele rekisteröinti
fr: Complétez l'inscription
nl: Rond registratie af.
sv: Slutför registrering

source: Confirm registration for matchmaking
fi: Vahvista rekisteröityminen matchmaking-palveluun
fr: Confirmez votre inscription à la mise en relation
nl: Bevestig de registratie om te koppelen.
sv: Bekräfta registreringen för matchmaking

source: Authorize Facebook
fi: Valtuuta Facebook
fr: Autoriser Facebook
nl: Geef Facebook toestemming.
sv: Auktorisera Facebook

source: Your account is now up and running.
fi: Tilisi on nyt luotu ja käyttövalmiina.
fr: Votre compte est désormais opérationnel.
nl: Uw account is nu klaar voor gebruik.
sv: Ditt konto är nu igång.

source: Use the following link to authorize Meetin.gs to connect with your Facebook account.
fi: Anna oheisella linkillä Meetin.gs:lle lupa kirjata sinut sisään Facebook tunnuksellasi.
fr: Autorisez Meetin.gs à se connecter à votre compte Facebook en utilisant le lien suivant.
nl: Gebruik de volgende link om Meetin.gs toestemming te geven om verbinding te maken met uw Facebook account.
sv: Använd följande länk för att tillåta Meetin.gs att ansluta med ditt Facebook-konto.

source: Connect to Facebook
fi: Yhdistä Facebookkiin
fr: Connexion à Facebook
nl: Maak verbinding met Facebook.
sv: Anslut till Facebook

source: Action required: Facebook connection authorization
fi: Toimintaa odotetaan: Lupa Facebook yhteyden muodostamiselle
fr: Action requise : autorisation de connexion à Facebook
nl: Actie vereist: geef toestemming om met Facebook te verbinden.
sv: Åtgärd krävs: Auktorisering för att ansluta till Facebook

source: Authorize Google
fi: Valtuuta Google
fr: Autoriser Google
nl: Geef Google toestemming.
sv: Auktorisera Google

source: Use the following link to authorize Meetin.gs to connect with your Google account.
fi: Anna oheista linkkiä käyttämällä meille lupa yhdistää palvelumme Google-tiliisi.
fr: Utilisez le lien suivant pour autoriser Meetin.gs à se connecter à votre compte Google.
nl: Gebruik de volgende link om Meetin.gs toestemming te geven om verbinding te maken met uw Google account.
sv: Klicka på följande länk om du vill tillåta Meetin.gs att ansluta till ditt Googlekonto.

source: Connect to Google
fi: Yhdistä Google-tili
fr: Connectez-vous à Google
nl: aansluiten op Google
sv: Anslut till Google

source: Action required: Google connection authorization
fi: Toimintaa odotetaan: Lupa Google yhteyden muodostamiselle
fr: Action requise : autorisation de connexion à Google
nl: Actie vereist: geef toestemming om met Google te verbinden.
sv: Åtgärd krävs: Auktorisering för att ansluta till Google

source: One more thing,
fi: Vielä yksi asia,
fr: Encore une chose,
nl: Nog één ding.
sv: En sak till,

source: Click continue to verify your email address
fi: Paina jatka-painiketta vahvistaaksesi sähköpostiosoitteesi
fr: Cliquez sur continuer pour vérifier votre adresse e-mail
nl: Klik op doorgaan om uw emailadres te controleren.
sv: Klicka på "Fortsätt" för att verifiera din e-postadress.

source: Your meeting is almost up and running. Click the following link to continue.
fi: Kokouksesi on melkein valmis. Klikkaa oheista linkkiä jatkaaksesi.
fr: Votre réunion est presque prête. Cliquez sur le lien suivant pour continuer.
nl: Uw vergadering is bijna gereed. Klik op de volgende link om door te gaan.
sv: Mötet är nästan igång. Klicka på följande länk för att fortsätta.

source: We still need you to verify your email address, so please click the following link to continue.
fi: Meidän täytyy vielä varmentaa sähköpostisi. Klikkaa oheista linkkiä jatkaaksesi.
fr: Nous avons encore besoin que vous vérifiez votre adresse e-mail, veuillez cliquer sur le lien suivant pour continuer.
nl: U moet uw emailadres nog steeds verifiëren, dus klik op de volgende link om door te gaan.
sv: Du måste fortfarande verifiera din mejladress, så klicka på följande länk för att fortsätta.

source: Action required: please verify your email address
fi: Toimintaa odotetaan: vahvista sähköpostiosoitteesi
fr: Action requise : veuillez vérifier votre adresse e-mail
nl: Actie vereist: verifieer alstublieft uw emailadres.
sv: Nödvändig åtgärd: kontrollera din e-postadress

source: Your Meet Me page is almost ready
fi: Meet Me -sivusi on melkein valmis
fr: Votre page Meet Me est presque prête
nl: Uw introductiepagina is bijna gereed.
sv: Din Meet Me-sida är nästan klar.

source: Next you will be able to configure your Meet Me page and finish the sign up process.
fi: Seuraavaksi sinulla on mahdollisuus muokata Meet Me -sivusi asetuksia ja viimeistellä kirjautuminen palveluun.
fr: Vous pourrez ensuite configurer votre page Meet Me et compléter le processus d'inscription.
nl: Hierna zal uw introductiepagina kunnen configureren en het aanmeldingsproces afronden.
sv: I nästa steg får du möjlighet att konfigurera din Meet Me-sida och avsluta registreringsprocessen.

source: Before we are all set...
fi: Ennen kuin olemme täysin valmiita...
fr: Avant que nous soyons tous prêts...
nl: Voordat we helemaal klaar zijn...
sv: Innan vi är klara...

source: Click continue to configure your Meet Me page and finish your sign up process.
fi: Paina jatka muokataksesi Meet Me -sivusi asetuksia ja viimeistelläksesi kirjautumisesi palveluun.
fr: Cliquer sur continuer pour configurer votre page Rencontrez-Moi et terminer le processus d'inscription.
nl: Klik op doorgaan om de introductiepagina te configureren en het aanmeldingsproces te voltooien.
sv: Klicka på Fortsätt för att anpassa din Meet Me-sida och avsluta registreringsprocessen.

source: Verify your Meetin.gs account
fi: Vahvista Meetin.gs-tilisi
fr: Vérifiez votre compte Meetin.gs
nl: Controleer uw Meetin.gs account.
sv: Verifiera ditt Meetin.gs-konto

source: Add to your account
fi: Lisää tilillesi
fr: Ajoutez à votre compte
nl: Voeg toe aan uw account.
sv: Lägg till detta till ditt konto

source: Click the following link to add the meeting to your account.
fi: Paina oheista linkkiä lisätäksesi kokouksen tilillesi
fr: Cliquez sur le lien suivant pour ajouter la réunion à votre compte.
nl: Klik op de volgende link om de vergadering aan uw account toe te voegen.
sv: Klicka på följande länk för att lägga till mötet till ditt konto.

source: After this you can invite people to join the meeting page.
fi: Tämän jälkeen voit kutsua henkilöitä liittymään kokoussivulle.
fr: Après ceci, vous pourrez lancer les invitations à vous rejoindre sur la page réunion.
nl: Hierna kan u mensen uitnodigen op de vergaderpagina te komen.
sv: Därefter kan du bjuda in deltagare till mötets hemsida.

source: Add meeting
fi: Lisää kokous
fr: Ajouter une réunion
nl: Voeg de vergadering toe
sv: Lägg till möte

source: If this isn't your meeting, you can ignore this message.
fi: Jos tämä tapaaminen ei kosketa sinua, voit jättää viestin huomioimatta.
fr: Si vous n'êtes pas concerné par cette réunion, ne tenez pas compte de ce message.
nl: Als dit niet uw vergadering is kunt u deze boodschap negeren.
sv: Om detta inte är ditt möte kan du ignorera meddelandet.

source: Add %1$s to your Meetin.gs account
fi: Lisää kokous %1$s Meetin.gs-tilillesi
fr: Ajoutez %1$s à votre compte Meetin.gs
nl: Voeg %1$s toe aan uw Meetin.gs account.
sv: Addera %1$s till ditt Meetin.gs-konto

source: I am looking forward to meeting you. Feel free to share on the meeting page any comments, questions or documents you might have.
fi: Odotan tapaamistamme. Voit jakaa kokoussivulla vapaasti ennakkomateriaaleja, esittää kysymyksiä ja kommentteja.
fr: J'ai hâte de vous retrouver. N'hésitez pas à partager vos commentaires, questions ou documents éventuels sur la page réunion.
nl: I kijk er naar uit om u te ontmoeten. Voel u vrij om op de vergaderpagina alle opmerkingen, vragen of documenten te delen die u heeft.
sv: Jag ser fram emot att träffa dig. Du får gärna posta kommentarer och frågor, och även ladda upp dokument, på mötets hemsida.

source: Please let me know if you are coming.
fi: Ilmoitathan pääsetkö tulemaan.
fr: Merci de me confirmer votre participation.
nl: Laat me alstublieft weten of u komt.
sv: Var snäll och meddela om du kommer!

source: I am looking forward to meet you. Feel free to share on the meeting page any comments, questions or documents you might have.
fi: Odotan tapaamistamme. Voit jakaa kokoussivulla vapaasti ennakkomateriaaleja, esittää kysymyksiä ja kommentteja.
fr: J'ai hâte de vous retrouver. N'hésitez pas à partager vos commentaires, questions ou documents éventuels sur la page réunion.
nl: Ik kijk ernaar uit u te ontmoeten. Voel u vrij om alle opmerkingen, vragen of documenten die u heeft te delen op de vergaderpagina.
sv: Jag ser fram emot att träffa dig. Du får gärna posta kommentarer och frågor, eller ladda upp dokument, på mötets hemsida.

source: Please answer to my scheduling suggestions so we can find a suitable time for our meeting.
fi: Vastaa ystävällisesti tapaamisehdotukseeni, jotta löydämme sopivan ajan tapaamisellemme.
fr: Merci de répondre à mes suggestions de planification afin que nous convenions d'un horaire pour notre réunion.
nl: Beantwoord alstublieft mijn planningsuggesties zodat we een geschikte tijd voor onze vergadering kunnen vinden.
sv: Var snäll och besvara mina föreslagna tider så att vi kan hitta en lämplig tidpunkt för vårt möte.

source: %1$s confirmed the meeting
fi: %1$s vahvisti tapaamisen
fr: %1$s a confirmé la réunion
nl: %1$s bevestigde de vergadering
sv: %1$s bekräftade mötet

source: %1$s invited you to
fi: %1$s kutsui sinut tapaamiseen
fr: %1$s vous à invité à
nl: %1$s heeft je uitgenodigd om
sv: %1$s bjöd in dig till

source: Do these times suit you? Answer on the meeting page.
fi: Sopiiko joku näistä ajoista sinulle? Vastaa kokoussivulla.
fr: Ces horaires vous conviennent-ils ? Répondez sur la page réunion.
nl: Zijn deze tijden geschikt voor U? Antwoord op de vergaderpagina.
sv: Passar tiderna dig? Svara på mötessidan.

source: Comment now
fi: Kommentoi
fr: Faites un commentaire maintenant
nl: Reageer nu
sv: Kommentera nu

source: %(B$Tip:%) You can also choose suitable dates by replying to this message with SCHEDULE as the first word.
fi: %(B$Vinkki:%) Voit myös valita itsellesi sopivimmat päivät sähköpostitse vastaamalla tähän viestiin sanalla SCHEDULE.
fr: %(B$Tip:%) Vous pouvez aussi choisir des dates appropriées en répondant à ce message en mettant PROGRAMME comme premier mot.
nl: %(B$Tip:%) U kan ook geschikte datums kiezen door deze boodschap te beantwoorden met SCHEDULE als het eerste woord.
sv: %(B$Tips:%) Du kan också välja de datum som passar dig genom att svara på det här meddelandet med SCHEDULE som första ord.

source: %(B$Tip:%) You can also add material by emailing attachments to %(L$%1$s%). The documents will automatically appear on the meeting page.
fi: %(B$Vinkki:%) Voit lisätä materiaaleja myös sähköpostin liittetiedostoina osoitteeseen %(L$%1$s%).
fr: %(B$Tip:%) Vous pouvez aussi ajouter des données par mail à %(L$%1$s%). Les documents apparaîtront automatiquement sur la page de réunion.
nl: %(B$Tip:%) U kan ook materialen toevoegen door bijlagen te emailen naar (L$%1$s%). De documenten zullen automatisch verschijnen op de vergaderpagina.
sv: %(B$Tips:%) Du kan även lägga till material genom att skicka bifogade filer via e-post till (L$%1$s%). Dokumenten kommer att visas på mötessidan automatiskt.

source: To learn more about operating Meetin.gs by email, reply to this email with %(B$EMAIL HELP%) as the first words of your reply. The help will arrive momentarily!
fi: Meetin.gs-palvelua pystyy käyttämään myös kokonaan sähköpostilla. Vastaa tähän viestiin kirjoittamalla %(B$EMAIL HELP%) niin saat tarkemmat ohjeet.
fr: Pour en savoir plus sur les opérations effectuées par Meetin.gs par e-mail, répondez à cet e-mail en indiquant %(B$EMAIL HELP%) au début de votre message. Vous bénéficierez d'une assistance au plus vite !
nl: Beantwoord dit bericht met (B$EMAIL HELP%) als eerste woorden in je bericht om meer te leren over het werken met Meetin.gs via e-mail. Hulp zal binnen korte tijd arriveren!
sv: Om du vill lära dig mer om att arbeta med Meetin.gs via e-post, kan du svara på det här e-postmeddelandet och skriva %(B$EMAIL HELP%) som första ord i svaret. Hjälpen kommer på ett ögonblick!

source: You have joined
fi: Olet liittynyt
fr: Vous avez joint
nl: U bent lid
sv: Du har anslutit dig

source: Meeting confirmed:
fi: Kokous vahvistettu:
fr: Réunion confirmée :
nl: Vergadering bevestigd:
sv: Mötet bekräftades:

source: Invitation to schedule:
fi: Auta valitsemaan aika kokoukselle:
fr: Invitation à organiser :
nl: Uitnodiging om in te plannen:
sv: Inbjudan till schemaläggning:

source: Meeting invitation:
fi: Kutsu tapaamiseen:
fr: Invitation à la réunion :
nl: Vergaderverzoek:
sv: Inbjudan till möte:

source: LOG IN
fi: Kirjaudu sisään
fr: SE CONNECTER
nl: INLOGGEN
sv: LOGGA IN

source: Home
fi: Koti
fr: Maison
nl: Thuis
sv: Hem

source: About
fi: Tiedot
fr: À propos
nl: Over
sv: Om

source: Features
fi: Toiminnallisuudet
fr: Paramètres
nl: Kenmerken
sv: Funktioner

source: Pricing
fi: Hinnoittelu
fr: Évaluation
nl: Tarifering
sv: Priser

source: Press
fi: Lehdistö
fr: Appuyez
nl: Druk

source: Blog
fi: Blogi
sv: Blogg

source: Add Participants
fi: Lisää osallistujia
fr: Ajouter des participants
nl: Voeg deelnemers toe
sv: Lägg till deltagare

source: Send Invitations
fi: Lähetä kutsut
fr: Envoyer les invitations
nl: Stuur uitnodigingen
sv: Skicka inbjudningar

source: Fill Action Points
fi: Lisää sovitut toimenpiteet
fr: Remplir le plan d'action
nl: Vul actiepunten in
sv: Fyll på med aktivitetspoäng

source: Set a Title
fi: Aseta otsikko
fr: Définir un titre
nl: Leg een titel vast
sv: Ange titel

source: Suggest Dates
fi: Ehdota ajankohtia
fr: Suggestion de dates
nl: Stel data voor
sv: Föreslå datum

source: Set the Location
fi: Aseta paikka
fr: Définir le lieu
nl: Leg de locatie vast
sv: Ange plats

source: Add Agenda
fi: Lisää agenda
fr: Ajouter un programme
nl: Voeg agenda toe
sv: Lägg till dagordning

source: a moment ago
fi: hetki sitten
fr: il y a un instant
nl: even geleden
sv: ett ögonblick sedan

source: an hour ago
fi: tunti sitten
fr: il y a une heure
nl: een uur geleden
sv: en timme sedan

source: one hour ago
fi: yksi tunti sitten
fr: il y a %1$d heures
nl: %1$sd uren geleden
sv: %1$d timmar sedan

source: yesterday
fi: eilen
fr: hier
nl: gisteren
sv: I går

source: on monday
fi: maanantaina
fr: lundi
nl: op maandag
sv: på måndag

source: on tuesday
fi: tiistaina
fr: mardi
nl: op dinsdag
sv: på tisdag

source: on wednesday
fi: keskiviikkona
fr: mercredi
nl: op woensdag
sv: på onsdag

source: on thursday
fi: torstaina
fr: jeudi
nl: op donderdag
sv: på torsdag

source: on friday
fi: perjantaina
fr: vendredi
nl: op vrijdag
sv: på fredag

source: on saturday
fi: lauantaina
fr: samedi
nl: op zaterdag
sv: på lördag

source: on sunday
fi: sunnuntaina
fr: dimanche
nl: op zondag
sv: på söndag

source: one day ago
fi: yksi päivä sitten
fr: il y a %1$s jours
nl: %1$s dagen geleden
sv: %1$d dagar sedan

source: Last visited %1$s.
fi: Viimeksi käyty %1$s.
fr: Dernière visite %1$s.
nl: Laatst bezocht %1$s.
sv: Senaste besök %1$s

source: Email opened %1$s.
fi: Sähköposti avattu %1$s.
fr: E-mail ouvert %1$s.
nl: E-mail geopend %1$s.
sv: E-postmeddelande öppnat %1$s.

source: RSVP request sent %1$s.
fi: RSVP lähetetty %1$s.
fr: Demande de réponse envoyée %1$s.
nl: RSVP verzoek verstuurd %1$s.
sv: Inbjudan med anhållan om svar har skickats %1$s.

source: Invitation sent %1$s.
fi: Kutsu lähetetty %1$s.
fr: Invitation envoyée %1$s.
nl: Uitnodiging verzonden %1$s.
sv: Inbjudan har skickats %1$s.

source: Attending.
fi: Läsnä.
fr: Présent(e).
nl: Deelnemend
sv: Deltar.

source: Not attending.
fi: Poissa.
fr: Absent(e).
nl: Niet deelnemend.
sv: Deltar inte.

source: Not answered yet.
fi: Vastaamatta.
fr: N'a pas encore répondu.
nl: Nog niet beantwoord.
sv: Ej svarat ännu.

source: Presumedly attending.
fi: Oletettavasti läsnä.
fr: Participation probable.
nl: Voorgenomen deelname
sv: Kommer antagligen att delta

source: Answered suggested times.
fi: Vastannut ehdotettuihin ajankohtiin.
fr: Heures proposées répondues :
nl: Antwoorden op voorgestelde tijden
sv: Föreslagna tidpunkter besvarade.

source: Set as Attending.
fi: Asetettu läsnäolevaksi.
fr: Définir comme « présent(e) ».
nl: Ingesteld als deelnemend
sv: Deltar i mötet.

source: Set as Not attending.
fi: Asetettu poissaolevaksi.
fr: Définir comme « absent(e) ».
nl: Ingesteld aan niet deelnemend
sv: Ange som "Deltar ej".

source: User not invited yet.
fi: Käyttäjää ei ole vielä kutsuttu.
fr: Utilisateur non invité.
nl: Gebruiker nog niet uitgenodigd.
sv: Användaren har ej bjudits in ännu.

source: Mon
fi: Ma
fr: Lun
nl: Ma.
sv: Mån

source: Tue
fi: Ti
fr: Mar
nl: Di.
sv: Tis

source: Wed
fi: Ke
fr: Mer
nl: Woe.
sv: Ons

source: Thu
fi: To
fr: Jeu
nl: Do.
sv: Tor

source: Fri
fi: Pe
fr: Ven.
nl: Vrij.
sv: Fre

source: Sat
fi: La
fr: Sam
nl: Zat.
sv: Lör

source: Sun
fi: Su
fr: Dim
nl: Zon
sv: Sön

source: Jan
fi: Tammi

source: Feb
fi: Helmi
fr: Fév
nl: Febr.

source: Mar
fi: Maalis
nl: Mrt.

source: Apr
fi: Huhti
fr: Avr

source: May
fi: Touko
fr: Mai
nl: Mei
sv: Maj

source: Jun
fi: Kesä
fr: juin

source: Jul
fi: Heinä
fr: Jui

source: Aug
fi: Elo
fr: Aoû

source: Sep
fi: Syys

source: Oct
fi: Loka
nl: Okt
sv: Okt

source: Nov
fi: Marras

source: Dec
fi: Joulu
fr: Déc

source: This meeting is tentative. Wait for %1$s to confirm the meeting.
fi: Kokouksen toteutuminen on epävarmaa. Odota, että %1$s vahvistaa kokouksen.
fr: Cette réunion est provisoire. Attendez %1$s pour confirmer la réunion.
nl: De vergadering is voorlopig. Wacht op %1$s om de vergadering te bevestigen.
sv: Detta möte är preliminärt. Vänta på %1$s bekräftar mötet.

source: (tentative)
fi: (vahvistamaton)
nl: (voorlopig)
sv: (preliminärt)

source: Action Points
fi: Toimenpiteet
fr: Plan d'action
nl: Actiepunten
sv: Poäng för verksamhet

source: Previous Action Points
fi: Aikaisemmin sovitut toimenpiteet
fr: Éléments d'action précédents
nl: Voorgaande actiepunten
sv: Poäng för tidigare verksamhet

source: Scheduling Discussion
fi: Keskustelu tapaamisajasta
fr: Discussion sur la programmation
nl: Discussie over planning
sv: Diskussion om tidsplanering

source: %1$s and %2$s
fi: %1$s ja %2$s
fr: %1$s et %2$s
nl: %1$s en %2$s
sv: %1$s och %2$s

source: Online
fi: Verkossa
fr: En ligne
sv: På nätet

source: Tool not set
fi: Etätyökalua ei ole asetettu
fr: L'outil n'est pas prêt
nl: Tool niet ingesteld.
sv: Verktyget är inte inställt

source: Location not known
fi: Sijainti ei tiedossa
fr: Localisation inconnue
nl: Locatie niet bekend
sv: Platsen är inte känd

source: On Skype
fi: Skypessä
fr: Sur Skype
nl: op Skype
sv: På Skype

source: On the phone
fi: Puhelimessa
fr: Au téléphone
nl: Aan de telefoon
sv: På telefonen

source: On Hangout
fi: Google Hangoutissa
fr: Sur Hangout
nl: Op Hangout
sv: På Hangout

source: On Lync
fi: MS Lyncissä
fr: Sur Lync
nl: Over Lync
sv: På Lync

source: On a custom tool
fi: Omavalintaisessa työkalussa
fr: Sur un outil personnalisé
nl: over een aangepast hulpmiddel
sv: På ett anpassat verktyg

source: Untitled meeting
fi: Nimetön kokous
fr: Réunion sans titre
nl: Vergadering zonder onderwerp.
sv: Möte utan rubrik

source: Meeting between %1$s
fi: Kokous henkilöiden %1$s välillä.
fr: Réunion entre %1$s
nl: Meeting tussen %1$s
sv: Möte mellan %1$s

source: Receive email notification when:
fi: Huomautus sähköpostitse kun:
fr: Recevoir une notification par e-mail lorsque :
nl: E-mail-notificatie ontvangen wanneer:
sv: Notifiering via e-post då:

source: Meeting invitation received
fi: Kokouskutsu vastaanotettu
fr: Invitation à la réunion reçue
nl: Uitnodiging voor vergadering ontvangen
sv: Mötesinbjudan har mottagits

source: Date or time changes
fi: Muutoksia aikatauluissa
fr: Modifications de la date et de l'heure
nl: Datum- of tijdsveranderingen
sv: Ändringar av datum eller tid

source: Meeting starts in 24 hours
fi: Kokouksen alkuun 24 tuntia
fr: Réunion commence dans 24 heures
nl: Vergadering begint over 24 uur
sv: Mötet börjar om 24 timmar.

source: Online meeting starts in 15min
fi: Etäkokouksen alkuun 15min
fr: Réunion en ligne commence dans 15 min
nl: Online-vergadering begint in 15 minuten
sv: Onlinemötet börjar om 15 min

source: Action points should be filled
fi: Muistutus: lisää jatkotoimenpiteet
fr: Les points d'action devraient être remplis
nl: Actiepunten moeten worden ingevuld
sv: Åtgärdspunkterna bör fyllas i

source: Meet Me request is received
fi: Meet Me pyyntö vastaanotettu
fr: La demande « me rencontrer » a été reçue
nl: De "ontmoet me"-aanvraag is ontvangen
sv: Träffa mig-begäran har mottagits

source: Included in daily digest email:
fi: Päivittäisessä tiivistelmässä:
fr: Inclus dans l'e-mail de résumé quotidien :
nl: Inbegrepen in de dagelijkse digest-e-mail:
sv: Inkluderat i det dagliga sammanfattningsmeddelandet via e-post:
