Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_front-*.po
Languages: fi, fr, nl, sv

source: What materials have you uploaded for the other party to look at before the meeting takes place? Consider uploading the following documents: executive summary and company presentation / pitch deck. You can add them on the left.
fi: Mitä kokousmateriaaleja olet ladannut jaettavaksi toisen osapuolen katsottavaksi ennen kokousta? Harkitse olisiko järkevää jakaa esimerkiksi tiivistelmä liikeideastasi, yritysesittely tai myyntipresentaatio. Voit lisätä materiaaleja vasemmalta.
fr: Quels contenus avez-vous mis en ligne à la disposition de l'autre partie avant la tenue du rendez-vous ? Pensez à mettre en ligne les documents suivants : résumé opérationnel et présentation de la société / argumentaire. Vous pouvez les ajouter à gauche.
nl: Wat voor materiaal heeft u geüpload voor de andere partij om te bekijken voordat de vergadering plaatsvindt? Overweeg de volgende documenten te uploaden: uitgebreide samenvatting en bedrijfspresentatie / pitch deck. U kunt ze aan de linkerkant toevoegen.
sv: Vilket material har du laddat upp för andra att se på före mötet? Fundera på att ladda upp följande dokument: sammanfattning och företagspresentation / marknadsföringsmaterial. Du kan lägga till dem till vänster.

source: Are you providing a link to a product demo? Add instructions for getting started with the demo.
fi: Tarjoatko linkin tuotedemoon? Syötä lisäohjeet demon käyttämistä varten.
fr: Vous donnez un lien vers une démonstration de produit ? Ajoutez des instructions pour faire fonctionner la démonstration.
nl: Geeft u een link naar een product demo op? Voeg instructies toe om met de demo te beginnen.
sv: Ger du en länk till en produkt-demo? Lägg till instruktioner för att komma igång med demon.

source: Clear? Now click "Edit" button above to fill the information.
fi: Selvä? Paina nyt "Muokkaa" painiketta täytääksesi tiedot.
fr: Prêt ? Maintenant cliquez sur le bouton « Modifier » ci-dessus pour entrer les informations.
nl: Duidelijk? Klik nu op "Bewerken" hierboven om de informatie in te vullen.
sv: OK? Klicka nu på knappen "Redigera" ovan och fyll i informationen.

source: %(S$Click "Edit" button%) above to fill the agenda, so participants will know why the meeting takes place:
fi: %(S$Paina yllä olevaa "Muokkaa"-painiketta%) täyttääksesi agendan. Näin osallistujat tietävät miksi kokousta ollaan järjestämässä.
fr: %(S$Cliquez le bouton « Modifier »%) ci-dessus pour remplir l'agenda, afin que les participants sachent pourquoi le rendez-vous a lieu :
nl: %(S$Klik op "Bewerken" %) bovenaan om de agenda te vullen, zodat deelnemers zullen weten waarom de vergadering plaatsvindt:
sv: %(S$Klicka på "Edit" -knappen%) ovan för att fylla i agendan, så att deltagarna vet var mötet ska äga rum:

source: What is the objective and desired outcome of the meeting?
fi: Mikä on tapaamisen tarkoitus ja tavoitteet?
fr: Quel est l'objectif et le résultat souhaité du rendez-vous ?
nl: Wat is het doel en de gewenste uitkomst van de vergadering?
sv: Vilket är syftet och det önskade resultatet av mötet?

source: What happens during the meeting?
fi: Mitä kokouksen aikana tapahtuu?
fr: Que se passe-t-il pendant le rendez-vous ?
nl: Wat gebeurt er tijdens de vergadering?
sv: Vad händer under mötet?

source: How participants should prepare?
fi: Kuinka osanottajien tulisi valmistautua?
fr: Comment doivent se préparer les participants ?
nl: Hoe moeten deelnemers zich voorbereiden?
sv: Hur bör deltagarna förbereda sig?

source: NOTE: We'll send the agenda along with the invitation email.
fi: HUOM: Agenda toimitetaan kutsuviestin yhteydessä.
fr: REMARQUE : Nous enverrons l'agenda en même temps que le courriel d'invitation.
nl: LET OP: We sturen de agenda samen met de uitnodigingsmail.
sv: OBS! Vi skickar agendan med inbjudningsmailet.

source: %(S$Click "Edit" button%) above to fill in the action points:
fi: %(S$Paina yllä olevaa "Muokkaa"-painiketta%) laatiaksesi listan sovituista toimenpiteistä:
fr: %(S$Cliquez le bouton « Modifier »%) ci-dessus pour remplir les éléments d'action :
nl: %(S$Klik "Bewerken" %) hierboven om de actiepunten in te vullen:
sv: %(S$Klicka på knappen "Redigera" %) ovan och fyll i åtgärdspoängen:

source: What actions are we committing to?
fi: Mihin toimiin sitoudutaan?
fr: À quelles actions nous engageons-nous ?
nl: Voor welke acties zetten we ons in?
sv: Vilka åtgärder åtar vi oss?

source: Who is responsible for each action?
fi: Kuka vastaa mistäkin toimenpiteestä?
fr: Qui est responsable pour chaque action ?
nl: Wie is er voor elke actie verantwoordelijk?
sv: Vem har ansvar för varje handling?

source: When will those actions be completed?
fi: Milloin näiden toimien tulisi olla suoritettu?
fr: Quand ces actions seront-elles terminées ?
nl: Wanneer zijn deze acties voltooid?
sv: När kommer de här åtgärderna att vara klara?

source: NOTE: We'll send the action points along with the meeting summary email 12 hours after the meeting.
fi: HUOM: Lähetämme listan sovituista toimenpiteistä sekä yhteenvedon kokouksesta 12 tuntia sen päättymisen jälkeen.
fr: REMARQUE : Nous enverrons les éléments d'action en même temps que le courriel récapitulatif du rendez-vous 12 heures après le rendez-vous.
nl: LET UP: We sturen de actiepunten samen met de samenvattende email van de vergadering 12 uur na de vergadering.
sv: OBS! Vi skickar åtgärdspoängen tillsammans med sammanfattningen av mötet med e-post, 12 timmar efter mötet.

source: %(S$Click "Edit" button%) above to edit this document.
fi: %(S$Klikkaa "Muokkaa" -painiketta%) käsitelläksesi dokumenttia.
fr: %(S$Cliquez le bouton% « Modifier ») ci-dessus pour modifier ce document.
nl: %(S$Klik "Bewerken" %) hierboven om dit document te bewerken.
sv: %(S$Klicka på knappen "Redigera"%) ovan för att redigera detta dokument.

source: Confirm & accept meeting
fi: Vahvista ja hyväksy tapaaminen
fr: Confirmer et accepter la réunion
nl: Bevestig & accepteer de vergadering
sv: Bekräfta & acceptera mötet

source: Confirm meeting details
fi: Vahvista tapaamisen tiedot
fr: Confirmer les détails de la réunion
nl: Bevestig details van de vergadering
sv: Bekräfta mötesinformation

source: (before sending the invites)
fi: (ennen kuin lähetämme kutsut)
fr: (avant que nous n'envoyions les invitations)
nl: (vooraleer we uitnodigingen sturen)
sv: (innan vi skickar inbjudningar)

source: Confirm sending invites
fi: Vahvista kutsujen lähettäminen
fr: Confirmer l'envoi des invitations
nl: Bevestig de verzenden van uitnodigingen
sv: Bekräfta sändning av inbjudningar

source: Meeting title
fi: Kokouksen nimi
fr: Titre de la réunion
nl: Meeting titel
sv: Mötestitel

source: Time is not set
fi: Aikaa ei ole asetettu
fr: L'heure n'est pas réglée
nl: Tijd is niet ingesteld
sv: Tid är inte inställt

source: Location is not set
fi: Sijaintia ei ole asetettu
fr: Le lieu n'est pas défini
nl: Locatie niet bekend
sv: Platsen är inte känd

source: Require participants to RSVP
fi: Vaadi osallistujilta RSVP
fr: Exiger des participants une confirmation de présence
nl: Vraag deelnemers om RSVP
sv: Begär att deltagarna ska svara

source: We will require participants to let you know whether they are coming or not. We will also remind them from time to time until they answer.
fi: Vaadimme osallistujia ilmoittamaan ovatko he osallistumassa kokoukseen. Lähetämme heille myös muistutuksia kunnes saamme vastauksen.
fr: Nous exigerons des participants qu'ils vous fassent savoir s'ils viennent ou non. Nous leur rappellerons également de temps en temps jusqu'à ce qu'ils répondent.
nl: We zullen de deelnemers vragen om u mee te delen dat ze al of niet komen. We zullen hen er ook regelmatig aan herinneren totdat ze antwoorden.
sv: Vi begär att deltagarna låter dig veta om de kommer eller inte. Vi påminner dem också då och då, tills de svarar.

source: Add People to Your Meeting
fi: Lisää tapaamiseen henkilöitä.
fr: Ajouter des personnes à votre rendez-vous
nl: Voeg mensen toe aan uw ontmoeting
sv: Lägg till deltagare till ditt möte.

source: (Don't worry, we won't send them anything yet)
fi: (Älä huoli, emme lähetä heille vielä mitään)
fr: (Pas d'inquiétude, nous ne leur enverrons rien pour l'instant)
nl: (Maak u geen zorgen, we zullen hen nog niets opsturen)
sv: (Oroa dig inte, vi skickar inget till dem ännu)

source: Get your contacts:
fi: Hae yhteystietosi:
fr: Obtenez vos contacts :
nl: Verkrijg uw contacten:
sv: Få dina kontakter:

source: Confirm
fi: Vahvista
fr: Confirmer
nl: Bevestigen
sv: Bekräfta

source: New Contact
fi: Uusi yhteystieto
fr: Nouveau Contact
nl: Nieuw contact
sv: Ny kontakt

source: Name
fi: Nimi
fr: Nom
nl: Naam
sv: Namn

source: Transfer Your Invite
fi: Siirrä kutsusi
fr: Transférer votre invitation
nl: Uw uitnodiging overmaken
sv: Överför din inbjudan

source: What email would you like to use to receive the meeting updates?
fi: Mihin sähköpostiosoitteeseen haluat kokouksiin liittyvät tiedot ja ilmoitukset?
fr: Quel e-mail souhaiteriez-vous utiliser pour recevoir les mises à jour de la rencontre ?
nl: Welke e-mail zou u willen gebruiken om de updates van de ontmoetingen te ontvangen?
sv: Vilken e-postadress vill du använda för att ta emot mötesuppdateringar?

source: You can also set Meetin.gs to do this transfer automatically in the future.
fi: Voit myös asettaa siirron tapahtumaan automaattisesti tulevaisuudessa.
fr: Vous pouvez aussi régler Meetin.gs pour faire ce transfert automatiquement dans le futur.
nl: U kunt ook Meetin.gs instellen om deze overdracht in de toekomst automatisch te doen.
sv: Du kan också ställa in Meetin.gs så att överföringen görs automatiskt i framtiden.

source: Transfer automatically in the future
fi: Tee siirto automaattisesti tulevaisuudessa
fr: Transférer automatiquement à l'avenir
nl: Automatische overdracht in de toekomst
sv: Överför automatiskt i framtiden

source: A log in link has been sent to %1$s.
fi: Kirjautumislinkki on lähetetty sähköpostitse osoitteeseen %1$s.
fr: Un lien de connexion a été envoyé à %1$s.
nl: Een inlog-link werd gestuurd naar %1$s.
sv: En inloggningslänk har skickats till %1$s.

source: Failure
fi: Häiriö
fr: Échec
nl: Storing
sv: Misslyckades

source: Basic Information
fi: Perustiedot
fr: Informations de base
nl: Fundamentele informatie
sv: Grundläggande information

source: Title//context:meeting title
fi: Otsikko
fr: Titre
nl: Titel
sv: Rubrik

source: Change
fi: Vaihda
fr: Changer
nl: Wijzigen
sv: Ändra

source: Date
fi: Päivämäärä
nl: Datum
sv: Datum

source: Meeting is being scheduled.
fi: Etsitään aikaa kokoukselle.
fr: La réunion est en cours de programmation.
nl: De ontmoeting is gepland.
sv: Mötet schemaläggs.

source: Show current status
fi: Näytä tila
fr: Afficher l'état actuel
nl: Toon de huidige status
sv: Visa aktuell status

source: Cancel scheduling
fi: Peru ajan sopiminen
fr: Annuler la programmation
nl: Annuleer de planning
sv: Avbryt schemaläggning

source: Not set
fi: Ei asetettu
fr: Non défini(e)
nl: Niet ingesteld
sv: Ej angivet

source: Time
fi: Aika
fr: Heure
nl: Tijd
sv: Tid

source: Duration
fi: Kesto
fr: Durée
nl: Duur
sv: Längd

source: Set time
fi: Aseta aika
fr: Définir l'heure
nl: Tijd instellen
sv: Ange tid

source: Do you want to suggest multiple dates to participants instead of setting the date directly?
fi: Haluatko ehdottaa kokoukseen osallistujille useampia mahdollisia ajankohtia sen sijaan, että valitsisit suoraan yhden?
fr: Voulez-vous suggérer plusieurs dates aux participants au lieu de régler la date directement ?
nl: Wilt u aan de deelnemers meerdere data suggereren in plaats van het ineens instellen van de data?
sv: Vill du föreslå flera datum för deltagarna, istället för att ställa in datum direkt?

source: Start suggesting dates
fi: Ehdota ajankohtia
fr: Commencer à suggérer des dates
nl: Begin data voor te stellen
sv: Börja föreslå datum

source: Location
fi: Sijainti
fr: Lieu
nl: Locatie
sv: Plats

source: Online
fi: Verkossa
fr: En ligne

source: Edit Meeting Email Settings
fi: Muuta kokouksen sähköpostiasetuksia
fr: Modifier les paramètres de courriel de rendez-vous
nl: Maak e-mailinstellingen op voor ontmoetingen
sv: E-postinställningar för mötesredigering

source: Email notification settings for the current meeting:
fi: Kokoukseen liittyvien sähköposti-ilmoitusten asetukset:
fr: Réglages de notifications e-mail pour la rencontre actuelle :
nl: E-mail-aankondigingsinstellingen voor de actuele ontmoeting:
sv: Inställningar för e-postmeddelande för det aktuella mötet:

source: Meeting start reminder
fi: Muistutus kokouksen alkamisesta
fr: Rappel du début de la rencontre
nl: Herinnering van de ontmoetingsbegin
sv: Påminnelse om mötesstart

source: Participant digest
fi: Ilmoitukset muutoksista kokoukseen
fr: Aperçu du participant
nl: Deelnemer verwerken
sv: Deltagarlista

source: New participant notification
fi: Ilmoitus uudesta osallistujasta
fr: Notification de nouveau participant
nl: Aankondiging van nieuwe deelnemer
sv: Ny deltagarinformation

source: New material notification
fi: Ilmoitus uudesta kokousmateriaalista
fr: Notification de nouvel élément
nl: Aankondiging van nieuw materiaal
sv: Meddelande om nytt material

source: New comment notification
fi: Ilmoitus uudesta kommentista
fr: Notification de nouveau commentaire
nl: Aankondiging van nieuw commentaar
sv: Meddelande om ny kommentar

source: Participant Rights
fi: Käyttöoikeudet
fr: Droits de participant
nl: Deelnemersrechten
sv: Deltagarens rättigheter

source: Email Settings
fi: Sähköpostiasetukset
fr: Paramètres de courriel
nl: E-mail-instellingen
sv: E-postinställningar

source: Remove Meeting
fi: Poista kokous
fr: Retirer la rencontre
nl: Ontmoeting verwijderen
sv: Ta bort möte

source: Edit Participant Rights
fi: Muutokset osallistujien käyttöoikeuksiin
fr: Éditer les droits des participants
nl: Deelnemersrechten opmaken
sv: Redigera deltagarnas rättigheter

source: Participants of this meeting are allowed to:
fi: Tämän kokouksen osallistujilla on oikeus:
fr: Les participants de cette rencontre ont le droit de :
nl: Deelnemers aan deze ontmoeting zijn in staat om:
sv: Deltagare i detta möte har tillåtelse att:

source: Invite new participants
fi: Kutsua uusia osanottajia
fr: Inviter de nouveaux participants
nl: Nieuwe deelnemers uitnodigen
sv: Bjud in nya deltagare

source: Edit material
fi: Muokata kokousmateriaaleja
fr: Éditer l'élément
nl: Materiaal opmaken
sv: Redigera material

source: Edit Meeting Password
fi: Muokkaa kokouksen salasanaa
fr: Éditer le mot de passe de la rencontre
nl: Ontmoetingswachtwoord opmaken
sv: Redigera möteslösenordet

source: Note: By removing this meeting, you and your participants will no longer be able to access this meeting and content related to it.
fi: Huom! Kokouksen poistaminen hävittää kaikki siihen liittyvät tiedot ja materiaalit. Tämän jälkeen osallistujilla eikä sinulla ole mahdollisuutta päästä niihin käsiksi.
fr: Note : En enlevant cette rencontre, vous et vos participants ne pourront plus avoir accès à cette rencontre et au contenu qui y est lié.
nl: Nota: door het verwijderen van deze ontmoeting, zullen u en uw deelnemers niet langer in staat zijn toegang te hebben tot deze ontmoeting en de inhoud ervan.
sv: Obs! Genom att ta bort detta möte, kommer du och dina deltagare inte längre att kunna komma åt mötet och innehåll som hör ihop med det.

source: Confirm the time
fi: Vahvista valittu aika
fr: Confirmer l'heure
nl: Bevestig de tijd
sv: Bekräfta tid

source: 12h clock
fi: 12h kello
fr: Horloge 12h
nl: 12-uursklok
sv: 12-timmars klocka

source: 24h clock
fi: 24h kello
fr: Horloge 24h
nl: 24-uursklok
sv: 24-timmarsklocka

source: show in my timezone
fi: näytä oman aikavyöhykkeen aika
fr: afficher dans mon fuseau horaire
nl: In mijn tijdzone laten zien
sv: visa i min tidszon

source: show in their timezone
fi: näytä toisen osapuolen aikavyöhykkeen aika
fr: afficher dans leur fuseau horaire
nl: In hun tijdzone laten zien
sv: visa i deras tidszon

source: You have %(B$15 minutes%) to complete this form. Leave a note or preliminary agenda on why you want to meet.
fi: Sinulla on %(B$15 minuuttia%) aikaa täyttää tämä lomake. Jätä viesti tai alustava agenda.
fr: Vous avez %(B$15 minutes%) pour compléter ce formulaire. Laissez une note ou un programme préliminaire sur la raison de votre demande de rencontre.
nl: U heeft %(B$15 minuten%) om dit formulier in te vullen. Laat een bericht of voorlopige agenda achter over de reden waarom u wilt vergaderen.
sv: Du har %(B$15 minuter%) på dig för att avsluta detta formulär. Lämna ett meddelande eller preliminär agenda där du skriver varför du vill att ni ska träffas.

source: Why do you want to meet and what the proposed agenda will be?
fi: Miksi haluat tavata ja mitä ehdotat agendaksi?
fr: Pourquoi voulez-vous un rendez-vous et quel sera l'agenda proposé ?
nl: Waarom wilt u een ontmoeting hebben en wat zal de voorgestelde agenda bevatten?
sv: Varför vill du träffas och vilken är den föreslagna agendan?

source: A notification about the declination will be sent to %1$s. This meeting page will be removed in the process.
fi: %1$s saa ilmoituksen, että olet kieltäytynyt tapaamisesta. Samalla tämä kokoussivu poistetaan.
fr: Une notification du refus sera envoyée à %1$s. Cette page de réunion sera également retirée.
nl: Een aankondiging over de declinatie zal gestuurd worden naar %1$s. Deze ontmoetingspagina zal in het proces verwijderd worden.
sv: Ett meddelande om ändringen skickas till %1$s.. Denna mötessida kommer att tas bort.

source: Leave a comment on why you had to decline the request to meet (optional):
fi: Voit jättää tähän selityksen sille, miksi kieltäydyit tapaamisesta.
fr: Laisser un commentaire sur la raison de votre refus de la requête de rencontre (facultatif) :
nl: Laat een commentaar achter over waarom u de ontmoetingsaanvraag hebt moeten afslaan (optioneel):
sv: Lämna en kommentar om varför du måste avböja förfrågan att mötas (valfritt):

source: Decline
fi: Hylkää
fr: Refuser
nl: Afslaan
sv: Avböj

source: You have reached your limit for matchmaking
fi: Olet saavuttanut matchmaking-palvelun kautta sovittujen tapaamisten enimmäismäärän.
fr: Vous avez atteint votre limite de rapprochement
nl: U hebt uw limiet bereikt voor matchmaking
sv: Du har nått din gräns för matchmaking

source: To guarantee that everybody has a fair chance for scheduling an appointment, the matchmaking has been limited to 4 appointments per person.
fi: Jotta kaikilla halukkailla olisi yhtäläinen mahdollisuus saada tapaamisia sovittua, on niiden enimmäismäärä rajattu neljään tapaamiseen henkilöä kohden.
fr: Pour garantir à tout le monde une chance équitable d'organiser un rendez-vous, le rapprochement a été limité à 4 rendez-vous par personne.
nl: Om te garanderen dat iedereen een eerlijke kans heeft om een afspraak te plannen, is de matchmaking beperkt tot 4 afspraken per persoon.
sv: För att garantera alla en rättvis chans att schemalägga ett möte, har matchmakingen begränsats till 4 möten per person.

source: Matchmaking
fi: Matchmaking-palvelu
fr: Mise en relation
sv: Matchning

source: Website
fi: Verkkosivu
fr: Site web
sv: Webbsida

source: Watch pitch video
fi: Katso nauhoitettu myyntipuhe
fr: Regarder la présentation vidéo
nl: Bekijk de pitch-video
sv: Se reklamvideo

source: More info
fi: Lisää tietoa
fr: Plus d'informations
nl: Meer informatie
sv: Mer information

source: Schedule
fi: Sovi tapaaminen
fr: Emploi du temps
nl: Planning
sv: Schema

source: The link has expired
fi: Linkki on vanhentunut
fr: Le lien a expiré.
nl: De link is verlopen
sv: Länkens giltighetstid har gått ut

source: The meeting request link is valid only for 1 hour.
fi: Linkki kokouksen ehdotukselle on voimassa vain tunnin ajan.
fr: Le lien de demande de rendez-vous n'est valable qu'une heure.
nl: De link van de ontmoetingsaanvraag is slechts 1 uur geldig.
sv: Länken för mötesförfrågan är giltig endast i 1 timme.

source: Suggest a new time
fi: Ehdota uutta ajankohtaa
fr: Proposer un nouvel horaire.
nl: Stel een nieuwe tijd voor
sv: Föreslå en ny tid

source: Back to matchmaking
fi: Takaisin matchmaking-palveluun
fr: Retour à la mise en relation
nl: Terug naar matchmaking
sv: Tillbaka till matchmaking

source: Thank you for registering for matchmaking
fi: Kiitos rekisteröitymisestäsi matchmaking-palveluun
fr: Merci de vous être inscrit au rapprochement
nl: Dank u voor de registratie voor matchmaking
sv: Tack för att du registrerar dig för matchmaking

source: You will soon receive requests to meet from matchmaking participants.
fi: Tulet pian saamaan tapaamispyyntöjä muilta matchmaking-palvelun käyttäjiltä.
fr: Vous recevrez bientôt des requêtes de rencontre des participants au rapprochement.
nl: U zult binnenkort ontmoetingsaanvragen ontvangen van matchmaking-deelnemers.
sv: Du kommer snart att få förfrågningar till möten, från deltagare i matchmakingen.

source: You should also subscribe to the ICS calendar feed to get upcoming meetings automatically into your calendar.
fi: On suositeltavaa, että lisäät ICS-kalenterisyötteen kalenteriohjelmaasi. Näin tulevat kokoukset lisätään automaattisesti kalenteriisi.
fr: Vous devriez également vous abonner au fil d'information ICS du calendrier pour récupérer les futures rencontres automatiquement dans votre calendrier.
nl: U zou zich ook moeten abonneren op de ICS-kalendervoeding om automatisch komende ontmoetingen op uw kalender te krijgen.
sv: Du borde också prenumerera på feeden från ICS-kalendern för att få kommande möten automatiskt till din kalender.

source: Subscribe to ICS calendar feed
fi: Tilaa ICS-kalenterisyöte
fr: S'abonner au fil d'information ICS du calendrier
nl: Teken in op ICS-kalendervoeding
sv: Prenumerera på feed från ICS-kalender

source: If you have any questions, you can contact us at %(L$%(B$%1$s%)%).
fi: Mikäli sinulla on mitään kysyttävää, voit olla meihin yhteydessä sähköpostitse osoitteella %(L$%(B$%1$s%)%).
fr: Si vous avez des question, vous pouvez nous contacter à %(L$%(B$%1$s%)%).
nl: Als u vragen hebt, kunt u ons contacteren op %(L$%(B$%1$s%)%).
sv: Om du har frågor, kan du kontakta oss på %(L$%(B$%1$s%)%).

source: Return to website
fi: Palaa verkkosivulle
fr: Retour au site web
nl: Terugkeren naar website
sv: Tillbaka till webbsida

source: Thank you!
fi: Kiitos!
fr: Merci !
nl: Dank u wel!
sv: Tack!

source: %(B$%1$s%) is now preparing the online meeting page where you can further discuss details, create an agenda, and share materials before the actual meeting.
fi: %(B$%1$s%) valmistelee nyt kokoussivun, jossa voitte keskustella tapaamisen yksityiskohdista, suunnitella esityslistan ja jakaa materiaaleja ennen tapaamista.
fr: %(B$%1$s%) est maintenant en train de préparer la page de rencontre en ligne ou vous pourrez ensuite discuter des détails, créer un agenda, et partager des éléments avant la vraie rencontre.
nl: %(B$%1$s%) is nu de online vergaderpagina aan het voorbereiden waar u verder details kunt overleggen, een agenda kunt maken, en materiaal kunt delen voor aanvang van de feitelijke vergadering.
sv: %(B$%1$s%) förbereder nu mötessidan online, där du kan fortsätta att diskutera detaljer, skapa en agenda och dela material före mötet.

source: When ready, we will send you an automated notification containing a link to the meeting page.
fi: Toimitamme sinulle sähköpostitse kirjautumislinkin kun kokoussivu on valmis.
fr: Une fois prêt, nous vous enverrons une notification automatisée contenant un lien vers la page de la rencontre.
nl: Wanneer u klaar bent zullen we u een automatisch bericht sturen waarin een link naar de vergaderpagina is opgenomen.
sv: När det är klart skickar vi dig en automatisk avisering med en länk till mötessidan

source: Title://context:meeting title
fi: Otsikko:
fr: Titre:
nl: Titel:
sv: Rubrik:

source: When:
fi: Ajankohta:
fr: Quand :
nl: Wanneer:
sv: När:
