Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_front-*.po
Languages: fi, fr, nl, sv

source: There was an error processing the form. Please check your details! If this problem persists, you should contact our %(L$support%).
fi: Lomakkeen käsittelyssä tapahtui virhe. Ole hyvä ja tarkista täyttämäsi tiedot. Mikäli onelma ei poistu, ole yhtedessä %(L$tukipalveluumme%).
fr: Une erreur s'est produite lors du traitement du formulaire. Veuillez vérifier vos informations ! Si ce problème persiste, contactez notre %(L$assistance%).
nl: Er was een foutmelding bij het verwerken van het formulier. Bekijk alstublieft uw details! Als dit probleem aan blijft houden, neem dan contact op met onze %(L$ondersteuning%).
sv: Ett fel uppstod under processen. Var god kolla dina detaljer! Om detta problem uppstår igen bör du kontakta vår %(L$support%).

source: Sending...
fi: Lähetetään...
fr: Envoi...
nl: Versturen...
sv: Skickar...

source: Receipt sent.
fi: Kuitti lähetetty.
fr: Reçu envoyé.
nl: Ontvangstbewijs verzonden.
sv: Kvitto skickat.

source: Add Material
fi: Lisää materiaali
fr: Ajouter contenu
nl: Voeg materiaal toe
sv: Lägg till material

source: Upload a document
fi: Lisää dokumentti
fr: Mettre en ligne un document
nl: Upload een document
sv: Ladda upp ett dokument

source: Create an editable document
fi: Luo muokattava dokumentti
fr: Créer un document modifiable
nl: Maak een bewerkbaar document aan
sv: Skapa ett redigerbart dokument

source: Copy material from another meeting
fi: Kopioi materiaali toisesta kokouksesta
fr: Copier le contenu depuis un autre rendez-vous
nl: Kopieer materiaal van een andere meeting
sv: Kopiera material från ett annat möte

source: 1. Choose a meeting
fi: 1. Valitse tapaaminen
fr: 1. Choisissez un rendez-vous
nl: 1. Kies een meeting
sv: 1. Välj ett möte

source: Search...
fi: Hae...
fr: Recherche ...
nl: Zoek...
sv: Sök

source: 2. Choose Materials
fi: 2. Valitse materiaalit
fr: 2. Choisir les éléments
nl: 2. Kies materialen
sv: 2. Välj material

source: Choose a meeting on the left to see available materials!
fi: Valitse kokous vasemmalta nähdäksesi saatavilla olevat materiaalit.
fr: Choisissez un rendez-vous à gauche pour voir les contenus disponibles !
nl: Kies links een vergadering om de beschikbare materialen te zien!
sv: Välj ett möte till vänster för att se tillgängligt material!

source: %(S$0%) materials selected
fi: materiaaleja valittu %(S$0%) kpl
fr: %(S$0%) éléments sélectionnés
nl: %(S$0%) materialen geselecteerd
sv: %(S$0%) material valda

source: Add material
fi: Lisää materiaali
fr: Ajouter un élément
nl: Voeg materiaal toe
sv: Lägg till material

source: Cancel
fi: Peruuta
fr: Annuler
nl: Afbreken
sv: Avbryt

source: Uploading
fi: Lataus käynnissä
fr: Envoi
nl: Aan het uploaden
sv: Laddar upp

source: Cancel upload
fi: Peruuta lataus
fr: Annuler l'envoi
nl: Annuleer het uploaden
sv: Avbryt uppladdningen

source: New document
fi: Uusi dokumentti
fr: Nouveau document
nl: Nieuw document
sv: Nytt dokument

source: Title://context:material title
fi: Nimi:
fr: Titre:
nl: Titel:
sv: Namn:

source: Create
fi: Luo
fr: Créer
nl: Maak aan
sv: Skapa

source: Branding
fi: Brändäys
fr: Gestion de l'image de marque

source: Customize your appearance (change logo, background image and colors) to match your brand.
fi: Mukauta ulkoasu vastaamaan brändiäsi muuttamalla logo, taustakuva ja korostevärit.
fr: Personnalisez votre apparence (changement de logo, image et couleurs d'arrière-plan) pour qu'elle corresponde à votre marque.
nl: Pas uw voorkomen aan (logo, achtergrondafbeelding en kleuren veranderen) om het aan te passen aan uw merk.
sv: Anpassa ditt utseende (ändra logga, bakgrundsbild och färger) för att matcha ditt märke.

source: Header image
fi: Logo
fr: Image d'en-tête
nl: Hoofdafbeelding
sv: Header

source: Upload logo
fi: Lisää logo
fr: Mettre en ligne le logo
nl: Upload het logo
sv: Ladda upp logga

source: Reset logo
fi: Tyhjennä
fr: Réinitialiser le logo
nl: Stel logo opnieuw in
sv: Återställ logga

source: Maximum dimensions are 180 px by 40 px. Images larger than that will be scaled down. We support png and gif with transparency.
fi: Mitat ovat 180 x 40 pikseliä. Tätä suuremmat kuvat kutistetaan. Palvelu tukee png ja gif kuvia läpinäkyvyyksineen.
fr: Les dimensions maximales sont 180 px par 40 px. Les images de taille supérieure seront réduites. Nous acceptons les png et les gif avec transparence.
nl: De maximale afmetingen zijn 180 px bij 40 px. Afbeeldingen groter dan dat zullen worden afgebouwd. Wij verdragen png en gif met transparantie.
sv: Maxdimensioner är 180px gånger 40px. Bilder som är större än det kommer att bli nedskalade. Vi stödjer .png och .gif med transparens.

source: Highlight color
fi: Korosteväri
fr: Couleur de surlignage
nl: Steunkleur
sv: Markeringsfärg

source: Background image
fi: Taustakuva
fr: Image d'arrière-plan
nl: Achtergrondafbeelding
sv: Bakgrundsbild

source: Upload image
fi: Lisää kuva
fr: Mettre en ligne l'image
nl: Upload de afbeelding
sv: Ladda upp bild

source: Remove image
fi: Poista kuva
fr: Retirer l'image
nl: Verwijder de afbeelding
sv: Ta bort bild

source: Save
fi: Tallenna
fr: Sauver
nl: Opslaan
sv: Spara

source: Try out this and all the other features included in the full suite by activating your free 30-day trial.
fi: Testaa tätä ja muita palvelun kokoversiosta löytyviä erikoisominaisuuksia aloittamalla veloitukseton 30 päivän kokeilujaksosi.
fr: Essayez cette fonctionnalité et toutes les autres comprises dans la série complète en activant votre période d'essai gratuite de 30 jours.
nl: Probeer deze en alle andere functies die in de volledige pakket zijn inbegrepen door het activeren van uw gratis proefperiode van 30 dagen.
sv: Pröva alla funktioner genom att aktivera din 30 dagar långa gratisutvärdering.

source: Upgrade your account to Meetin.gs PRO and start using this and all the other features included in the full suite.
fi: Päivitä Meetin.gs-tilisi PRO versioon ja ala käyttämään tätä ja muita palvelusta löytyviä erikoisominaisuuksia.
fr: Passer à la version PRO de Meetin.gs et commencez à utiliser cette fonctionnalité et toutes les autres comprises dans la série complète.
nl: Upgrade uw account naar Meetin.gs PRO en begin deze en alle andere functies die in het volledige pakket zijn inbegrepen, te gebruiken.
sv: Uppgradera ditt konto till Meetin.gs PRO och börja använd alla funktioner.

source: Upgrade now
fi: Päivitä nyt
fr: Mettre à niveau maintenant
nl: Nu upgraden
sv: Uppgradera nu

source: Learn more about %(L$paid subscriptions%).
fi: Lisätietoja %(L$maksullisesta versiosta%).
fr: Apprenez-en plus sur les %(L$abonnements payants%).
nl: Leer meer over %(L$betaalde abonnementen%).
sv: Lär dig mer om %(L$betalda abonnemang%).

source: Click to change title.
fi: Muuta otsikkoa.
fr: Cliquez pour changer le titre.
nl: Klik om de titel te veranderen.
sv: Klicka för att ändra tiden.

source: Click to edit date and time.
fi: Muuta ajankohtaa.
fr: Cliquez pour modifier la date et l'heure.
nl: Klik om de datum en tijd te editeren.
sv: Klicka för att ändra datum och tid.

source: Set the date and time
fi: Aseta kokouksen ajankohta
fr: Régler la date et l'heure
nl: De datum en tijd instellen
sv: Fastställ datum och tid

source: Date and time not set.
fi: Ajankohtaa ei ole asetettu.
fr: Date et heure non réglées
nl: Datum en tijd niet ingesteld.
sv: Datum och tid har inte fastställts.

source: Click to change location.
fi: Muuta kokouspaikkaa.
fr: Cliquez pour changer le lieu.
nl: Klik om de locatie te veranderen.
sv: Klicka för att ändra plats.

source: Click to configure live communication tools.
fi: Määritä etätyökalun asetukset.
fr: Cliquez pour configurer les outils de communication en direct.
nl: Klik om nieuwe live communicatiemiddelen te configureren.
sv: Klicka för att konfigurera live-verktyg för kommunikation.

source: You
fi: Sinä
fr: Vous
nl: Jij
sv: Du

source: click to see profile
fi: Avaa profiili painamalla
fr: Cliquez pour voir le profil
nl: klik om het profiel te zien
sv: klicka för att se profil

source: Click to edit meeting.
fi: Muokkaa kokousta.
fr: Cliquez pour modifier le rendez-vous.
nl: Klik om de meeting te bewerken.
sv: Klicka för att redigera möte.

source: Click to edit theme.
fi: Muokkaa teemaa.
fr: Cliquez pour modifier le thème.
nl: Klik om het onderwerp aan te geven.
sv: Klicka för att byta tema.

source: Change date
fi: Muuta päivämäärää
fr: Changer la date
nl: Verander de datum
sv: Ändra datum

source: Set date
fi: Aseta ajankohta
fr: Fixer une date
nl: Stel datum vast
sv: Ställ in datum

source: Suggest dates
fi: Ehdota ajankohtia
fr: Proposer des dates
nl: Suggereer data
sv: Föreslå datum

source: Add to MS Outlook
fi: Lisää MS Outlook
fr: Ajouter à MS Outlook
nl: Voeg toe aan MS Outlook
sv: Lägg till MS Outlook

source: Add to Google Calendar
fi: Lisää Google kalenteriin
fr: Ajouter à Google Agenda
nl: Voeg toe aan Google kalender
sv: Lägg till i Googles kalender

source: Download ICS
fi: Lataa ICS-tiedosto
fr: Télécharger ICS
sv: Ladda ner ICS

source: Details
fi: Yksityiskohdat
fr: Détails
sv: Detaljer

source: Choose Your Timezone
fi: Valitse aikavyöhykkeesi
fr: Choisissez votre fuseau horaire
nl: Kies je tijdzone
sv: Välj din tids-zon

source: When you select a new time zone, our service converts all your meeting starting times to match your new time zone setting.
fi: Palvelumme näyttää kokousajat aina kulloinkin valitsemasi aikavyöhykkeen mukaan.
fr: Quand vous sélectionnez un nouveau fuseau horaire, notre service convertit toutes vos heures de début de rencontre pour correspondre à votre nouveau fuseau horaire.
nl: Wanneer je een nieuwe tijdzone kiest, dan past onze dienst al je begintijden voor je meetings aan aan de instelling van je nieuwe tijdzone.
sv: När du väljer en ny tids-zon konverterar vår tjänst alla dina starttider för möten till den nya tids-zonen.

source: Time Zone:
fi: Aikavyöhyke:
fr: Fuseau horaire :
nl: Tijdzone:
sv: Tids-zon:

source: Remove comment
fi: Poista kommentti
fr: Retirer le commentaire
nl: Commentaar verwijderen
sv: Ta bort kommentar

source: Edit comment
fi: Muokkaa kommenttia
fr: Modifier le commentaire
nl: Commentaar opmaken
sv: Redigera kommentar

source: Stop editing
fi: Keskeytä muokkaaminen
fr: Arrêter les modifications
nl: Stop het opmaken
sv: Sluta redigera

source: Are you sure you want to stop editing and lose your changes?
fi: Haluatko varmasti keskeyttää muokkauksen ja menettää tallentamattomat muutokset?
fr: Voulez-vous vraiment arrêter les modifications et perdre vos changements ?
nl: Bent u zeker dat u wilt stoppen met opmaken en uw wijzigingen verliezen?
sv: Är du säker på att du vill sluta redigera och förlora dina ändringar?

source: Yes
fi: Kyllä
fr: Oui
nl: Ja
sv: Ja

source: No! Continue editing
fi: Ei, haluan jatka muokkaamista
fr: Non ! Continuer les modifications
nl: Nee! Verder gaan met het opmaken
sv: Nej! Fortsätt redigera

source: Success
fi: Onnistui
fr: Succès
nl: Succes
sv: Framgång

source: A verification link has been sent to %1$s
fi: Vahvistusviesti on lähetetty sähköpostiosoitteeseen %1$s.
fr: Un lien de vérification a été envoyé à %1$s
nl: Er werd een verificatie-link gestuurd naar %1$s
sv: En verifikationslänk har skickats till %1$s

source: Something went wrong
fi: Jokin meni pieleen.
fr: Une erreur est survenue
nl: Er is iets fout gegaan
sv: Något blev fel

source: There was an error while contacting the server. Please try again!
fi: Palvelimeen yhdistäessä tapahtui virhe. Ole hyvä ja yritä uudestaan.
fr: Il y a eu une erreur lors du contact avec le serveur. Veuillez réessayer !
nl: Er was een fout bij het contacteren van de server. Gelieve opnieuw te proberen!
sv: Det uppstod ett fel när vi försökte kontakta servern. Försök igen!

source: Back to login
fi: Palaa kirjautumiseen
fr: Retour à la connexion
nl: Terug naar inloggen
sv: Tillbaka till inloggningen

source: Delete comment
fi: Poista kommentti
fr: Supprimer commentaire
nl: Commentaar verwijderen
sv: Radera kommentar

source: Are you sure you want to remove the comment?
fi: Haluatko varmasti poistaa kommentin?
fr: Voulez-vous vraiment retirer le commentaire ?
nl: Bent u zeker dat u het commentaar wilt verwijderen?
sv: Är du säker på att du vill ta bort kommentaren?

source: Remove
fi: Poista
fr: Retirer
nl: Verwijderen
sv: Ta bort

source: Edit Comment
fi: Muokkaa kommenttia
fr: Modifier le commentaire
nl: Commentaren opmaken
sv: Redigera kommentar

source: Your Information
fi: Tietosi
fr: Vos informations
nl: Uw informatie
sv: Din information

source: Please confirm your personal information before we send out invititations.
fi: Ole hyvä ja tarkista henkilökohtaiset tietosi ennen kuin lähetämme kutsut.
fr: Veuillez confirmer vos informations personnelles avant que nous n'envoyions les invitations.
nl: Gelieve uw persoonlijke informatie te bevestigen vooraleer we uitnodigingen sturen.
sv: Bekräfta din personliga information innan vi skickar ut inbjudningarna.

source: Fill profile with Facebook
fi: Täydennä profiilisi Facebookin tiedoilla
fr: Remplir le profil avec Facebook
nl: Vul profiel in met Facebook
sv: Fyll in profilen med Facebook

source: * Note: We will never post anything on your behalf to Facebook.
fi: * Huom! Emme lähetä tai jaa puolestasi mitään Facebookkiin.
fr: * Remarque : Nous ne publierons jamais rien en votre nom sur Facebook.
nl: * Nota: We zullen namens u nooit iets berichten aan Facebook.
sv: *Obs! Vi skriver aldrig något å dina vägnar på Facebook.

source: Email
fi: Sähköposti
sv: E-post

source: First name
fi: Etunimi
fr: Prénom
nl: Voornaam
sv: Förnamn

source: Last name
fi: Sukunimi
fr: Nom
nl: Achternaam
sv: Efternamn

source: Organization
fi: Organisaatio
fr: Organisation
nl: Organisatie
sv: Organisation

source: Title//context:organizational title
fi: Titteli
fr: Titre
nl: Titel
sv: Titel

source: Phone
fi: Puhelinnumero
fr: Téléphone
nl: Telefoon
sv: Telefonnummer

source: Copy and paste your LinkedIn profile link here
fi: Kopioi Linkedin-profiilisi linkki tähän
fr: Copiez-collez le lien de votre profil LinkedIn ici
nl: Kopieer en plak uw Linkedln-profiel hier
sv: Kopiera och klistra in din Linkedin-profil här

source: Logged in as: %1$s
fi: Olet kirjautunut sitään käyttäjänä: %1$s
fr: Connecté en tant que : %1$s
nl: Ingelogd als: %1$s
sv: Inloggad som: %1$s

source: Connect Your Account
fi: Yhdistä tilit
fr: Connectez votre compte
nl: Verbind uw rekening
sv: Anslut ditt konto

source: Your Facebook account is not connected to any existing Meetin.gs account. If you are already an user, please provide us with the email address that you are using with your Meetin.gs account. We will send you an email to confirm that you would like to use your Facebook to log in to Meetin.gs in the future.
fi: Facebook-tiliäsi ei ole toistaiseksi liitetty yhteenkään Meetin.gs-tiliin. Mikäli olet jo käyttäjä, anna meille sähköpostiosoite, joka on yhteydessä Meetin.gs-tiliisi. Lähetämme sinulle sähköpostivarmistuksen siitä, että haluat jatkossa käyttää Facebook-tiliäsi kirjautuessasi Meetin.gs-palveluun.
fr: Votre compte Facebook n'est connecté à aucun compte Meetin.gs existant. Si vous êtes déjà un utilisateur, merci de nous fournir l'adresse e-mail que vous utilisez pour votre compte Meetin.gs. Nous vous enverrons un e-mail pour que vous puissiez confirmer que vous souhaitez utiliser votre Facebook pour vous connecter sur Meetin.gs à l'avenir.
nl: Uw Facebook-rekening is niet verbonden met een bestaande Meetin.gs-rekening. Indien u reeds een gebruiker bent, gelieve ons het e-mailadres dat u gebruikt met uw Meetin.gs-rekening, te verstrekken. We zullen u een e-mail sturen om te bevestigen dat u uw Facebook zou willen gebruiken om in de toekomst in te loggen op Meetin.gs.
sv: Ditt Facebook-konto är inte anslutet till något Meetin.gs-konto. Om du redan är användare, ge oss den e-postadress du använder med ditt Meetin.gs-konto. Vi kommer att skicka dig ett e-postmeddelande för att bekräfta att du vill använda ditt Facebook-konto för att logga in på Meetin.gs i framtiden.

source: Send
fi: Lähetä
fr: Envoyer
nl: Versturen
sv: Sänd

source: A verification link has been sent to %1$s.
fi: Vahvistusviesti on lähetetty sähköpostiosoitteeseen %1$s.
fr: Un lien de vérification a été envoyé à %1$s.
nl: Er werd een verificatie-link opgestuurd naar %1$s.
sv: En verifikationslänk har skickats till %1$s.

source: We encountered an unknown error while contacting the server. Please try again!
fi: Palvelimeen yhdistäessä tapahtui virhe. Ole hyvä ja yritä uudestaan.
fr: Une erreur inconnue est survenue pendant le contact avec le serveur. Veuillez réessayer !
nl: We hebben een onbekende fout gevonden tijdens het contacteren van de server. Gelieve opnieuw te proberen!
sv: Ett okänt fel uppstod när vi kontaktade servern. Försök igen!

source: Meeting Skype Account
fi: Kokouksen Skype-tili
fr: Compte Skype de rendez-vous
nl: Skypenaam voor de ontmoeting
sv: Möteskonto hos Skype

source: Which Skype account will participants call?
fi: Mihin Skype-tiliin osallistujien puhelu ohjataan?
fr: Quel compte Skype les participants appelleront-ils ?
nl: Naar welke Skypenaam zullen de deelnemers bellen?
sv: Vilket Skype-konto ska deltagarna ringa till?

source: Account
fi: Tili
fr: Compte
sv: Konto

source: What teleconferencing number will participants call?
fi: Mihin numeroon puhelinkokouksen osallistujat soittavat?
fr: Quel numéro de téléconférence les participants appelleront-ils ?
nl: Naar welk teleconferentie-nummer zullen de deelnemers bellen?
sv: Vilket telekonferensnummer ska deltagarna ringa?

source: Number
fi: Numero
fr: Numéro
nl: Nummer
sv: Nummer

source: Pin (optional)
fi: Pin-koodi (valinnainen)
fr: Épingle (facultatif)
nl: Pin (optioneel)
sv: Pinkod (valfri)

source: Connect calendar
fi: Yhdistä kalenterisi
fr: Connecter le calendrier
nl: Kalender aansluiten
sv: Anslut kalender

source: It seems that your calendar has not been connected yet.
fi: Näyttää siltä, että kalenteriasi ei ole vielä yhdistetty.
fr: Il semblerait que votre agenda ne soit pas encore connecté.
nl: Het lijkt erop dat uw kalender nog niet aangesloten is.
sv: Det verkar inte som om din kalender har anslutits ännu.

source: Connect Google
fi: Yhdistä Google-tili
fr: Connecter Google
nl: Aansluiten op Google
sv: Anslut Google

source: Select a meeting
fi: Valitse tapaaminen
fr: Sélectionner une rencontre
nl: Selecteer een ontmoeting
sv: Välj ett möte

source: Choose meeting
fi: Valitse tapaaminen
fr: Choisir une rencontre
nl: Kies ontmoeting
sv: Välj möte

source: ICS Calendar Feed Instructions
fi: ICS-kalenterisyötteen ohjeet
fr: Instructions des événements du Calendrier ICS
nl: Instructies voor de ICS-kalendervoeding
sv: ICS Feed-instruktioner för kalendern

source: Copy your ICS calendar feed:
fi: Kopioi ICS-kalenterisyötte:
fr: Copier le fil d'information ICS de l'agenda :
nl: Kopieer uw ICS-kalender-voeding:
sv: Kopiera din ICS-feed för kalendern:

source: Write your comment here...
fi: Kirjoita kommenttisi tähän...
fr: Écrivez votre commentaire ici...
nl: Schrijf hier uw commentaar...
sv: Skriv din kommentar här...

source: Add comment
fi: Lisää kommentti
fr: Ajouter un commentaire
nl: Commentaar Toevoegen
sv: Lägg till kommentar

source: Click to rename.
fi: Paina nimetäksesi uudelleen.
fr: Cliquez pour renommer
nl: Klik om nieuwe naam te geven
sv: Klicka för att döpa om.

source: Download
fi: Lataa
fr: Télécharger
sv: Ladda ner

source: Edit
fi: Muokkaa
fr: Éditer
nl: Bewerken
sv: Redigera

source: This document is locked by you
fi: Tämä dokumentti on lukittu sinun toimesta
fr: Ce document a été verrouillé par vous
nl: Dit document is door u vergrendeld
sv: Detta dokument är låst av dig

source: Your previous session with this page was left open. To continue editing, click the link below.
fi: Edellinen istuntosi sivulla on jäänyt avoimeksi. Paina alapuoleista linkkiä jatkaaksesi.
fr: Votre session précédente sur cette page est restée ouverte. Pour continuer les modifications, cliquez sur le lien ci-dessous.
nl: Uw vorige sessie met deze pagina is open gelaten. Om door te gaan met bewerken, klik op onderstaande link.
sv: Din förra session på denna sida lämnades öppen. För att fortsätta redigera, klicka på länken nedan.

source: Continue editing
fi: Jatka muokkaamista
fr: Continuer modifications
nl: Ga verder met editen
sv: Fortsätt redigera

source: This document is locked by user:
fi: Dokumentti on lukittu, koska sitä muokkaa käyttäjä:
fr: Ce document a été verrouillé par l'utilisateur :
nl: Dit document is vergrendeld door gebruiker:
sv: Detta dokument är låst av användare:

source: You can edit the document once the user has finished editing the page.
fi: Pääset muokkaamaan dokumenttia kun toinen käyttäjä on lopettanut muokkaamisen ja sulkenut sen.
fr: Vous pourrez modifier le document une fois que l'utilisateur aura fini de modifier la page.
nl: U kunt het document bewerken zodra de gebruiker klaar is met het bewerken van de pagina.
sv: Du kan redigera dokumentet när användaren har avslutat redigeringen av sidan.

source: Click "Edit" button above to start editing.
fi: Klikkaa yläpuolella olevaa "Muokkaa"-painiketta tehdäksesi muutoksia.
fr: Cliquez sur le bouton « Modifier » ci-dessus pour commencer les modifications.
nl: Klik "Bewerken" hierboven om te beginnen met bewerken.
sv: Klicka på knappen "Redigera" ovan för att börja redigera.

source: %(S$READ the following instructions carefully.%) These instructions will be replaced when you fill the document. The other party will receive anything you write here as part of the invitation when you click "Ready".
fi: %(S$LUE seuraavat ohjeet huolellisesti:.%) Nämä ohjeet korvaantuvat täytäessäsi lomakkeen. Toinen osapuoli vastaanottaa kutsun ohessa tähän kirjoittamasi viestin painaessasi "Valmis"-painiketta.
fr: %(S$LISEZ les instructions suivantes attentivement.%) Ces instructions seront remplacées quand vous remplirez le document. L'autre partie recevra tout ce que vous écrirez ici comme élément de l'invitation quand vous cliquerez sur « Prêt ».
nl: %(S$LEES zorgvuldig de volgende instructies.%) Deze instructies worden verplaatst als u het document invult. De andere partij zal alles wat u hier schrijft ontvangen als onderdeel van de uitnodiging als u op "Klaar" klikt.
sv: %(S$LÄS följande instruktioner noga.%) Dessa instruktioner kommer att tas bort när du fyller i dokumentet. De andra kommer att få det du skriver här, som del av inbjudan när du klickar på "Klar".

source: When filling the agenda, consider the following:
fi: Täyttäessäsi agendaa, harkitse seuraavia asioita:
fr: Quand vous arrangez l'agenda, pensez à ceci :
nl: Neem bij het invullen van de agenda het volgende in overweging:
sv: När du fyller i agendan, tänk på följande:

source: Did the other party propose a preliminary agenda below? Take into account their wishes.
fi: Ehdottiko toinen osapuoli alustavaa agendaa? Tarkista heidän ehdotuksensa alapuolelta ja huomioi se mahdollisuuksien mukaan.
fr: L'autre partie a-t-elle proposé un agenda préliminaire ci-dessous ? Prenez en compte leurs souhaits.
nl: Heeft de andere partij hieronder een voorlopige agenda voorgesteld? Houd rekening met hun wensen.
sv: Föreslog de andra en preliminär agenda nedan? Ta hänsyn till deras önskemål.

source: What is your company all about and what stage are you in?
fi: Mistä yrityksessäsi on kyse ja missä vaiheessa olet?
fr: Quelle est l'activité de votre société et à quel stade en êtes-vous ?
nl: Wat doet uw bedrijf allemaal en in welke fase zit het?
sv: Vad handlar ditt företag om och vilket stadium befinner ni er i?

source: What are you expecting from the other party?
fi: Mitä odotat toiselta osapuolelta?
fr: Qu'attendez-vous de l'autre partie ?
nl: Wat verwacht u van de andere partij?
sv: Vad förväntar du dig av de andra?
