Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_back-*.po
Languages: fi, fr, nl, sv

source: * By proceeding you accept the %(L$Terms of Service%) and you allow %1$s to access your Meetin.gs data
fi: * Jatkamalla hyväksyt %(L$käyttöehtomme%) ja palvelulle %1$s luvan päästä käsiksi Meetin.gs-palvelussa oleviin tietoihisi.
fr: * En continuant, vous acceptez les %(L$Termes du Service%) et vous permettez à %1$s d'accéder à vos données Meetin.gs
nl: * Wanneer je doorgaat accepteer je de %(L$gebruiksvoorwaarden%) en geef je %1$s toegang tot je Meetin.gs informatie
sv: * Genom att fortätta accepterar du %(L$användarvillkoren%) och du tillåter %1$s att fil tillgång till din Meetin.gs-data

source: * By proceeding you accept the %(L$Terms of Service%)
fi: * Jatkamalla hyväksyt palvelumme %(L$käyttöehdot%)
fr: * En continuant vous acceptez les %(L$conditions d'utilisation%)
nl: * Door door te gaan accepteert u de %(L$Voorwaarden%)
sv: * Genom att fortsätta accepterar du %(L$Användarvillkor%)

source: This meeting is secure. We have sent you an email with a secure login link.
fi: Tämä on suojattu tapaaminen. Olemme lähettäneet sinulle sähköpostin jonka kautta voit kirjautua suojatusti.
fr: La réunion est sûre. Nous vous avons envoyé un email avec le lien de connexion sûre.
nl: Deze meeting is afgeschermd. We hebben je een e-mail met een veilige inloglink gestuurd.
sv: Det här mötet är säkert. Vi har skickat dig ett mejl med en säker inloggningslänk.

source: Upcoming
fi: Tulevat
fr: Prochainement
nl: Toekomstig
sv: Kommande

source: Past
fi: Menneet
fr: Ancien
nl: Vorige
sv: Dåtid

source: Add to calendar
fi: Lisää kalenteriin
fr: Ajouter au calendrier
nl: Voeg toe aan de agenda.
sv: Lägg till i kalender

source: Thanks! Now check your inbox.
fi: Kiitos! Tarkista nyt sähköpostisi.
fr: Merci ! Vérifiez à présent votre boite de réception.
nl: Bedankt! Check nu je inbox.
sv: Tack! Kolla din inkorg nu

source: You can send the invites after clicking the link we sent you.
fi: Voit lähettää kutsut painettuasi saamastasi sähköpostista löytyvää nappia.
fr: Vous pourrez envoyer les invitations après avoir cliqué sur le lien que nous vous avons envoyé.
nl: Je kunt uitnodigingen sturen nadat je op de link geklikt hebt die we je gestuurd hebben.
sv: Du kan skicka inbjudningarna efter du klickat på länken vi skickade dig.

source: For feedback, please head over to our %(L$support forums%).
fi: Anna meille palautettta %(L$tukifoorumimme%) kautta.
fr: Pour communiquer vos impressions, veuillez vous rendre sur nos %(L$forums d'aide%).
nl: Ga voor feedback naar onze %(L$support forums%).
sv: För feedback, vänligen gå till våra %(L$supportforum%).

source: Please check your email to continue
fi: Tarkista sähköpostisi jatkaaksesi
fr: Veuillez vérifier votre email pour continuer
nl: Controleer je e-mail voordat je doorgaat
sv: Vänligen kolla din mejl för att fortsätta

source: We just sent you an email to %(B$%1$s%) from %(B$info@meetin.gs%). Click the link in the email to confirm your account.
fi: Lähetimme sinulle sähköpostin osoitteeseen %(B$%1$s%) osoitteestamme %(B$info@meetin.gs%). Vahvista rekisteröintisi klikkaamalla viestissä olevaa linkkiä.
fr: Nous vous avons envoyé un email à %(B$%1$s%) de %(B$info@meetin.gs%). Cliquez sur le lien contenu dans l'email pour confirmer votre compte.
nl: We hebben zojuist een e-mail gestuurd van %(B$info@meetin.gs%) naar %(B$%1$s%). Klik op de link in de e-mail om je account te bevestigen.
sv: Vi har precis skickat dig ett mejl till %(B$%1$s%) från %(B$info@meetin.gs%). Klicka på länken i mejlet för att bekräfta ditt konto.

source: We just sent you an email to %(B$%1$s%) from %(B$info@meetin.gs%). You can send the invites after clicking the link in the email. We'll also add the meeting to your account.
fi: Lähetimme sähköpostin osoitteeseen %(B$%1$s%) osoitteesta %(B$info@meetin.gs%). pääset lähettämään kutsut painettuasi viestissämme olevaa linkkiä. Lisäämme myös tähän kokoukseen liittyvän sivun tilillesi.
fr: Nous vous avons envoyé un e-mail sur %(B$%1$s%) de %(B$info@meetin.gs%). Vous pourrez envoyer les invitations après avoir cliqué sur le lien contenu dans cet e-mail. Nous allons également ajouter l réunion à votre compte.
nl: We hebben je zojuist een e-mail gestuurd van %(B$info@meetin.gs%) naar %(B$%1$s%). Je kunt uitnodigingen sturen nadat je op de link in de e-mail geklikt hebt. We voegen ook de meeting toe aan je account.
sv: Vi har skickat ett mejl till %(B$%1$s%) från %(B$info@meetin.gs%). Du kan sända ut inbjudningar efter att du klickat på länken i mejlet. Vi lägger också till mötet till ditt konto.

source: We just sent you an email to %(B$%1$s%) from %(B$info@meetin.gs%). You can send the invites after clicking the link we just sent you.
fi: Lähetimme sähköpostin osoitteeseen %(B$%1$s%) osoitteesta %(B$info@meetin.gs%). pääset lähettämään kutsut painettuasi viestissämme olevaa linkkiä.
fr: Nous vous avons envoyé un email à %(B$%1$s%) de %(B$info@meetin.gs%). Vous pourrez envoyer les invitations après avoir cliqué sur le lien que nous vous avons envoyé.
nl: We hebben je net een e-mail gestuurd van %(B$info@meetin.gs%) naar %(B$%1$s%). Je kunt de uitnodigingen versturen nadat je op de link geklikt hebt die we je zojuist gestuurd hebben.
sv: Vi skickade dig precis ett mejl till %(B$%1$s%) från %(B$info@meetin.gs%). Du kan skicka inbjudningarna efter att du klickar på länken vi precis skickade till dig.

source: If you cannot find the email, please check your spam folder and add %(B$info@meetin.gs%) to your address book to ensure safe delivery of email from us in the future.
fi: Tarkista roskapostisi, mikäli et löydä sähköpostia. Lisää myös %(B$info@meetin.gs%) osoitekirjaasi varmistaaksesi sähköpostien saapumisen tulevaisuudessa.
fr: Si vous ne trouvez pas l'email, veuillez vérifier votre dossier courrier indésirable et ajouter % (B$info@meetin.gs%) à votre liste de contacts pour vous assurer que nos emails vous parviendront bien désormais.
nl: Als je de e-mail niet kunt vinden, kijk dan in je spam map en voeg %(B$info@meetin.gs%) aan je adresboek zodat je zeker weet dat onze e-mails in het vervolg goed bij je aankomen.
sv: Om du inte hittar mejlet, vänligen kontrollera din spam-mapp och lägg till %(B$info@meetin.gs%) i din adressbok för säker leverans av e-post från oss i framtiden.

source: For more information see how to %(L$whitelist us%).
fi: Saadaksesi lisätietoja katso ohjeet kuinka lisätä meidät %(L$whitelistille%).
fr: Pour plus d'informations voir comment %(L$nous mettre sur liste blanche%).
nl: Voor meer informatie, zie hoe je ons %(L$aan je veilige lijst toevoegt%).
sv: För mer information om hur du %(L$vitlistar oss%).

source: Welcome!
fi: Tervetuloa!
fr: Bienvenue !
nl: Welkom!
sv: Välkommen!

source: Thanks for taking the time to sign up, we really appreciate it.
fi: Kiitos rekisteröitymisestäsi.
fr: Merci d'avoir pris le temps de vous inscrire.
nl: Bedankt dat je de tijd genomen hebt je te registreren, we stellen het op prijs!
sv: Tack för att du tog dig tiden att registrera dig. Det uppskattar vi verkligen.

source: Continue to Meetin.gs
fi: Jatka Meetin.gs-palveluun
fr: Continuer vers Meetin.gs
nl: Ga door naar Meetin.gs
sv: Fortsätta till Meetin.gs

source: We have tried to make Meetin.gs as easy to use as possible. In case you have trouble getting started, here's a short %(L$guide%) to help you out.
fi: Olemme pyrkineet tekemään palvelustamme mahdollisimman helppokäyttöisen. Mikäli tarvitset apua käytön aloitukseen, tässä on lyhyt %(L$guide(eng)%) avuksesi
fr: Nous avons rendu l'utilisation de Meetin.gs aussi simple que possible. Si vous avez des difficultés pour démarrer l'utilisation, voici un bref %(L$guide%) pour vous aider.
nl: We hebben geprobeerd Meetin.gs zo makkelijk mogelijk in het gebruik te maken. Mocht je problemen hebben met het opzetten van je account is hier een korte %(L$gids%) om je te helpen.
sv: Vi har försökt göra Meetin.gs så lättanvänt som möjligt. Har du svårt att sätta igång, kan du läsa den korta %(L$guiden%) och få hjälp.

source: If there is anything else I can help you with, please give me or my team a shout.
fi: Ota rohkeasti yhteyttä, mikäli voimme auttaa millään tavoin.
fr: S'il y a autre chose que je peux faire pour vous aider, veuillez me contacter ou contacter mon équipe.
nl: Als er iets is waarmee ik je kan helpen, laat het dan aan mij of mijn team weten.
sv: Om det är nåt som jag kan hjälpa dig är det bara att kontakta mig eller mitt team.

source: Best regards,
fi: Parhain terveisin,
fr: Cordialement,
nl: Met vriendelijke groeten,
sv: Med vänliga hälsningar,

source: This is an automated message from
fi: Tämä on automaattinen viesti palvelusta
fr: Ceci est un message automatique provenant de
nl: Dit is een automatisch bericht van
sv: Det här är ett automatiskt meddelande från

source: Support
fi: Tuki
fr: Assistance
nl: Ondersteuning

source: Privacy Policy
fi: Yksityisyyden suojan ehdot
fr: Politique de confidentialité
nl: Privacybeleid
sv: Integritetspolicy.

source: Unsubscribe from this meeting
fi: Estä tähän tapaamiseen liittyvät viestit
fr: Désabonnez-moi de cette réunion
nl: Meld je af voor deze meeting
sv: Avregistrera dig från detta möte

source: Whitelist Us
fi: Lisää luotetuksi sähköpostiksi
fr: Nous Mettre Sur Liste Blanche
nl: Zet ons op de witte lijst.
sv: Vitlista oss

source: Don't send me promotional mail
fi: Älkää lähettäkö minulle markkinointiviestejä
fr: Ne m'envoyez pas d'e-mail promotionnel
nl: Stuur mij geen promotieberichten
sv: Skicka inte reklammejl till mig

source: This is an automated message from Meetin.gs.
fi: Tämä on automaattinen viesti Meetin.gsistä
fr: Ceci est un message automatique provenant de Meetin.gs.
nl: Dit is een automatisch bericht van Meetin.gs.
sv: Det här är ett automatiserat meddelande från Meetin.gs.

source: Support:
fi: Tuki:
fr: Assistance :
nl: Ondersteuning:

source: Privacy Policy:
fi: Yksityisyyden suojan ehdot:
fr: Politique de confidentialité
nl: Privacybeleid:
sv: Integritetspolicy:

source: Welcome to Meetin.gs
fi: Tervetuloa Meetin.gs-palveluun
fr: Bienvenue sur Meetin.gs
nl: Welkom bij Meetin.gs
sv: Välkommen till Meetin.gs

source: Your %1$s PRO was activated
fi: %1$s PRO aktivoitu
fr: Votre %1$s PRO a été activé
nl: Uw %1$s PRO is geactiveerd
sv: Din %1$s PRO aktiverades

source: Thank you for signing up
fi: Kiitos rekisteröitymisestä
fr: Merci de votre inscription
nl: Bedankt voor het aanmelden
sv: Tack för din registrering

source: Thank you for upgrading %1$s
fi: Kiitos kun päivitit %1$s tilisi
fr: Merci d'avoir mis %1$s à niveau
nl: Dank u voor het upgraden van %1$s
sv: Tack för att du uppgraderar %1$s

source: http://support.meetin.gs/
fi: http://support.meetin.gs/fi
fr: http://support.meetin.gs/fr

source: Welcome to %1$s. We are really happy to have you.
fi: Tervetuloa %1$s käyttäjäksi.
fr: Bienvenue sur %1$s. Nous sommes vraiment heureux de vous avoir.
nl: Welkom bij %1$s. We zijn erg blij u erbij te hebben.
sv: Välkommen till %1$s. Vi är verkligen glada att ha dig.

source: Your PRO account was activated by %1$s and you can now start organizing meetings with the full suite. If you have any questions about the service, please don't hesitate to contact our %(L$support%).
fi: %1$s on päivittänyt tilisi on PRO versioon. Nyt voit ryhtyä järjestämään kokouksia käyttäen palvelun kaikkia ominaisuuksia. Mikäli sinulla on kysyttävää palvelusta, älä epäröi otta yhteyttä %(L$tukeemme%).
fr: Votre compte PRO a été activé par %1$s et vous pouvez maintenant commencer à organiser des réunions avec la suite complète. Si vous avez des questions sur le service, n'hésitez pas à contacter notre %(L$support%).
nl: Uw Pro acccount is geactiveerd met %1$s en u kunt beginnen met het organiseren van uw vergaderingen in full suite. Heeft u vragen over de service, aarzel dan niet contact met onze %(L$support%) op te nemen.
sv: Ditt PRO-konto aktiverades av %1$s och du kan nu börja organisera möten med den fullständiga uppsättningen. Om du har frågor och tjänsten, tveka inte att kontakta vår %(L$support%).

source: Your account is upgraded to PRO and you can now start organizing meetings with the full suite. If you have any questions about the service, please don't hesitate to contact our %(L$support%).
fi: Tilisi on päivitetty PRO versioon. Nyt voit ryhtyä järjestämään kokouksia käyttäen palvelun kaikkia ominaisuuksia. Mikäli sinulla on kysyttävää palvelusta, älä epäröi otta yhteyttä %(L$tukeemme%).
fr: Votre compte passe à PRO et vous pouvez maintenant commencer à organiser des réunions avec toutes les options disponibles. Si vous avez des questions sur le service, n'hésitez pas à contacter notre %(L$assistance%).
nl: Uw account heeft een upgrade naar PRO en u kunt nu beginnen met het organiseren van ontmoetingen met het volledige pakket. Als u vragen heeft over de service, aarzel dan niet ons te contacteren %(L$ondersteuning%).
sv: Ditt konto är uppgraderat till PRO och du kan nu börja organisera möten med alla funktioner. Om du har några frågor om tjänsten, tveka inte att kontakta vår %(L$support%).

source: Here's your login link to %1$s. Keep in mind, that this link is personal. You can use it whenever you need to login. If you lose the link, you can always get a new one from our site
fi: Tässä on kirjautumislinkkisi %1$s-palveluun. Huomioi, että tämä linkki on henkilökohtainen. Pidä huolta ettei se joudu muiden haltuun. Mikäli hukkaat kirjautumislinkin, voit aina pyytää uuden verkkosivuiltamme.
fr: Voici votre identifiant sur %1$s. N'oubliez pas que ce lien est personnel. Vous pouvez l'utiliser dès que vous devez vous connecter. Si vous perdez le lien, vous pouvez toujours en obtenir un autre depuis notre site
nl: Hier is uw login-link voor %1$s. Hou er rekening mee dat deze link persoonlijk is. U kunt het gebruiken wanneer u het nodig heeft om in te loggen. Als u de link verliest, kunt u altijd een nieuwe krijgen via onze
sv: Här är din inloggningslänk till %1$s. Kom ihåg att att den är personlig. Du kan använda den när du loggar in. Om du tappar bort länken kan du alltid få en ny från vår hemsida.

source: Be sure to explore and benefit from all the PRO features:
fi: Varmista, että saat kaiken hyödyn irti palvelumme ominaisuuksista:
fr: Assurez-vous d'essayer et de bénéficier de toutes les caractéristiques PRO :
nl: Zorg ervoor om alle PRO-functies te verkennen en ervan te profiteren:
sv: Upptäck och ta fördel av alla PRO-funktioner:

source: Unlimited schedulers on the Meet Me page
fi: Rajoittamaton määrä tapaamiskalentereita Meet Me sivullasi
fr: Planificateurs illimités sur la page Rencontrez-Moi
nl: Onbeperkte agenda´s op de Meet Me-pagina
sv: Obegränsade schemaläggningar på Meet Me-sidan

source: Claim your Meet Me page and set up as many schedulers as you wish. Different kind of schedulers serve different kind of needs.
fi: Varaa Meet Me sivusi ja luo rajaton määrä tapaamiskalentereita. Erilaiset tapaamiskalenterit palvelevat eri tarkoitusperiä. Luo omat kalenterit esimerkiksi lounastapaamisille, puhelinsoitoille tai myyntipalavereille.
fr: Demandez votre page Meet Me et configurez autant de feuilles de route que vous le souhaitez. Il y a différents types de feuilles de route adaptées à toutes sortes de besoins.
nl: Vraag uw Meet Me-pagina en stel zoveel agenda´s op als u wilt. Verschillende soorten agenda´s dienen voor verschillende soorten behoeften.
sv: Hävda din Meet Me-sida och ställ in så många schemaläggare du vill. Olika sorters schemaläggare är till för olika sorters behov.

source: Expanded Live Communication Tools
fi: Laajennettu valikoima etätyökaluja
fr: Outils Élargis de Communication en Direct
nl: Uitgebreide live-communicatie-instrumenten
sv: Utökade kommunikationsverktyg

source: Use all the expanded Live Communication Tools such as Lync, Google Hangouts, or a custom tool of your own choice.
fi: Hyödynnä koko integroitua etätyökaluvalikoimaamme kuten Lynciä, Google Hangoutsia, Skypeä tai itse valitsemaasi työkalua.
fr: Utilisez tous les Outils de Communication Live comme Lync, Google Hangouts, ou un outil de votre propre choix.
nl: Gebruik alle uitgebreide live-communicatie-instrumenten, zoals Lync, Google Hangouts of een aangepast instrument van eigen keuze.
sv: Använd alla de utökade kommunikationsverktygen som Lync, Google Hangouts eller ett eget verktyg av ditt tycke.

source: Visual customization and branding
fi: Kokousten ulkoasun muokkaus ja brändäys
fr: Personnalisation et stratégie de marque
nl: Visuele aanpassing en branding
sv: Visuell anpassning och branding

source: Remember to customize the look according to your brand. Add your logo, select your own background image, and set the highlight color.
fi: Muista muokata palvelun ulkoasua ja brändätä kokouksesi yrityskuvasi mukaiseksi. Lisää logosi, aseta kokouksillesi haluamasi taustakuva ja valitse palvelun korostevärit.
fr: N'oubliez pas de personnaliser l'apparence selon votre marque. Ajoutez votre logo, sélectionnez vos propres images de fond, et déterminez les couleurs.
nl: Hou er rekening mee om het uitzicht volgens uw merk, aan te passen. Voeg uw logo toe, selecteer uw achtergrondafbeelding en stel uw steunkleur in.
sv: Kom ihåg att anpassa utseendet i enlighet med ditt märke. Lägg till din logga, välj din egen bakgrundsbild och ställ in markeringsfärgen.

source: Unlimited meeting participants
fi: Rajoittamaton osallistujamäärä
fr: Nombre illimité de participants
nl: Onbeperkte ontmoetingsdeelnemers
sv: Obegränsad mötesdeltagare

source: You can now invite as many people to a single meeting as you wish.
fi: Voit nyt kutsua koolle juuri niin suuria kokouksia kuin haluat.
fr: Vous pouvez maintenant inviter autant de personnes que vous le souhaitez à une seule réunion.
nl: U kunt nu zoveel personen als u wilt, uitnodigen op een enkele ontmoeting.
sv: Du kan nu bjuda in så många människor du vill till ett möte.

source: Unlimited meeting materials
fi: Rajoittamattomat kokousmateriaalit
fr: Nombre illimité de données
nl: Onbeperkte ontmoetingsmaterialen
sv: Obegränsade mötesmaterial

source: You are now able to share all the materials without limitations.
fi: Jaa kokousmateriaalit ilman tiedostojen kokorajoituksia.
fr: Vous pouvez maintenant partager toutes les données sans aucune limitation.
nl: U kunt nu alle materialen zonder beperkingen delen.
sv: Du kan nu dela allt material utan begränsningar.

source: Meetings on the move
fi: Tapaamiset aina mukanasi
fr: Des réunions en mouvement
nl: Meetings onderweg
sv: Möten på rörlig fot

source: Download the free mobile app and receive meeting details and updates straight to your mobile phone:
fi: Asenna ilmainen mobiilisovellus, niin saat jatkossa tapaamisen tiedot ja päivitykset suoraan kännykkääsi:
fr: Téléchargez notre application mobile gratuite pour recevoir les détails et les mises à jour des réunions directement sur votre téléphone :
nl: Download de gratis mobiele app en ontvang details en updates over vergaderingen direct op uw mobiel
sv: Ladda ner vår gratis mobilapp och få mötesdetaljer och uppdateringar direkt till din mobiltelefon:

source: Download SwipeToMeet app by Meetin.gs to receive meeting details and updates straight to your mobile device:
fi: Asenna ilmainen SwipeToMeet by Meetin.gs mobiilisovellus, niin saat jatkossa tapaamisen tiedot ja päivitykset suoraan kännykkääsi:
fr: Téléchargez notre application mobile SwipeToMeet by Meetin.gs pour recevoir les détails et les mises à jour des réunions directement sur votre téléphone :
nl: Download de gratis mobiele app SwipeToMeet by Meetin.gs en ontvang details en updates over vergaderingen direct op uw mobiel
sv: Ladda ner vår gratis mobilapp SwipeToMeet by Meetin.gs och få mötesdetaljer och uppdateringar direkt till din mobiltelefon:

source: Meetings on the move for iPhone and android:
fi: Tapaamiset mobiilisti iPhonelle ja Androidille:
fr: Des réunions mobiles pour iPhone et android :
nl: Meetings onderweg voor iPhone en android:
sv: Möten på rörlig fot för iPhone och Android:

source: Dear %1$s,
fi: Hei %1$s,
fr: Cher %1$s,
nl: Beste %1$s,
sv: Bästa %1$s,

source: Welcome to %1$s PRO
fi: Tervetuloa %1$s PRO-käyttäjäksi
fr: Bienvenue sur %1$s PRO
nl: Welkom bij %1$s PRO
sv: Välkommen till %1$s PRO

source: Welcome and thank you for upgrading to %1$s PRO
fi: Tervetuloa ja kiitos kun ryhdyit %1$s PRO käyttäjäksi
fr: Bienvenue et merci d'être passé à %1$s PRO
nl: Welkom en dank u voor de upgrade naar %1$s PRO
sv: Välkommen och tack för att du har uppgraderat till %1$s PRO

source: Thank you for upgrading to %1$s PRO
fi: Kiitos kun ryhdyit %1$s PRO käyttäjäksi
fr: Merci d'être passé à %1$s PRO
nl: Dank u voor de upgrade naar %1$s PRO
sv: Tack för att du uppgraderade till %1$s PRO

source: Hello!
fi: Hei!
fr: Bonjour !
nl: Hallo!
sv: Hej!

source: Do you wish to authorize %1$s to directly log you in to Meetin.gs?
fi: %1$s pyytää lupaa käyttää kirjautumistietojasi. Haluatko antaa tälle kolmannen osapuolen palvelulle pääsyn tietoihisi?
fr: Souhaitez-vous autoriser %1$s à vous connecter directement sur Meetin.gs ?
nl: Wil je %1$s toestaan om je direct in te loggen op Meetin.gs?
sv: Vill du auktorisera %1$s för direktinloggning på Meetin.gs?

source: Authorize and log in
fi: Anna lupa ja kirjaudu sisään
fr: Autoriser et se connecter
nl: Sta toe en log in
sv: Auktorisera och logga in

source: Authorization allows %1$s to log you in according to their privacy policy.
fi: Luvan saatuaan %1$s voi kirjata sinut automaattisesti palveluumme.
fr: L'autorisation permet à %1$s de vous connecter selon leur politique de confidentialité.
nl: Autorisatie laat %1$s toe om u in te loggen, overeenkomstig met hun privacybeleid.
sv: Tilldelad behörighet gör det möjligt för %1$s att logga in dig i enlighet med deras sekretesspolicy.

source: You can also skip this authorization and %(L$log in directly%)
fi: Voit myös jättää luvan antamatta ja %(L$kirjautua sisään tästä%)
fr: Vous pouvez également ignorer cette autorisation et %(L$vous connecter directement%)
nl: U kan deze toestemming ook overslaan en %(L$rechtstreeks inloggen%)
sv: Du kan också hoppa över den här auktoriseringen och %(L$logga in direkt%)

source: Confirm %1$s authorization
fi: Anna palvelulle %1$s lupa kirjata sinut sisään
fr: Confirmer autorisation %1$s
nl: Bevestig toestemming voor %1$s
sv: Bekräfta %1$s auktorisering

source: Hello %1$s,
fi: Hei %1$s,
fr: Bonjour %1$s,
nl: Hallo %1$s,
sv: Hej %1$s,

source: Thank you for signing up for Meetin.gs.
fi: Kiitos rekisteröitymisestä Meetin.gs-palveluun.
fr: Merci pour votre inscription à Meetin.gs.
nl: Bedankt voor het aanmelden bij Meetin.gs.
sv: Tack för att du registrerar dig på Meetin.gs.

source: Action required: click the following link to complete the registration process:
fi: Toimintaa odotetaan: Viimeistele kirjautuminen oheisesta linkistä:
fr: Une action est requise : cliquez sur le lien suivant afin de compléter la procédure d'inscription :
nl: Actie vereist: klik op de volgende link om het registratieproces te voltooien:
sv: Nödvändig åtgärd: Klicka på följande länk för att slutföra registreringen:

source: Complete registration process
fi: Vahvista rekisteröinti
fr: Complétez la procédure d'inscription
nl: Voltooi nu het registratieproces
sv: Avsluta registreringsprocessen

source: Remember to add info@meetin.gs to your address book to ensure safe delivery of email in the future.
fi: Muista lisätä info@meetin.gs osoitekirjaasi varmistaaksesi sähköpostiviestien pääsyn perille.
fr: Pensez à ajouter info@meetin.gs à votre carnet d'adresses afin qu'à l'avenir, les e-mails vous parviennent en toute sécurité.
nl: Vergeet niet info@meetin.gs aan je adresboek toe te voegen zodat e-mails in het vervolg goed bij je bezorgd worden.
sv: Kom ihåg att lägga till info@meetin.gs till din adressbok för att garantera att mejlen levereras i framtiden.
