Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_front-*.po
Languages: fi, fr, nl, sv

source: Removing your account will delete all your personal information from the service, remove your Meet Me page, unsubscribe you from our mailing lists, and anonymise stored data like comments, meetings, and materials.
fi: Poistaessasi tilin, hävitämme henkilötietosi, tuhoamme Meet Me sivusi, poistamme sinut sähköpostilistoiltamme ja anonymisoimme palveluun syötetyt tiedot kuten kommentit, kokoukset ja materiaalit.
fr: Supprimer votre compte effacera toutes vos informations personnelles du service, supprimera votre page Rencontrez-moi, vous désabonnera de nos listes de diffusion et anonymisera les données stockées comme les commentaires, les réunions et les documents.
nl: Het verwijderen van uw account zal al uw persoonlijke gegevens verwijderen uit de service, het zal uw Meet Me-pagina verwijderen, het zal u verwijderen uit onze mailinglijsten en het zal opgeslagen gegevens anonimiseren, zoals commentaren, vergaderingen en materialen.
sv: Borttagningen av ditt konto innebär att alla dina uppgifter och din Meet Me-sida tas bort, du avprenumerar dig från vår mejllista och sparad data såsom kommentarer, möten och material avidentifieras.

source: Note: Others will still be able to invite you as a new participant to a meeting using the same email address.
fi: Huomaa, että sinut voidaan edelleen kutsua kokoukseen uutena osallistujana käyttäen palveluamme.
fr: Remarque : Les autres pourront toujours vous inviter en tant que nouveau participant à une réunion en utilisant la même adresse e-mail.
nl: Nota: anderen zullen u nog steeds kunnen uitnodigen als een nieuwe deelnemer aan een ontmoeting door gebruik te maken van hetzelfde e-mailadres.
sv: Notera: Andra kommer fortfarande att kunna bjuda in dig som en ny deltagare till ett möte med samma e-postadress.

source: Get receipts
fi: Hanki kuitit
fr: Obtenir des reçus
nl: Ontvangstbewijzen ontvangen
sv: Få kvitton

source: Below you see all your transactions. You can get the receipt via email.
fi: Alla näet maksuliikennehistoriasi. Kuitit voit saada sähköpostitse.
fr: Ci-dessous sont affichées toutes vos transactions. Vous pouvez recevoir le reçu par e-mail.
nl: Hieronder ziet u al uw transacties. U kunt het ontvangstbewijs ontvangen via e-mail.
sv: Nedan kan du se alla dina transaktioner. Du kan få kvittot via e-post.

source: Send receipt
fi: Lähetä kuitti
fr: Envoyer un reçu
nl: Ontvangstbewijs opsturen
sv: Skicka kvitto

source: Are you sure you want to remove account with email %1$s. There is no undo.
fi: Oletko varma, että haluat poistaa tilin, joka on liitetty sähköpostiin %1$s? Tilin poistoa ei voi peruuttaa.
fr: Êtes-vous sûr de vouloir supprimer le compte avec l'e-mail %1$s. Il est impossible d'annuler.
nl: Bent u zeker dat u de account wilt verwijderen met de e-mail %1$s. Er is geen weg terug.
sv: Är du säker på att du vill ta bort kontot med mejladressen %1$s. Det finns ingen återvändo.

source: Calendar integration
fi: Kalenteri-integraatio
fr: Intégration du calendrier
nl: Kalenderintegratie
sv: Kalenderintegrering

source: Connect your calendars to see your upcoming events on the Meeting Timeline and show your availability on the Meet Me page.
fi: Yhdistä kalenterisi nähdäksesi tulevat tapahtumat aikajanallasi ja määrittääksesi automaattisesti tavoitettavuutesi Meet Me sivusi tapaamiskalenteria varten.
fr: Connectez vos calendriers pour voir vos événements à venir sur la Chronologie de réunions et afficher votre disponibilité sur la page Rencontrez-moi.
nl: Verbind uw kalenders om uw komende evenementen te zien op de Meeting tijdlijn en toon uw beschikbaarheid op de Meet Me-pagina.
sv: Anslut dina kalendrar för att se kommande händelser på Mötestidslinjen och visa din tillgänglighet på Meet Me-sidan.

source: Manage accounts
fi: Hallinnoi tilejäsi
fr: Gérer les comptes
nl: Accounts beheren
sv: Hantera konton

source: Connect and disconnect third-party accounts.
fi: Yhdistä tai pura yhteys kolmannen osapuolen palveluihin.
fr: Connecter et déconnecter les comptes tiers.
nl: Accounts van derden verbinden en ontkoppelen.
sv: Anslut och koppla ifrån tredjepartskonton.

source: Connect with Google
fi: Yhdistä Google-tili
fr: Se connecter avec Google
nl: Verbinden met Google
sv: Anslut med Google

source: Your account is connected to Google
fi: Tilisi on yhdistetty Googleen
fr: Votre compte est connecté à Google
nl: Je account is verbonden met Google
sv: Ditt konto är kopplat till Google

source: Disconnect
fi: Pura yhteys
fr: Se déconnecter
nl: Verbreek verbinding
sv: Koppla ifrån

source: Manage connected devices
fi: Hallinnoi yhdistettyjä laitteita
fr: Gérer les appareils connectés
nl: Beheer aangesloten apparaten
sv: Hantera anslutna enheter

source: This is a list of your devices connected with the service.
fi: Tässä listassa näet palveluun yhdistämäsi laitteet.
fr: Voici une liste de vos appareils connectés au service.
nl: Dit is een lijst van uw apparaten die verbonden zijn met de service.
sv: Det här är en lista över alla enheter som är ansluta till tjänsten.

source: Note: Disconnected devices can only be reconnected using that device.
fi: Huom: Laitteet on mahdollista yhdistää uudestaan ainoastaan laitteen itsensä kautta.
fr: Remarque : Les appareils déconnectés peuvent seulement être reconnectés en utilisant cet appareil.
nl: Nota: losgekoppelde apparaten kunnen enkel opnieuw aangesloten worden door dit apparaat te gebruiken.
sv: Notera: Ifrånkopplade enheter kan endast återanslutas med den enheten.

source: Disconnect %1$s
fi: Pura yhteys laitteeseen %1$s
fr: Se déconnecter de %1$s
nl: Ontkoppelen %1$s
sv: Koppla ifrån %1$s

source: Export meetings to your calendar
fi: Vie kokoukset kalenteriisi
fr: Exporter les réunions dans votre calendrier
nl: Exporteer ontmoetingen naar uw kalender
sv: Exportera möten till din kalender

source: Copy this ICS-calendar feed to your calendar software to automatically export all your meetings to your calendar. For more detailed instructions, click %(L$here%).
fi: Kopio tämä ICS-syöte kalenterisovellukseesi hakeaksesi kokoukset automaattisesti kalenteriisi. Tarkemmat ohjeet löydät %(L$täältä%).
fr: Copiez ce fil de calendrier ICS dans votre logiciel de calendrier pour exporter automatiquement toutes vos réunions dans votre calendrier. Pour des instructions plus détaillées, cliquez %(L$ici%).
nl: Kopieer deze ICS-kalender-voeding naar uw agenda-software om al uw ontmoetingen automatisch te exporteren naar uw agenda. Voor meer gedetailleerde instructies, klik %(L$hier%).
sv: Kopiera det här iCal-flödet till ditt kalenderprogram för att automatiskt exportera alla dina möten till din kalender. För mer detaljerade instruktioner, klicka %(L$here%).

source: Note: This is your private link and it should be handled with care.
fi: Huom: Tämä on henkilökohtainen linkki. Käsittele sitä varoen äläkä jaa henkilöille, jotka eivät saa nähdä kalenteriasi.
fr: Remarque : Ceci est votre lien privé et il doit être utilisé avec précaution.
nl: Nota: dit is uw eigen link en het moet met zorg worden behandeld.
sv: Notera: Det här är din privata länk som bör hanteras med omtanke.

source: Are you sure you want to cancel your subscription? Doing this will end your subscription after the ongoing billing cycle. Your account will be downgraded to the limited version in %1$s.
fi: Oletko varma, että haluat perua tilauksesi? Tämä päättää tilauksen laskutuskauden päättyessä. Tilisi palautetaan ilmaiseen rajattuun versioon %1$s.
fr: Êtes-vous sûr de vouloir annuler votre abonnement ? Faire cela mettra fin à votre abonnement après le cycle de facturation en cours. Votre compte sera rétrogradé à la version limitée dans %1$s.
nl: Bent u zeker dat u uw abonnement wilt opzeggen? Door dit te doen zal uw abonnement eindigen na de lopende facturatie-cyclus. Uw account zal worden gedegradeerd tot de beperkte versie van %1$s.
sv: Är du säker på att du vill avbryta din prenumeration? Om du gör detta kommer din prenumeration att avbrytas efter den pågående faktureringen. Ditt konto kommer att bli nedgraderat till den begränsade versionen i %1$s.

source: Yes, cancel my subscription
fi: Kyllä, peru tilaus
fr: Oui, annuler mon abonnement
nl: Ja, zeg mijn abonnement op
sv: Ja, avsluta min prenumeration

source: No, continue as a PRO user
fi: Ei, jatka PRO-käyttäjänä
fr: Non, continuer en tant qu'utilisateur PRO
nl: Nee, ga verder als een PRO-gebruiker
sv: Nej, fortsätt som PRO-användare

source: Manage your settings
fi: Hallinnoi asetuksiasi
fr: Gérer vos paramètres
nl: Beheer uw instellingen
sv: Hantera dina inställningar

source: Login methods
fi: Kirjautumistavat
fr: Méthodes de connexion
nl: Login-methoden
sv: Inloggningsmetoder

source: Setup login with Google, Facebook or password.
fi: Ota käyttöön Google ja Facebook kirjautuminen tai aseta palveluun salasana suoraa kirjautumista varten.
fr: Configurer la connexion avec Google, Facebook ou par mot de passe.
nl: Login instellen met Google, Facebook of wachtwoord.
sv: Ställ in inloggning med Google, Facebook eller lösenord.

source: Integrate your calendar with Meetin.gs.
fi: Yhdistä kalenterisi Meetin.gs-palveluun.
fr: Intégrer votre calendrier avec Meetin.gs.
nl: Verenig uw kalender met Meetin.gs.
sv: Integrera din kalender med Meetin.gs.

source: Manage which of your calendars are shown on the timeline.
fi: Valitse ne kalenterit, joiden tapahtumat haluat nähdä aikajanallasi.
fr: Gérer les calendriers qui sont affichés sur votre chronologie.
nl: Beheer welke van uw kalenders getoond worden op de tijdlijn.
sv: Hantera vilken av dina kalendrar som visas i tidslinjen.

source: Regional settings
fi: Aluekohtaiset asetukset
fr: Paramètres régionaux
nl: Regionale instellingen
sv: Regionala inställningar

source: Change your time zone and language.
fi: Muuta aikavyöhykettä ja kieliasetuksia.
fr: Changer votre fuseau horaire et la langue.
nl: Verander uw tijdzone en taal.
sv: Ändra din tidszon och språk.

source: Customize the look and feel.
fi: Muokkaa palvelun ulkoasua.
fr: Personnaliser la présentation.
nl: Pas het uitzicht en gevoel aan.
sv: Anpassa utseendet.

source: Manage your account & subscription.
fi: Hallinnoi tilauksen ja tilin asetuksia.
fr: Gérer votre compte et votre abonnement.
nl: Beheer uw account en abonnement.
sv: Hantera kontot och prenumerationen.

source: Remove your account
fi: Poista tili
fr: Supprimer votre compte
nl: Verwijder uw account
sv: Ta bort ditt konto

source: Here you can remove your account permanently.
fi: Tästä voit poistaa tilisi pysyvästi.
fr: Vous pouvez supprimer votre compte définitivement ici.
nl: Hier kunt u uw account permanent verwijderen.
sv: Här kan du ta bort ditt konto permanent.

source: Regional
fi: Alue
fr: Régional
nl: Regionaal

source: Manage how you log in to the service.
fi: Hallinnoi sitä, miten kirjaudut palveluun.
fr: Gérer vos modes de connexion au service.
nl: Beheer hoe in te loggen op de service.
sv: Hantera hur du loggar in till tjänsten.

source: Third-party login options
fi: Kolmansien osapuolien kirjautumisvaihtoehdot
fr: Options de connexion des tiers
nl: Derde login-opties
sv: Tredjepartsinloggning

source: Connect one of your third-party accounts to login easily:
fi: Yhdistä palveluun kolmannen osapuolen tilisi mahdollistaaksesi helpon sisäänkirjautumisen:
fr: Connectez un de vos comptes tiers pour vous connecter facilement :
nl: Verbind een van uw derde accounts om makkelijk in te loggen:
sv: Anslut ett av dina tredjepartskonton för att logga in enkelt:

source: Connect with Facebook
fi: Yhdistä Facebook
fr: Se connecter avec Facebook
nl: Verbinden met Facebook
sv: Anslut med Facebook

source: Your account is connected to Facebook
fi: Tilisi on yhdistetty Facebookiin
fr: Votre compte est connecté à Facebook
nl: Je account is verbonden met Facebook
sv: Ditt konto är anslutet till Facebook

source: Set up a password
fi: Aseta salasana
fr: Définir un mot de passe
nl: Stel een wachtwoord in
sv: Ställ in ett lösenord

source: Create a password to easily login without your personal login link.
fi: Aseta salasana voidaksesi kirjautua helposti sisään ilman henkilökohtaista linkkiäsi.
fr: Créez un mot de passe pour vous connecter facilement sans votre lien de connexion personnel.
nl: Maak een wachtwoord aan om makkelijk in te loggen zonder uw persoonlijke login-link.
sv: Skapa ett lösenord för att enkelt logga in utan din personliga inloggningslänk.

source: Password
fi: Salasana
fr: Mot de passe
nl: Wachtwoord
sv: Lösenord

source: New password
fi: Uusi salasana
fr: Nouveau mot de passe
nl: Nieuw wachtwoord
sv: Nytt lösenord

source: Choose the language and time zone in which you want to use the service.
fi: Valitse kieli sekä aikavyöhyke, joilla haluat käyttää palvelua.
fr: Choisissez la langue et le fuseau horaire dans lequel vous voulez utiliser le service.
nl: Kies de taal en de tijdzone voor het gebruik van de service.
sv: Välj vilket språk och vilken tidszon du vill använda.

source: Select language
fi: Kieli
fr: Sélectionner la langue
nl: Taal selecteren
sv: Välj språk

source: Choose the language you want to use the service with.
fi: Valitse kieli, jolla haluat käyttää palvelua.
fr: Choisissez la langue avec laquelle vous voulez utiliser le service.
nl: Kies de taal voor het gebruik van de service.
sv: Välj på vilket språk som du vill använda tjänsten.

source: Note: Your invitations to new meeting participants will be sent using the selected language by default.
fi: Huom: Kokouskutsut lähetetään oletuksena valitsemallasi kielellä.
fr: Remarque : Vos invitations aux nouveaux participants de la réunion seront envoyées en utilisant la langue sélectionnée par défaut.
nl: Nota: uw uitnodigingen voor nieuwe ontmoetingsdeelnemers zullen opgestuurd worden door gebruik te maken van de geselecteerde standaardtaal.
sv: Notera: Dina inbjudningar till nya mötesdeltagare kommer att bli skickade på språket som du valt.

source: Language:
fi: Kieli:
fr: Langue :
nl: Taal:
sv: Språk:

source: Select time zone
fi: Valitse aikavyöhyke
fr: Sélectionner un fuseau horaire
nl: Tijdzone selecteren
sv: Välj tidszon

source: After changing your time zone, we will automatically display all your meeting times according to your new setting.
fi: Muuttaessasi aikavyöhykettä, kaikki kokouksesi näytetään uuden aikavyöhykkeen mukaisessa ajassa.
fr: Après avoir changé votre fuseau horaire, nous afficherons automatiquement toutes vos heures de réunions en fonction de votre nouveau paramètre.
nl: Na het veranderen van uw tijdzone, zullen we automatisch al uw ontmoetingstijden tonen volgens uw nieuwe instelling.
sv: Efter att ha ändrat tidszonen kommer vi automatiskt att visa alla dina möten enligt den nya inställningen.

source: Current time in the selected time zone:
fi: Aika valitulla vyöhykkeellä on:
fr: Heure actuelle dans le fuseau horaire sélectionné :
nl: Huidige tijd in de geselecteerde tijdzone:
sv: Nuvarande tid i den valda tidszonen:

source: Timeline settings
fi: Aikajanan asetukset
fr: Paramètres de la chronologie
nl: Tijdlijninstellingen
sv: Inställningar för tidslinje

source: You have no calendars connected with your account. Connect your third-party accounts or devices to import your calendar events to your Meeting Timeline.
fi: Sinulla ei ole yhtään kalenteria yhdistettynä tiliisi. Liitä kolmannen osapuolen tai laitteen kalenteri tuodaksesi tapahtumia aikajanallesi.
fr: Vous n'avez pas de calendriers connectés à votre compte. Connectez vos comptes ou appareils tiers pour importer vos événements de calendriers sur votre Chronologie de réunion.
nl: U hebt geen kalenders die verbonden zijn aan uw account. Verbind uw rekeningen van derden of apparaten om uw kalendergebeurtenissen te importeren naar uw ontmoetingstijdlijn.
sv: Du har inte anslutit några kalendrar till ditt konto. Anslut dina tredjepartskonton eller enheter för att importera dina händelser till din mötestidslinje.

source: Choose your timezone
fi: Valitse aikavyöhykkeesi
fr: Choisir votre fuseau horaire
nl: Kies uw tijdzone
sv: Välj din tidszon

source: Setup the timezone you want to use.
fi: Aseta aikavyöhyke, jota haluat käyttää.
fr: Définir le fuseau horaire que vous voulez utiliser.
nl: Stel de tijdzone in die u wilt gebruiken.
sv: Ställ in tidszonen som du vill använda.

source: Check your time zone
fi: Varmista aikavyöhykkeesi
fr: Vérifier votre fuseau horaire
nl: Check je tijdzone
sv: Kontrollera din tids-zon

source: Your currently chosen time zone is different from your device time zone. Which time zone would you like to use?
fi: Asettamasi aikavyöhyke eroaa päätelaitteesi aikavyöhykkeestä. Kumpaa aikavyöhykettä haluat käyttää?
fr: Votre fuseau horaire actuel choisi est différent du fuseau horaire de votre appareil. Quel fuseau horaire voudriez-vous utiliser ?
nl: Je nu gekozen tijdzone is ander dan de tijdzone van je toestel. Welke tijdzone wil je graag gebruiken?
sv: Den tids-zon du nyss valde stämmer inte med tids-zonen på din enhet. Vilken tids-zon vill du att vi ska använda?

source: Your device's time zone
fi: Laitteesi aikavyöhyke
fr: Fuseau horaire de votre appareil
nl: De tijdzone van uw apparaat
sv: Din enhets tids-zon

source: Your time zone setting
fi: Aikavyöhykeasetuksesi
fr: Votre réglage du fuseau horaire
nl: De instelling van je tijdzone
sv: Din tids-zon-inställning

source: Waiting for transaction
fi: Odotetaan maksua
fr: En attente de transaction
nl: Op een transactie aan het wachten
sv: Väntar på transaktion

source: A new window will now open where you can complete the transaction and activate Meetin.gs PRO subscription.
fi: Selaimeesi aukeaa nyt uusi ikkuna, jossa voit viimeistellä maksun. Tämän jälkeen kaikki Meetin.gs PRO -tilin ominaisuudet ovat käytettävissäsi.
fr: Une nouvelle fenêtre va maintenant s'ouvrir, vous pourrez y finaliser la transaction et activer l'abonnement à Meetin.gs PRO.
nl: Een nieuw scherm zal openen wanneer u de transactie heeft afgehandeld en het Meetin.gs PRO abonnement heeft geactiveerd.
sv: Ett nytt fönster öppnas nu där du kan färdigställa transaktionen och aktivera Meetin.gs PRO-prenumerationen.

source: If the window does not open in a short while, please click the link below:
fi: Paina alla olevaa linkkia, mikäli ikkuna ei aukea pian itsestään.
fr: Si la fenêtre ne s'ouvre pas rapidement, veuillez cliquer sur le lien ci-dessous :
nl: Als het venster na een korte tijd niet opent, klik dan op de link hieronder:
sv: Om fönstret inte öppnas om ett ögonblick, klicka på länken nedan:

source: Cancel payment
fi: Peruuta maksu
fr: Annuler le paiement
nl: Maak betaling ongedaan
sv: Avbryt betalning

source: Get the most out of your Meetin.gs
fi: Ota kaikki irti Meetin.gs-palvelusta
fr: Tirez le maximum de votre Meetin.gs
nl: Haal het meeste uit uw Meetin.gs
sv: Få ut det mesta av din Meetin.gs

source: Sync your mobile calendar and contacts.
fi: Synkronoi mobiililaiteesi kalenteri ja yhteystiedot.
fr: Synchroniser votre calendrier mobile et vos contacts.
nl: Synchroniseer uw mobiele kalender en contacten.
sv: Synka din mobil-kalender och -kontakter.

source: Download for iPhone
fi: Lataa iPhonelle
fr: Télécharger pour iPhone
nl: Downloaden voor iPhone
sv: Ladda ner för iPhone

source: Keep track of your meetings while on the move.
fi: Pysy kärryillä kokouksistasi ollessasi liikkeellä.
fr: Gardez une trace de vos réunions lors de vos déplacements.
nl: Houd uw ontmoetingen bij terwijl u onderweg bent.
sv: Håll reda på dina möten när du är ute och rör på dig.

source: Download for Android
fi: Lataa Androidille
fr: Télécharger pour Android
nl: Downloaden voor Android
sv: Nedladdning för Android

source: Organize meetings from Gmail, LinkedIn, Highrise and more.
fi: Järjestä kokoukset suoraan Gmailista, LInkedinistä, Highrisesta ja monista muista verkkopalveluista.
fr: Organisez des réunions à partir de Gmail, LinkedIn, Highrise et bien plus.
nl: Organiseer ontmoetingen van Gmail, Linkedln, Highrise en meer.
sv: Organisera möten från Gmail, LinkedIn, Highrise och mer.

source: Install Chrome Extension
fi: Asenna Chrome-lisäosa
fr: Installer l'extension de Chrome
nl: Chrome Extension installeren
sv: Installera Chrome Extension

source: Hang on for a while...
fi: Odota hetki...
fr: Attendez un moment...
nl: Blijf even hangen...
sv: Vänta lite...

source: We are now synchronizing the data and creating your matchmaking profile for %1$s. Don't worry, this might take several minutes.
fi: Synkronoimme tietojasi matchmaking-palveluumme ja luomme tiliäsi sähköpostille %1$s. Tämä saattaa kestää useita minuutteja.
fr: Nous synchronisons actuellement les données et créons votre profil d'appariement pour %1$s. Ne vous inquiétez pas, cela peut prendre plusieurs minutes.
nl: De data wordt nu gesynchroniseerd en uw matchmaking-profiel voor %1$s wordt nu gecreëerd. Maakt u zich geen zorgen, dit kan enkele minuten duren.
sv: Vi synkroniserar nu datan och skapar din matchningsprofil för %1$s. Ha tålamod, detta kan ta flera minuter.

source: If your profile page doesn't show up in 5 minutes, please contact our support at %1$s.
fi: Mikäli sivu ei lataudu viidessä minuutissa, ota yhteyttä tukeemme osoitteessa %1$s.
fr: Si votre page de profil n'apparaît pas dans 5 minutes, veuillez contacter notre assistance à %1$s.
nl: Indien uw profielpagina binnen 5 minuten niet zichtbaar wordt, neemt u dan alstublieft contact op met ons supportteam via %1$s.
sv: Om din profilsida inte blir synlig inom 5 minuter, var god kontakta vår support på %1$s.

source: Oops, seems like you haven't registered. Please register to the event at %1$s to proceed. If you have already registered, please contact us at %2$s for more information.
fi: Näyttäisi siltä, ettet ole vielä rekisteröitynyt. Jatkaaksesi, sinun täytyy rekisteröityä tapahtumaan osoitteessa %1$s. Jos kuitenkin olet jo rekisteröitynyt, ota meihin yhteyttä sähköpostitse osoitteeseen %2$s.
fr: Oups, il semblerait que vous ne soyez pas inscrit. Veuillez vous inscrire à l'événement à %1$s pour continuer. Si vous vous êtes déjà inscrit, veuillez nous contacter à %2$s pour plus d'informations.
nl: Oeps, het lijkt of u zich niet geregistreerd heeft. Registreer u voor %1$s bij het evenement om door te gaan. Als u zich al geregistreerd heeft, neem dan contact op met ons op %2$s voor meer informatie.
sv: Oj, det verkar som du inte har registrerat dig. Registrera dig till händelsen på %1$s för att gå vidare. Om du redan har registrerat dig, vänligen kontakta oss på %2$s för mer information.

source: Provide your details
fi: Syötä tarkemmat tietosi
fr: Renseignez vos informations
nl: Geef uw ideeën
sv: Lämna dina uppgifter

source: Do not connect - provide your information manually.
fi: Älä yhdistä. Syötä tietosi itse.
fr: Ne vous connectez pas - renseignez vos informations manuellement.
nl: Niet verbinden - verstrek uw informatie handmatig
sv: Anslut inte - ge din information manuellt.

source: A notification about the cancellation will be sent to all participants of this meeting.
fi: Peruutuksesta lähetetään ilmoitus kaikille tapaamisen osallistujille
sv: En anmälan om uppsägning kommer att skickas till alla deltagare i detta möte.

source: Cancel Meeting
fi: Peruuta tapaaminen
sv: Avboka möte

source: Cancel meeting?
fi: Peruuta tapaaminen?
sv: Avboka möte?

source: Decline Request
fi: Hylkää kutsu
sv: Rejekt förslag

source: You can add your reason and additional requests to the form below:
fi: Voit kertoa syyn perumiselle sekä esittää toiveesi allaolevassa tekstikentässä:
sv: Du kan lägga till förnuft och ytterligare ansökningar i formuläret nedan:

source: The meeting length can not be changed.
fi: Tapaamisen pituutta ei voi muuttaa.
sv: Möteslängden kan inte ändras.

source: The meeting live communication tool can not be changed.
fi: Tapaamisen verkkotapaamistyökalua ei voi muuttaa.
sv: Verktyg för livekommunikation kan inte ändras.
