Repository: meetings/core
Catalog: pkg/dicole_meetings/src/locale/desktop_back-*.po
Languages: fi, fr, nl, sv

source: Invitation to Meetin.gs
fi: Kutsu Meetin.gs-palveluun
fr: Invitation à Meetin.gs
nl: Uitnodiging voor Meetin.gs
sv: Inbjudan till Meetin.gs

source: %1$s invited you to Meetin.gs but you have not activated your account yet.
fi: %1$s kutsui sinut Meetin.gs-palveluun, mutta et ole vielä rekisteröinyt tiliäsi.
fr: %1$s vous à invité sur Meetin.gs mais vous n'avez pas encore activé votre compte.
nl: %1$s heeft je uitgenodigd voor Meetin.gs, maar je hebt je account nog niet geactiveerd.
sv: %1$s bjöd in till Meetin.gs men du har inte aktiverat ditt konto än.

source: Why register?
fi: Miksi rekisteröityä?
fr: Pourquoi s'inscrire ?
nl: Waarom inschrijven?
sv: Varför registrera?

source: avoid endless email chains
fi: Vältät loputtomat sähköpostiviestiketjut
fr: évitez les boucles interminables d'e-mails
nl: vermijd eindeloze kettingmails
sv: undvik ändlösa mejlkedjor

source: schedule online meetings with ease
fi: Aikatauluta ja sovi tapaamiset vaivattomasti
fr: planifiez vos réunions en ligne en toute simplicité
nl: plan gemakkelijk online meetings
sv: schemalägg onlinemöten utan problem

source: distribute meeting materials and notes
fi: Jakele kokousmateriaalit ja muistiinpanot helposti
fr: distribuez les documents pour la réunion ainsi que les notes.
nl: verdeel materiaal en notities van de meeting
sv: distribuera mötesmaterial och anteckningar

source: It is free. Register your account here:
fi: Palvelu on ilmainen. Rekisteröidy nyt:
fr: C'est gratuit. Enregistrez votre compte ici :
nl: Het is gratis. Registreer je account hier:
sv: Det är gratis. Registrera ditt konto här:

source: Register to Meetin.gs
fi: Rekisteröidy Meetin.gs-palveluun
fr: Inscrivez-vous sur Meetin.gs
nl: Registreer op Meetin.gs
sv: Registrera på Meetin.gs

source: Reminder: You have been invited to Meetin.gs
fi: Muistutus: Sinut on kutsuttu Meetin.gs-palveluun
fr: Rappel : Vous avez reçu une invitation sur Meetin.gs
nl: Herinnering: Je bent uitgenodigd voor Meetin.gs
sv: Påminnelse: Du har blivit inbjuden till Meetin.gs

source: Thanks for signing up for Meetin.gs.
fi: Kiitos rekisteröitymisestä Meetin.gs-palveluun.
fr: Merci pour votre inscription sur Meetin.gs.
nl: Bedankt voor het registreren bij Meetin.gs.
sv: Tack för att du skrev upp dig på Meetin.gs.

source: Be a meeting rockstar and organize your first meeting now.
fi: Ole kokousjärjestelyiden kuningas - Luo ensimmäinen kokouksesi nyt.
fr: Devenez une rock-star de la réunion en organisant votre premier événement dès maintenant.
nl: Wordt een meeting rockster en organiseer je eerste meeting nu.
sv: Var en mötesrockstjärna och organisera ditt första möte nu.

source: Create a meeting
fi: Luo kokous
fr: Créez une réunion
nl: Maak een meeting aan
sv: Skapa ett möte

source: Meetin.gs is waiting for you
fi: Tehokkaammat kokoukset odottavat
fr: Meetin.gs vous attend
nl: Meetin.gs wacht op jou
sv: Meetin.gs väntar på dig

source: It's been a while since we last saw you.
fi: Emme ole nähneet sinua aikoihin.
fr: On ne vous a pas vu depuis longtemps.
nl: Het is al een tijdje geleden dat we je gezien hebben.
sv: Det var ett tag sen sist.

source: Getting back to business is easy, just organize your next meeting.
fi: Palvelun pariin palaaminen on helppoa. Senkun järjestät seuraavan kokouksesi.
fr: Il est facile de se remettre au travail, il suffit d'organiser votre prochaine réunion.
nl: Weer beginnen met ondernemen is gemakkelijk, organiseer gewoon je volgende meeting.
sv: Det är lätt sätta igång igen, organisera bara ditt nästa möte.

source: Meetin.gs is missing you
fi: Meillä on ikävä sinua
fr: Vous manquez à Meetin.gs
nl: Meetin.gs mist je
sv: Meetin.gs saknar dig

source: Hi there,
fi: Hei,
fr: Coucou,
nl: He daar,
sv: Hej där,

source: I've found Meetin.gs useful for organizing meetings.
fi: Meetin.gs on helpottanut minun kokousjärjestelyitäni.
fr: Meetin.gs m'a été utile pour organiser des réunions.
nl: Ik vind Meetin.gs handig voor het organiseren van meetings.
sv: Jag har funnit Meetin.gs användbart för att organisera möten.

source: %1$s wants you to try
fi: %1$s haluaa sinun kokeilevan
fr: %1$s souhaite que vous tentiez de
nl: %1$s wil dat je probeert
sv: %1$s vill att du ska testa

source: Meetin.gs is a free service that helps you to keep meeting participants on the same page and materials up to date.
fi: Meetin.gs on ilmainen palvelu, joka auttaa kokousten järjestämisessa ja parantaa niiden laatua pitämällä osapuolet ajan tasalla ja koostamalla kaikki kokousmateriaalit yhteen paikkaan.
fr: Meetin.gs est un service gratuit qui vous aide à maintenir les participants à vos réunions sur la même page et les documents à jour.
nl: Meetin.gs is een gratis dienst je die helpt deelnemers aan meetings op de hoogte te houden en je materialen up-to-date te houden.
sv: Meetin.gs är en kostnadsfri tjänst som hjälper dig att hålla mötesdeltagare synkade och material uppdaterade.

source: Register your account here.
fi: Rekisteröidy palveluun heti!
fr: Enregistrez votre compte ici.
nl: Registreer je account hier.
sv: Registrera ditt konto här.

source: Sign up now
fi: Rekisteröidy nyt
fr: Enregistrez-vous maintenant
nl: Registreer nu
sv: Registrera dig nu

source: %1$s has invited you to Meetin.gs
fi: %1$s on kutsunut sinut käyttämään Meetin.gs-palvelua
fr: %1$s vous a invité sur Meetin.gs
nl: %1$s heeft je uitgenodigd voor Meetin.gs
sv: %1$s har bjudit in dig till Meetin.gs

source: Subscription cancelled
fi: Tilaus peruttu
fr: Abonnement annulé
nl: Abonnement geannuleerd
sv: Prenumeration avbruten

source: Your %1$s PRO subscription paid by %2$s has been terminated.
fi: %2$s on päättänyt %1$s PRO tilauksesi.
fr: Votre abonnement %1$s PRO payé par %2$s a été résilié.
nl: Uw %1$s PRO abonnement dat betaald is door %2$s is beëindigd.
sv: Din %1$s PRO-prenumeration, betald av %2$s, har avslutats

source: You may still access your meeting information and materials via %1$s.
fi: Pääset edelleen käsiksi kokoustietoihin ja materiaalehin %1$s-palvelun kautta,
fr: Vous pouvez toujours accéder aux informations et aux documents de vos réunions via %1$s.
nl: U kunt nog steeds informatie en materialen van meetings opvragen via %1$s.
sv: Vous pouvez toujours accéder aux informations et aux documents de vos réunions via %1$s.

source: All your information in the service can be removed permanently through the settings menu.
fi: Kaikki palveluun tallennetut käyttäjätietosi voidaan poistaa asetukset-valikosta.
fr: L'ensemble de vos informations stockées sur le service peut être supprimé définitivement depuis le menu des paramètres.
nl: Al uw informatie opgeslagen in deze service kan permanent verwijderd worden in het instellingenmenu.
sv: All din information i tjänsten kan avlägsnas varaktigt via inställningsmenyn.

source: Log in to access your data or to remove your account:
fi: Kirjaudu sisään nähdäksesi tietosi tai poistaaksesi tilin:
fr: Connectez-vous pour accéder à vos données ou pour supprimer votre compte :
nl: Log in om toegang te krijgen tot uw data of om uw account te verwijderen:
sv: Logga in för att få tillgång till din data eller för att avsluta ditt konto:

source: Your %1$s PRO subscription has ended
fi: Votre abonnement %1$s PRO est terminé
fr: Votre abonnement %1$s PRO est terminé
nl: Uw %1$s PRO abonnement is afgelopen
sv: Din %1$s PRO-prenumeration har avslutats

source: Time to get ready for:
fi: Aika valmistautua kokoukseen:
fr: Il est temps de se tenir prêt pour :
nl: Bereid je voor op:
sv: Dags att göra dig redo för:

source: Here's your summary for:
fi: Tässä yhteenveto tapaamisesta:
fr: Voici votre résumé pour :
nl: Hier is uw samenvatting voor:
sv: Här är din sammanfattning för:

source: What's new with:
fi: Katso mitä uutta kokouksessa:
fr: Ce qui change avec :
nl: Wat is er nieuw met:
sv: Vad är nytt med:

source: Was held on %1$s
fi: Järjestettiin %1$s
fr: A été tenue le %1$s
nl: Werd gehouden op %1$s
sv: Hölls %1$s

source: On %1$s
fi: Omavalintaisessa työkalussa %1$s
fr: Sur %1$s
nl: Over %1$s
sv: På %1$s

source: Skype is enabled for this meeting.
fi: Tässä kokouksessa on käytössä Google Hangouts.
fr: Skype est activé pour cette réunion.
nl: Skype is ingeschakeld voor deze vergadering.
sv: Skype är aktiverat för detta möte.

source: A teleconference number has been set for this meeting.
fi: Kokoukselle on asetettu puhelinneuvotteluyhteys.
fr: Un numéro de téléconférence a été fixé pour cette réunion.
nl: Voor deze vergadering is een teleconferentienummer ingesteld.
sv: Ett telekonferensnummer har satts för detta möte.

source: Google Hangouts is enabled for this meeting.
fi: Tässä kokouksessa on käytössä Google Hangouts.
fr: Google Hangouts est activé pour cette réunion.
nl: Google Hangouts is ingeschakeld voor deze vergadering.
sv: Google Hangouts är aktiverat för detta möte.

source: Microsoft Lync is enabled for this meeting.
fi: Tässä kokouksessa on käytössä Google Hangouts.
fr: Microsoft Lync est activé pour cette réunion.
nl: Microsoft Lync is ingeschakeld voor deze vergadering.
sv: Microsoft Lync är aktiverat för detta möte.

source: A custom live communication tool is used for this meeting.
fi: Tässä kokouksessa on käytössä järjestäjän omavalintainen etätyökalu.
fr: Un outil de communication en direct est utilisé pour cette réunion.
nl: Voor deze vergadering wordt een speciale live communicatietool gebruikt.
sv: Ett live-kommunikationsverktyg används för detta möte.

source: Get ready and open the meeting page to easily join the online conference.
fi: Valmistaudu avaamalla kokoussivu, josta pääset helposti liittymään etäkokoukseen.
fr: Tenez-vous prêt et ouvrez la page de réunion pour facilement rejoindre la conférence en ligne.
nl: Zet u schrap en open de vergaderingspagina om gemakkelijk deel te nemen aan de online conferentie.
sv: Öppna mötessidan för att snabbt gå med i onlinekonferensen.

source: Open Meeting page
fi: Avaa tapaamissivu
fr: Ouvrir La Page Réunion
nl: Open vergadering pagina
sv: Öppna Mötessidan.

source: New title:
fi: Uusi otsikko:
fr: Nouveau titre :
nl: Nieuwe titel:
sv: Ny titel:

source: Time has been set:
fi: Aika on asetettu:
fr: L'horaire est fixé :
nl: Tijd is ingesteld:
sv: Tiden har ställts in:

source: New time:
fi: Uusi aika on:
fr: Nouvel horaire :
nl: Nieuwe tijd:
sv: Ny tid:

source: New location:
fi: Uusi sijainti:
fr: Nouveau lieu :
nl: Nieuwe locatie:
sv: Ny plats:

source: Time has been removed.
fi: Aika on poistettu.
fr: L'horaire a été supprimé.
nl: Tijd is verwijderd.
sv: Tiden har raderats.

source: New participants:
fi: Uusia osallistujia:
fr: Nouveaux participants :
nl: Nieuwe deelnemers:
sv: Nya deltagare:

source: %1$s updated the %(MATERIAL_LINK$agenda%):
fi: %1$s teki muutoksia %(MATERIAL_LINK$agendaan%):
fr: %1$s a mis à jour le %(MATERIAL_LINK$agenda%):
nl: %1$s heeft de %(MATERIAL_LINK$agenda%) geüpdatet:
sv: %1$s uppdaterade %(MATERIAL_LINK$agenda%):

source: The %(MATERIAL_LINK$agenda%) has been updated. Here is the latest version:
fi: %(MATERIAL_LINK$Agendaa%) on muutettu. Tässä viimeisin versio:
fr: Le %(MATERIAL_LINK$agenda%) a été mis à jour. Voici la dernière version :
nl: De %(MATERIAL_LINK$agenda%) is geüpdatet. Hier is de laatste versie:
sv: %(MATERIAL_LINK$agenda%) har uppdaterats. Här är den senaste versionen:

source: %1$s updated the %(MATERIAL_LINK$action points%):
fi: %1$s teki muutoksia %(MATERIAL_LINK$sovittuihin jatkotoimenpiteisiin%):
fr: %1$s a mis à jour le %(MATERIAL_LINK$points d'action%):
nl: %1$s heeft de %(MATERIAL_LINK$action points%) geüpdatet:
sv: %1$s uppdaterade %(MATERIAL_LINK$action points%):

source: The %(MATERIAL_LINK$action points%) have been updated. Here is the latest version:
fi: %(MATERIAL_LINK$Sovittuihin jatkotoimenpiteisiin%) on tehty muutoksia. Tässä viimeisin versio:
fr: Le %(MATERIAL_LINK$points d'action%) a été mis à jour. Voici la dernière version :
nl: De %(MATERIAL_LINK$action points%) zijn geüpdatet. Hier is de laatste versie:
sv: %(MATERIAL_LINK$action points%) har uppdaterats. Här är den senaste versionen:

source: New comments for scheduling discussion:
fi: Keskustelua aikatauluista:
fr: Il y a des nouveaux commentaires à propos de la discussion sur la planification :
nl: Nieuwe reacties op deze planningsdiscussie:
sv: Nya kommentarer för schemaläggningsdiskussion:

source: New shared materials:
fi: Uusia kokousmateriaaleja:
fr: Nouveaux éléments partagés :
nl: Nieuw gedeeld materiaal:
sv: Nytt delat material:

source: %(MATERIAL_LINK$%1$s%) by %(I$%2$s%)
fi: %(MATERIAL_LINK$%1$s%) käyttäjältä %(I$%2$s%)
fr: %(MATERIAL_LINK$%1$s%) par %(I$%2$s%)
nl: %(MATERIAL_LINK$%1$s%) door %(I$%2$s%)
sv: %(MATERIAL_LINK$%1$s%) av %(I$%2$s%)

source: New comments for %(MATERIAL_LINK$%1$s%)
fi: Uusia kommentteja materiaaliin: %(MATERIAL_LINK$%1$s%)
fr: Nouveaux commentaires pour %(MATERIAL_LINK$%1$s%)
nl: Nieuwe opmerkingen voor %(MATERIAL_LINK$%1$s%).
sv: Nya kommentar till %(MATERIAL_LINK$%1$s%)

source: Click to enter meeting
fi: Paina ja siirry kokoussivulle
fr: Cliquez pour saisir une réunion
nl: Klik om meeting binnen te gaan
sv: Klicka för att gå på mötet

source: Now that the meeting is over, would you like to organize a follow-up?
fi: Haluatko järjestää päättyneelle kokoukselle jatkoa?
fr: Maintenant que la réunion est terminée, voulez-vous organiser une suite ?
nl: Nu de vergadering voorbij is, zou u een vervolgvergadering willen organiseren?
sv: Vill du organisera ett uppföljningsmöte, nu när mötet är över?

source: Organize a follow-up meeting
fi: Järjestä jatkokokous
fr: Organiser la suite de la réunion
nl: Organiseer een vervolgvergadering
sv: Organisera ett uppföljningsmöte

source: Want to run a meeting like this? Organize it now for free:
fi: Haluatko järjestää seuraavan kokouksesi tällä tavoin? Tee se nyt ilmaiseksi:
fr: Vous voulez gérer une réunion comme celle-ci ? Organisez-en une maintenant gratuitement :
nl: Wilt u vergadering zoals deze beleggen? Organiseer deze dan nu gratis:
sv: Vill du hålla ett möte såhär? Organisera det gratis nu:

source: Organize a meeting
fi: Järjestä kokous
fr: Organisez une réunion
nl: Organiseer een meeting
sv: Organisera ett möte

source: Tip:
fi: Vinkki:
fr: Conseil :
sv: Tips:

source: You can also add material by emailing attachments to
fi: Vot lisätä materiaaleja myös lähettämällä ne sähköpostin liitteinä osoitteeseen
fr: Vous pouvez aussi ajouter des données par email à
nl: U kan ook materiaal toevoegen door bijlagen te emailen naar
sv: Du kan också lägga till material genom att mejla bilagor till

source: The documents will automatically appear on the meeting page.
fi: Tieodstot ilmestyvät automaattisesti kokoussivulle.
fr: Les documents apparaîtront automatiquement sur la page réunion.
nl: De documenten zullen automatisch getoond worden op de meeting-pagina.
sv: Dokumenten visas automatiskt på sidan för mötet

source: Meeting starts in 15 minutes:
fi: Kokous alkaa 15 minuutin kuluttua:
fr: La réunion va commencer dans 15 minutes :
nl: Meeting begint over 15 minuten:
sv: Möte börjar om 15 minuter:

source: Action points:
fi: Sovitut toimenpiteet:
fr: Points d'action :
nl: Actiepunten:
sv: Att göra-punkter

source: Summary:
fi: Tiivistelmä:
fr: Résumé :
nl: Samenvatting:
sv: Sammanfattning

source: New updates:
fi: Päivityksiä kokouksessa:
fr: Nouvelles mises à jour :
nl: Nieuwe updates:
sv: Nya uppdateringar:

source: Hello,
fi: Tervehdys,
fr: Bonjour,
nl: Hallo,
sv: Hej,

source: Your meeting %(B$%1$s%) is still a %(B$draft%).
fi: Kokouksesi %(B$%1$s%) on edelleen %(B$luonnos%).
fr: Votre réunion %(B$%1$s%) est encore à l'état de %(B$brouillon%).
nl: Je meeting %(B$%1$s%) is nog een %(B$draft%).
sv: Ditt möte %(B$%1$s%) är fortfarande ett (B$utkast).

source: Your %(B$untitled meeting%) is still a %(B$draft%).
fi: %(B$Nimetön kokouksesi%) on edelleen %(B$luonnos%).
fr: Votre %(B$réunion sans titre%) est encore un %(B$brouillon%).
nl: Je %(B$untitled meeting%) is nog steeds een %(B$draft%).
sv: Ditt %(B$namnlösa möte) är fortfarande ett %(B$utkast%).

source: When
fi: Milloin
fr: Date
nl: Wanneer
sv: När

source: Not known yet
fi: Ei tiedossa
fr: Inconnu pour l'instant
nl: Nog niet bekend
sv: Ej känd ännu

source: Where
fi: Missä
fr: Lieu
nl: Waar:
sv: Var

source: Not set
fi: Ei päätetty
fr: Non défini(e)
nl: Niet vastgesteld
sv: Ej angivet

source: Who
fi: Osallistujat:
fr: Qui
nl: Wie
sv: Vem

source: Open meeting page
fi: Avaa tapaamissivu
fr: Ouvrir la page réunion
nl: Open meeting-pagina
sv: Öppna sidan för mötet

source: Google calendar
fi: Google kalenteri
fr: Calendrier Google
nl: Google kalender
sv: Google kalender

source: Other ICS
fi: Muu ICS
fr: Autres fichiers ICS
nl: Andere ICS
sv: Andra ICS

source: Calendar links:
fi: Kalenterilinkit:
fr: Liens agenda :
nl: Agendalinks:
sv: Kalenderlänkar:

source: %(B$The participants do not yet have access%) to the meeting page and materials.
fi: %(B$Osallistujilla ei ole vielä pääsyä%) kokoussivulle eikä kokousmateriaaleihin.
fr: %(B$Les participants n'ont pas accès%) à la page de réunion et aux données.
nl: %(B$ De deelnemers hebben nog geen toegang%) tot de vergaderpagina en de materialen.
sv: %(B$Deltagarna har inte tillgång%) till mötessidan och materialen än.

source: Go to the meeting page, check that everything is OK and then click "Ready" on the top right corner, so that the invitations get sent out to the participants.
fi: Siirry kokoussivulle ja tarkista, että kaikki on kunnossa. Paina lopuksi "Valmis"-painikettä sivun oikeasta yläkulmasta lähettääksesi kutsut osallistujille.
fr: Allez sur la page de réunion, vérifiez que tout est en ordre et cliquez sur « Prêt » en haut à droite pour que les invitations soient envoyées aux participants.
nl: Ga naar de vergaderpagina, controleer dat alles klopt en klik op 'Gereed' in de rechter bovenhoek om de uitnodigingen aan de deelnemers te versturen.
sv: Gå till mötessidan, kolla att allt är OK och klicka på "Klar" i övre högra hörnet så att inbjudningarna skickas ut till deltagarna.

source: Action required: Your meeting %1$s is not yet ready
fi: Toimintaa odotetaan: Kokouksesi %1$s ei ole vielä valmis
fr: Action requise : votre réunion %1$s n'est pas encore prête
nl: Actie vereist: Je meeting %1$s is nog niet gereed
sv: En handlin krävs: Ditt möte %1$s är inte klart än

source: Your untitled meeting is not yet ready
fi: Nimetön kokouksesi ei ole vielä valmis
fr: Votre réunion sans titre n'est pas encore prête
nl: Uw vergadering zonder titel is nog niet gereed.
sv: Ditt obetitlade möte är inte klart än

source: We received your email to
fi: Vastaanotimme sähköpostisi kokoukseen
fr: Nous avons reçu votre e-mail à
nl: We hebben uw email ontvangen om
sv: Vi har tagit emot ditt e-postmeddelande till

source: Problem with your email to
fi: Ongelma lähettämässäsi sähköpostissa kokoukseen
fr: Problème avec votre e-mail à
nl: Probleem met uw email om
sv: Problem med ditt e-postmeddelande till

source: We got the email you sent to %1$s and updated it to the meeting page.
fi: Vastaanotimme sähköpostisi kokoukseen %1$s liittyen ja päivitimme viestin sisällön kokoussivulle.
fr: Nous avons reçu l'e-mail que vous avez envoyé à %1$s et l'avons mis à jour sur la page de la réunion.
nl: We hebben de email die u verzonden heeft ontvangen en de vergaderpagina ermee bijgewerkt.
sv: Vi fick ditt e-postmeddelande som du skickade till %1$s och uppdaterade mötessidan med det.

source: We got the email you sent
fi: Vastaanotimme lähettämäsi sähköpostin
fr: Nous avons reçu l'e-mail que vous avez envoyé
nl: We hebben de email die u heeft verzonden ontvangen.
sv: Vi fick e-postmeddelandet du skickade

source: Unfortunately we could not process your email to %1$s. Please try again.
fi: Valitettavasti emme voineet käsitellä kokoukseen %1$s lähettämääsi sähköpostiviestiä. Ole hyvä ja yritä uudelleen.
fr: Nous n'avons malheureusement pas pu traiter votre e-mail pour %1$s. Merci de réessayer.
nl: Helaas konden we uw email aan %1$s niet verwerken. Probeer het alstublieft nogmaals.
sv: Tyvärr kunde vi inte behandla ditt e-postmeddelande till %1$s. Försök igen.

source: Unfortunately we could not process the email you sent. Please try again.
fi: Valitettavasti emme voineet käsitellä lähettämääsi sähköpostia. Ole hyvä ja yritä uudelleen.
fr: Nous n'avons malheureusement pas pu traiter l'e-mail que vous avez envoyé. Merci de réessayer.
nl: Helaas konden we uw email niet verwerken. Probeer het alstublieft nogmaals.
sv: Vi kunde tyvärr inte behandla e-postmeddelandet du skickade. Försök igen.

source: The following files sent to %1$s were over the size limit of %2$s and could not be uploaded to the meeting page: %3$s.
fi: Kokoukseen %1$s lähetetyt tiedostot %3$s ylittivät asetetun %2$s kokorajoituksen.
fr: Les fichiers suivants envoyés à %1$s dépassaient la limite de %2$s et n'ont pas pu être joints à la page de la réunion : %3$s.
nl: De volgende bestanden die naar %1$s zijn gestuurd waren groter dan de bestandsgrootte limiet van %2$s en konden niet worden geüpload naar de vergaderpagina: %3$s.
sv: Följande filer som skickades till %1$s var större än storleksgränsen på %2$s och kunde inte överföras till mötessidan: %3$s.

source: The following files were over the size limit of %1$s and could not be uploaded to the meeting page: %2$s.
fi: Seuraavat tiedostot ylittivät asetetun %1$s:n kokorajoituksen eikä niitä voitu lisätä kokoussivulle: %2$s.
fr: Les fichiers suivants dépassent la limite de %1$s et n'ont pas pu être joints à la page de la réunion : %2$s.
nl: De volgende bestanden waren over de bestandsgrootte limiet van %1$s en konden niet worden geüpload naar de vergaderpagina: %2$s.
sv: Följande filer var större än storleksgränsen på %1$s och kunde inte överföras till mötessidan: %2$s.

source: Your email address %1$s was not found as a participant for this meeting. If you want to join, reply to this message with the word JOIN as the first word.
fi: Sähköpostiosoitteesi %1$s ei näyttäisi olevan kutsuttu tähän kokoukseen. Mikäli haluat liittyä, voit tehdä sen kirjoittamalla sanan JOIN ja lähettämällä sen vastaukseksi tähän sähköpostiviestiin.
fr: Votre adresse e-mail %1$s n'a pas été trouvée parmi la liste des participants de cette réunion. Si vous souhaitez la rejoindre, répondez à ce message en utilisant JOIN comme premier mot.
nl: Uw emailadres %1$s is niet gevonden als deelnemer in deze vergadering. Als u mee wil doen, beantwoord dan deze boodschap met het woord JOIN als het eerste woord.
sv: Din e-postadress %1$s kunde inte hittas som deltagare i det här mötet. Om du vill ansluta till mötet kan du svara på det här meddelandet med ordet JOIN som första ord.

source: Don't want to receive confirmation emails like this in the future? Use this link to disable them:
fi: Etkö halua vastaanottaa tämänlaisia sähköposteja tulevaisuudessa? Kytke ne pois päältä tästä linkistä:
fr: Vous ne souhaitez plus recevoir ce genre d'e-mails de confirmation ? Désactivez les grâce au lien suivant :
nl: Wilt u in de toekomst geen bevestigingsberichten als deze meer ontvangen? Gebruik dan deze link om ze uit te schakelen.
sv: Vill du inte få dessa bekräftelsemeddelanden via e-post i framtiden? Använd följande länk för att inaktivera dem:

source: disable confirmation emails
fi: Poista vahvistusviestit käytöstä
fr: désactiver les e-mails de confirmation
nl: Schakel bevestigingsemails uit.
sv: inaktivera bekräftelsemeddelanden

source: Confirmation: Your email to %1$s received
fi: Vahvistus: Sähköpostisi kokoukseen %1$s vastaanotettu
fr: Confirmation : Votre e-mail à %1$s a été reçu
nl: Bevestiging: uw email naar %1$s is ontvangen.
sv: Bekräftelse: Ditt e-postmeddelande till %1$s har tagits emot

source: Confirmation: Your email received
fi: Vahvistus: Vastaanotimme sähköpostisi
fr: Confirmation : Votre e-mail a été reçu
nl: Bevestiging: uw email is ontvangen.
sv: Bekräftelse: Din e-post tog emot
