Repository: meetings/core
Catalog: pkg/dicole_weblog/msg/messages-*.po
Languages: fi

source: Abstract
fi: Tiivistelmä

source: Write weblog entry
fi: Merkinnän lisäys blogiin

source: Write entry
fi: Kirjoita merkintä

source: Add topic
fi: Lisää aihe

source: All topics
fi: Kaikki aiheet

source: All shared topics
fi: Kaikki jaetut aiheet

source: Author
fi: Kirjoittaja

source: Browse by topic
fi: Selaa aiheittain

source: Configure weblog
fi: Blogin asetusten muokkaus

source: Content
fi: Sisältö

source: Delete weblog entries
fi: Merkintöjen poistaminen blogista

source: Deny reading weblog
fi: Estä blogin lukuoikeus

source: Deny maintaining weblog
fi: Estä blogin ylläpitäminen

source: Edit weblog entries
fi: Blogin merkintöjen muokkaus

source: Edit entry
fi: Muokkaa merkintää

source: Group weblog
fi: Ryhmäblogi

source: Error removing entry with name %1.
fi: Merkinnän (%1) poisto epäonnistui.

source: Failed adding entry: %1
fi: Merkinnän (%1) lisäys epäonnistui

source: Failed adding topic: %1
fi: Aiheen (%1) lisäys epäonnistui

source: Failed to edit entry: %1
fi: Merkinnän (%1) muokkaus epäonnistui

source: Weblog allows the group to inform about latest activity and comment on the outside world.
fi: Blogi kokoaa ryhmän viimeisimmät ajankohtaisuudet ja antaa mahdollisuuden muiden mielenkiintoisten asioiden kommentointiin.

source: Read weblog
fi: Blogin lukija

source: Maintain weblog
fi: Blogin ylläpitäjä

source: Latest weblog entries
fi: Viimeisimmät blogin merkinnät

source: List of entries
fi: Merkintöjen listaus

source: New entry details
fi: Uuden merkinnän tiedot

source: No entries.
fi: Merkintöjä ei ole saatavilla.

source: No topics found.
fi: Aiheita ei ole saatavilla.

source: Permalink and comments (%1)
fi: Permalink ja kommentit (%1)

source: Entry details
fi: Merkinnän tiedot

source: Entry saved
fi: Merkintä tallennettiin onnistuneesti

source: Blog entry with id %1 does not exist or it was deleted.
fi: Blogimerkintää id-tunnisteella %1 ei ole saatavilla tai se on poistettu.

source: Entry with name %1 successfully removed.
fi: Merkintä (%1) poistettiin onnistuneesti.

source: Publish time
fi: Julkaisuajankohta

source: Recent
fi: Viimeisimmät

source: Recent entries
fi: Uusimmat merkinnät

source: Recent blog entries
fi: Uusimmat blogimerkinnät

source: Recent entries to topic %1
fi: Viimeisimmät merkinnät aiheesta %1

source: Remove entry
fi: Poista merkintä

source: Remove selected
fi: Poista valitut

source: Remove topics
fi: Poista aiheet

source: Save
fi: Tallenna

source: Settings
fi: Asetukset

source: Show recent entries
fi: Näytä viimeisimmät merkinnät

source: Syndication feed (RSS 1.0)
fi: RSS (1.0) -syöte

source: This entry will be removed. Are you sure you want to remove this entry?
fi: Tämä merkintä poistetaan pysyvästi. Haluatko varmasti poistaa merkinnän?

source: Title
fi: Otsikko

source: Topic
fi: Aihe

source: Topic added
fi: Aihe lisättiin onnistuneesti

source: Topics
fi: Aiheet

source: User can add weblog entries
fi: Käyttäjä voi lisätä blogiin merkintöjä

source: User can configure the weblog
fi: Käyttäjä voi muokata blogin asetuksia

source: User can delete weblog entries
fi: Käyttäjä voi poistaa blogin merkintöjä

source: User can edit weblog entries
fi: Käyttäjä voi muokata blogin merkintöjä

source: User can read the weblog
fi: Käyttäjä voi lukea blogin merkintöjä

source: Access denied to read entry with id %1.
fi: Käyttö evätty. Merkinnän numero %1 lukeminen epäonnistui.

source: Comments
fi: Kommentit

source: Post your comment
fi: Lähetä kommenttisi

source: No comments.
fi: Ei kommentteja.

source: Comment has been added.
fi: Kommentti on lisätty.

source: Failed adding comment: %1
fi: Kommentin lisäys epäonnistui: %1

source: Comment weblog entries
fi: Blogin merkintöjen kommentointi

source: User can comment weblog entries
fi: Käyttäjä voi kommentoida blogin merkintöjä

source: Delete weblog comments
fi: Blogin kommenttien poistaminen

source: User can delete weblog comments
fi: Käyttäjä voi poistaa blogin kommentteja

source: Are you sure you want to remove the selected comment?
fi: Oletko varma, että haluat poistaa valitun kommentin?

source: Confirmation
fi: Varmistus

source: Remove
fi: Poista

source: Error removing comment %1.
fi: Virhe poistettaessa kommenttia %1.

source: Comment removed.
fi: Kommentti poistettu.

source: No topics defined. You have to define topics before you can post.
fi: Aiheita ei ole määritelty. Sinun täytyy määritellä aiheita, ennen kuin voit lähettää viestejä.

source: Select at least one topic.
fi: Valitse vähintään yksi aihe.

source: Selected topics removed.
fi: Valitut aiheet on poistettu.

source: Weblog
fi: Blogi

source: Weblog allows one to inform about latest activity and comment on the outside world.
fi: Blogin avulla voidaan kirjata viimeisimmät ajankohtaisuudet ja kommentoida muita mielenkiintoisia asioita.

source: Read weblog of a user
fi: Käyttäjän blogin luku

source: User can read weblog of a user
fi: Käyttäjä voi lukea toisen käyttäjän blogia

source: Add posts to a weblog of a user
fi: Viestien lisäys käyttäjän blogiin

source: User can add weblog entries for a user
fi: Käyttäjä voi lisätä merkintöjä toisen käyttäjän blogiin

source: Edit entries in a weblog of a user
fi: Merkintöjen muokkaus käyttäjän blogissa

source: User can edit weblog entries of a user
fi: Käyttäjä voi muokata merkintöjä toisen käyttäjän blogia

source: Configure weblog of a user
fi: Käyttäjän blogin asetusten muokkaus

source: User can configure weblog tool of a user
fi: Käyttäjä voi muokata toisen käyttäjän blogin asetuksia

source: Remove posts in a weblog of a user
fi: Viestien poisto käyttäjän blogista

source: User can delete weblog entries of a user
fi: Käyttäjä voi poistaa toisen käyttäjän blogin merkintöjä

source: Comment weblog of a user
fi: Käyttäjän blogin kommentointi

source: User can comment weblog entries of a user
fi: Käyttäjä voi kommentoida toisen käyttäjän blogia

source: Delete comments in a weblog of a user
fi: Kommenttien poisto käyttäjän blogista

source: User can delete weblog comments of a user
fi: Käyttäjä voi poistaa toisen käyttäjän blogin kommentteja

source: Maintain weblog of a user
fi: Käyttäjän blogin ylläpitäminen

source: Deny maintaining weblog of a user
fi: Estä käyttäjän blogin ylläpitäminen

source: Deny reading weblog of a user
fi: Estä käyttäjän blogin lukeminen

source: Show entry
fi: Näytä merkintä

source: Limit outsider access by IP addresses (each on a separate line)
fi: Rajoita syöte IP osoitteiden mukaan (eroteltu omille riveilleen)

source: Feed is publicly accessible
fi: Syöte on julkisesti saatavilla

source: Number of items in feed
fi: Kohteiden määrä syötteessä

source: All
fi: Kaikki

source: Show only entry abstracts in feeds
fi: Näytä syötteessä ainoastaan tiivistelmät

source: Settings saved.
fi: Asetukset on tallennettu.

source: Failed to edit settings: %1
fi: Asetusten muuttaminen epäonnistui: %1

source: Edit settings
fi: Muokkaa asetuksia

source: Bookmarklets
fi: Erikoiskirjanmerkit

source: You may use these bookmarklets to blog a certain website with a single click. To install the bookmarklet, add the bookmarklet link to your bookmarks. To use it, simply just click the bookmark when you are on a page you want to post. If you want to quote something, just highlight the text you want to quote before clicking the bookmarklet.
fi: Voit käyttää näitä erikoiskirjanmerkkejä lähettääksesi blogiin merkinnän haluamastasi verkkosivusta yhdellä hiiren painalluksella. Asenna kirjanmerkki siirtämällä linkki selaimesi kirjanmerkkeihin. Käyttääksesi kirjanmerkkiä, klikkaa sitä kun olet haluamallasi sivulla. Jos haluat lainata tekstiä, maalaa haluamasi teksti ennen kuin klikkaat erikoiskirjanmerkkiä.

source: Post to weblog
fi: Lähetä blogiin

source: Back to add form
fi: Takaisin lisäyslomakkeeseen

source: Available bookmarklets
fi: Saatavilla olevat erikoiskirjanmerkit

source: Entry successfully saved. You may now close the window.
fi: Merkintä on tallennettu onnistuneesti. Voit nyt sulkea ikkunan.

source: Select users to share topic %s with
fi: Valitse käyttäjät joille jaat aiheen %s

source: Select groups to share topic %s with
fi: Valitse ryhmä joille jaat aiheen %s

source: Share topic %s
fi: Jaa aihe %s

source: Share weblog
fi: Jaa blogi

source: Select topic to share
fi: Valitse jaettava aihe

source: Share to local users
fi: Jaa paikallisille käyttäjille

source: Share to outsiders
fi: Jaa ulkopuolisille käyttäjille

source: Feed settings
fi: Syötteen asetukset

source: Share
fi: Jaa

source: Share to users
fi: Jaa käyttäjille

source: Share to groups
fi: Jaa ryhmille

source: Select users to share all topics with
fi: Valitse käyttäjät joille jaat kaikki aiheet

source: Select groups to share all topics with
fi: Valitse ryhmät joille jaat kaikki aiheet

source: Weblog of user %s
fi: Käyttäjän %s blogi

source: Other accessible weblog feeds
fi: Muut saatavilla olevien blogisyötteet

source: Other weblogs
fi: Muut blogit

source: Weblog rights
fi: Blogin oikeudet

source: Allow reading one topic from a weblog of a group
fi: Salli aiheen lukeminen ryhmän blogista

source: Allow reading one topic from a weblog of a user
fi: Salli aiheen lukeminen käyttäjän blogista

source: Entry is not in topic!
fi: Merkintä ei ole annetussa aiheessa!

source: Read group weblog topic
fi: Oikeus lukea ryhmän blogin aihetta

source: Read weblog topic
fi: Oikeus lukea blogin aihetta

source: User can read a topic from a weblog of a group
fi: Käyttäjä voi lukea aihetta ryhmän blogista

source: User can read a topic from a weblog of a user
fi: Käyttäjä voi lukea aihetta käyttäjän blogista

source: Date
fi: Päiväys

source: Publish date
fi: Julkaisupäivä

source: Removal date
fi: Poistopäivä

source: Use removal date
fi: Käytä merkinnän poistopäivää

source: User weblog writer
fi: Käyttäjän blogin kirjoittaja

source: Weblog writer
fi: Blogin kirjoittaja

source: Deny weblog writing
fi: Estä blogin kirjoitus

source: Deny user weblog writing
fi: Estä käyttäjän blogin kirjoitus

source: Comment group weblog topic
fi: Oikeus kommentoida ryhmän blogin aiheessa

source: User can comment entries in a topic from a weblog of a group
fi: Käyttäjä voi kommentoida viestejä ryhmän blogin aiheessa

source: Comment weblog topic
fi: Oikeus kommentoida blogin aiheessa

source: User can comment entries in a topic from a weblog of a user
fi: Käyttäjä voi kommentoida viestejä blogin aiheessa

source: Delete weblog post comments
fi: Oikeus poistaa kommentteja verkkolokin viesteistä

source: Entry not found
fi: Kirjausta ei löydy

source: Reply in personal weblog
fi: Vastaa viestiin omassa blogissa

source: Reply to a %1post%2:
fi: Vastaus %1viestiin%2:

source: Reply to a %1post%2 by %3:
fi: Vastaus %1viestiin%2, jonka %3 kirjoitti:

source: Reply to a %1post%2 by %3 titled %4:
fi: Vastaus %1viestiin%2, jonka %3 kirjoitti otsikolla %4:

source: Reply to a %1post%2 titled %3:
fi: Vastaus %1viestiin%2 otsikolla %3:

source: Are you sure you want to remove the post from replies?
fi: oletko varma, että haluat poistaa viestin vastauksien joukosta?

source: Could not find replied post!
fi: Viestiä, johon yritit vastata ei löydy!

source: Error removing reply %1.
fi: Virhe poistettaessa viestiä %1.

source: No rights to inform replied post owner of reply.
fi: Sinulla ei ole oikeuksia ilmoittaa viestistäsi vastatun viestin omistajan blogissa.

source: Replies in other weblogs
fi: Muissa blogeissa sijaitsevat vastaukset

source: Reply removed.
fi: Vastaus poistettu.

source: Read more..
fi: Lue lisää..

source: This post is a reply to following posts
fi: Tämä viesti on vastaus seuraaviin viesteihin

source: Sharing
fi: Jakaminen

source: Select group to share all topics with
fi: Valitse ryhmä joille jaat kaikki aiheet

source: Select group to share topic %1 with
fi: Valitse ryhmä jolle jaat aiheen %1

source: Select user to share all topics with
fi: Valitse käyttäjä jolle jaat kaikki aiheet

source: Select user to share topic %1 with
fi: Valitse käyttäjä jolle jaat aiheen %1

source: Logged in users
fi: Sisäänkirjautuneet käyttäjät

source: New group
fi: Uusi ryhmä

source: New user
fi: Uusi käyttäjä

source: Whole internet
fi: Koko internet

source: Custom weblog name
fi: Blogin nimi

source: General settings
fi: Yleiset asetukset

source: Attach
fi: Liitä

source: Attach personal posts as reply
fi: Liitä omia viestejä vastaukseksi

source: Replies attached.
fi: Vastaukset liitetty.

source: Select entries to attach as reply
fi: Valitse vastaukseksi liitettävät viestit

source: Comment on '%1'
fi: Kommentti viestiin '%1'

source: Comments from weblog of group %1
fi: Kommentit ryhmän %1 blogista

source: Comments from weblog of user %1
fi: Kommentit käyttäjän %1 blogista

source: Subscribe comments with feed reader
fi: Tilaa kommentit noutajaan

source: Syndication feed (RSS 1.0) for comments
fi: Kommenttien RSS (1.0)-syöte

source: Weblog comments
fi: Blogin kommentit

source: Anonymous
fi: Nimetön

source: Deny sharing weblog
fi: Kiellä blogin jakaminen

source: User can give rights to use the weblog
fi: Käyttäjä voi antaa oikeuksia lukea blogia

source: Commenting without javascript is disabled to reduce spam. Please turn javascript on to comment.
fi: Kommentointi ilman javascriptiä on estetty roskapostin vähentämiseksi. Ole hyvä ja kytke javascript päälle kommentoidaksesi.

source: Your comment has been identified as spam.
fi: Kommenttisi on identifioitu roskapostiksi.

source: Latest posts in weblog.
fi: Viimeisimmät viestit blogissa.

source: Remove sharing of topic %1 for %2
fi: Poista aiheen %1 jakaminen kohteelle %2

source: Share topic %1 to some group
fi: Jaa aihe %1 jollekin ryhmälle

source: Share topic %1 to some user
fi: Jaa aihe %1 jollekin käyttäjälle

source: Share topic %1 for %2
fi: Jaa aihe %1 kohteelle %2

source: Share group weblog
fi: Jaa ryhmän blogi

source: User can give rights to use the group weblog
fi: Käyttäjä voi antaa oikeuksia lukea ryhmän blogia

source: You have not saved the text you have written. If you continue you will lose the text you have written.
fi: Et ole tallentanut kirjoittamaasi tekstiä. Jos jatkat pois sivulta, menetät kirjoittamasi tekstin.

source: Add entries to a weblog of a user
fi: Lisätä viestejä käyttäjän blogiin

source: Add weblog entries
fi: Lisätä viestejä blogiin

source: Remove entries in a weblog of a user
fi: Poistaa viestejä käyttäjän blogista

source: Weblog alows the group to inform about latest activity and comment on the outside world.
fi: Blogi mahdollistaa ryhmän viimeisimmistä tapahtumista ilmoittamisen.
