Repository: meetings/core
Catalog: pkg/dicole_forums/msg/messages-*.po
Languages: fi

source: Add forum
fi: Lisää foorumi

source: Add new message
fi: Lisää uusi viesti

source: Add new topic
fi: Aloita uusi keskustelu

source: Add topic
fi: Aloita uusi keskustelu

source: Are you sure you want to remove this forum?
fi: Haluatko varmasti poistaa tämän foorumin?

source: Author
fi: Kirjoittaja

source: Cancel
fi: Keskeytä

source: Category
fi: Kategoria

source: Changes were saved.
fi: Muutokset tallennettiin onnistuneesti.

source: Changing type sets of a live discussion forum is not a good idea.
fi: Emme suosittele tyyppikokoelman muuttamista käynnissä olevan keskustelun aikana.

source: Confirmation
fi: Vahvistus

source: Content
fi: Sisältö

source: Created
fi: Luotu

source: Deny forums moderation
fi: Estä foorumien muokkaus

source: Deny forums use
fi: Estä foorumien käyttö

source: Description
fi: Kuvaus

source: Display forum details
fi: Näytä foorumin tiedot

source: Display message
fi: Näytä viesti

source: Edit
fi: Muokkaa

source: Edit forum
fi: Muokkaa foorumia

source: Edit forum messages
fi: Muokkaa foorumin viestejä

source: Edit forum messages owned by the user
fi: Muokkaa käyttäjän omia viestejä

source: Error removing forum %1.
fi: Virhe poistettaessa foorumia %1.

source: Error removing topic %1.
fi: Virhe poistettaessa aihetta %1.

source: Failed adding forum: %1
fi: Virhe luotaessa foorumia: %1

source: Failed adding message: %1
fi: Virhe luotaessa viestiä: %1

source: Failed adding topic: %1
fi: Virhe luotaessa aihetta: %1

source: Failed modifying forum: %1
fi: Virhe muokattaessa foorumia: %1

source: Forum %1 successfully removed.
fi: Foorumi %1 poistettiin onnistuneesti.

source: Forum details
fi: Foorumin tiedot

source: Forum has been saved.
fi: Foorumi tallennettiin onnistuneesti.

source: Forum with id %1 does not exist.
fi: Foorumia id-tunnisteella %1 ei ole olemassa.

source: Forums
fi: Foorumit

source: Forums moderator
fi: Foorumin ylläpitäjä

source: Forums user
fi: Foorumin käyttäjä

source: Group forums is a bulletin board where discussions are gathered in forums, topics and trees of messages.
fi: Foorumit toimivat ryhmien sisäisinä keskustelupalstoina, jossa viestit näkyvät aihekokonaisuuksina ja puumaisina keskustelusäikeinä.

source: Icon
fi: Ikoni

source: Impossible to remove root message %1.
fi: Keskustelun avausta %1 ei voida poistaa.

source: Latest forum posts
fi: Viimeisimmät viestit

source: List of forums
fi: Foorumien listaus

source: List of topics
fi: Aiheiden listaus

source: Manage forum threads
fi: Muokkaa foorumien viestiketjuja

source: Manage forums
fi: Foorumien muokkaus

source: Message
fi: Viesti

source: Message contents
fi: Viestin sisältö

source: Message has been saved.
fi: Viesti tallennettiin onnistuneesti.

source: Message information
fi: Viestin tiedot

source: Message part type set
fi: Viestin osan tyyppikokoelma

source: Message type set
fi: Viestin tyyppikokoelma

source: Message with id %1 does not exist.
fi: Viestiä id %1 ei ole olemassa.

source: Modify forum details
fi: Muokkaa foorumin tietoja

source: Name
fi: Nimi

source: New forum details
fi: Uuden foorumin tiedot

source: New message details
fi: Uuden viestin tiedot

source: New topic details
fi: Uuden aiheen tiedot

source: Next
fi: Seuraava

source: No messages found.
fi: Viestejä ei ole saatavilla.

source: Not available
fi: Ei saatavilla

source: Posted
fi: Lähetetty

source: Posts
fi: Viestit

source: Previous
fi: Edellinen

source: Read forums
fi: Lue foorumeita

source: Remove
fi: Poista

source: Remove forum
fi: Poista foorumi

source: Remove forum messages
fi: Poista viestejä

source: Remove forum messages owned by the user
fi: Poista käyttäjän omia viestejä

source: Remove message
fi: Poista viesti

source: Remove topic
fi: Poista aihe

source: Reply
fi: Vastaa

source: Reply to message
fi: Vastaus viestiin

source: Save
fi: Tallenna

source: Save and add new
fi: Tallenna ja lisää uusi

source: Select paragraphs to quote
fi: Valitse kappaleet joita lainataan

source: Select paragraphs to quote in your message
fi: Valitse viestiisi lainattavat kappaleet

source: Show
fi: Näytä

source: Show forum management
fi: Näytä foorumin hallinta

source: Show forums
fi: Näytä foorumit

source: Show topic listing
fi: Näytä aihelistaus

source: Show topics
fi: Näytä aiheet

source: Status
fi: Tila

source: This is the first post to a topic and removing it will remove the topic including all messages posted into it. Are you sure you want to remove this topic?
fi: Tämä on aiheen ensimmäinen viesti ja sen poistaminen poistaa koko aiheen ja kaikki siihen liittyvät viestit. Haluatko varmasti poistaa tämän aiheen?

source: This message and all replies below this message will be removed. Are you sure you want to remove this message?
fi: Tämä viesti ja kaikki siihen liittyvät viestit tuhotaan. Haluatko varmasti poistaa tämän viestin?

source: Thread type set
fi: Viestiketjun tyyppikirjasto

source: Thread with id %1 does not exist.
fi: Viestiketjua id-tunnisteella %1 ei ole olemassa.

source: Title
fi: Otsikko

source: Topic
fi: Aihe

source: Topic %1 successfully removed.
fi: Aihe %1 poistettiin onnistuneesti.

source: Topic has been saved. Now write the first message.
fi: Aihe tallennettiin onnistuneesti. Voit nyt kirjoittaa ensimmäisen viestin aiheeseen.

source: Topics
fi: Aiheet

source: Tree of messages in topic
fi: Aiheen viestit puurakenteena

source: Type
fi: Tyyppi

source: Updated
fi: Päivitetty

source: User can edit any forum message in this group
fi: Käyttäjä voi muokata kaikkia viestejä tässä foorumissa

source: User can edit messages owned by the user in this group
fi: Käyttäjä voi muokata kirjoittamiaan viestejä tässä foorumissa

source: User can manage forum threads in this group
fi: Käyttäjä voi hallinnoida viestiketjuja tässä foorumissa

source: User can manage forums in this group
fi: Käyttäjä voi hallinnoida ryhmän foorumia

source: User can read forums in this group
fi: Käyttäjä voi lukea ryhmän foorumia

source: User can remove any forum message in this group
fi: Käyttäjä voi poistaa ryhmän foorumin viestejä

source: User can remove forum messages owned by the user in this group
fi: Käyttäjä voi poistaa omia viestejään tässä foorumissa

source: User can write and reply forum messages in this group
fi: Käyttäjä voi kirjoittaa ja vastata viesteihin tässä foorumissa

source: Viewed # times
fi: Katsottu # kertaa

source: Warning: all data you have currently written will be lost. Are you sure you want to cancel?
fi: Varoitus: Sisältö, jota olet kirjoittanut, tuhoutuu. Haluatko varmasti keskeyttää?

source: Warning: all data you have currently written will be lost. Are you sure you want to return back to selecting message paragraphs?
fi: Varoitus: Sisältö, jota olet kirjoittanut, tuhoutuu. Haluatko varmasti palata palata kappalevalintaan?

source: Write forum messages
fi: Kirjoita viesti foorumiin

source: Topic has no messages. Please write the first message.
fi: Aiheella ei ole viestejä. Kirjoita ensimmäinen viesti.

source: Quote and reply
fi: Lainaa ja vastaa

source: Edit message
fi: Muokkaa viestiä

source: Forum rights
fi: Foorumin oikeudet

source: Unread
fi: Lukematta

source: Unread messages
fi: Lukemattomat viestit
