Repository: meetings/core
Catalog: pkg/dicole_invite/msg/messages-*.po
Languages: fi

source: %1 (%2) is already a member.
fi: %1 (%2) on jo jäsen.

source: All fields are mandatory.
fi: Kaikki kentät ovat pakollisia.

source: Error sending email. Please contact your system administrator or try again later
fi: Sähköpostin lähettämisessä tapahtui virhe.

source: I accept the terms of service.
fi: Hyväksyn käyttöehdot

source: Ignore invite
fi: Älä ota kutsua vastaan

source: Invalid email: %1
fi: Viallinen sähköpostiosoite: %1

source: Invitation to %1
fi: Kutsu %1 työalueelle

source: Invite
fi: Kutsu

source: Invite to this group has been accepted.
fi: Kutsu ryhmään on hyväksytty.

source: Join
fi: Liity

source: No invites remaining.
fi: Ei kutsuja jäljellä.

source: Register (action)
fi: Rekisteröidy

source: Registration done. We have emailed you your account information.
fi: Rekisteröityminen suoritettu. Olemme lähettäneet sinulle tunnistautumistietosi sähköpostilla.

source: Registration done. We have emailed you your account information. You may now login with the provided information.
fi: Rekisteröityminen suoritettu. Olemme lähettäneet sinulle tunnistautumistietosi sähköpostilla. Voit kirjautua sähköpostista löytyvällä salasanalla.

source: Registration key no longer valid.
fi: Kutsu ei ole enää voimassa.

source: Remaining invites
fi: Kutsuja jäljellä

source: Send an invitation
fi: Lähetä kutsu

source: Send invitations
fi: Kutsujen lähetys

source: Sent an invitation to %1
fi: Kutsu lähetetty osoitteeseen %1

source: Terms of service
fi: Käyttöehdot

source: Unlimited invites
fi: Rajattomasti kutsuja

source: User can send unlimited invitations
fi: Käyttäjä voi lähettää rajattomasti kutsuja

source: You are already part of the group you were invited to.
fi: Olet jo valmiiksi kutsun kohteena olevan ryhmän jäsen.

source: You can not get invited to the system while logged in.
fi: Et voi rekisteöiryä järjestelmään mikäli olet jo kirjautunut.

source: You have been invited to join %1.
fi: Sinut on kutsuttu %1 työalueelle.

source: You have been invited to join %1. Please log in to claim this invite if you are already registered. Otherwise you can create a new account by filling the form below.
fi: Sinut on kutsuttu %1 työalueelle. Jos olet jo rekisteröitynyt, voit ottaa kutsun vastaan kirjautumalla. Muussa tapauksessa voit rekisteröityä täyttämällä allaolevan lomakkeen.

source: You need to accept the terms of service.
fi: Käyttöehdot on hyväksyttävä.

source: You do not have any invites left.
fi: Sinulla ei ole kutsuja jäljellä.

source: Invite rights
fi: Kutsujen oikeudet

source: User with login %1 already exists. Choose a different email address.
fi: Käyttäjä tunnuksella %1 on jo olemassa. Valitse toinen sähköpostiosoite.

source: Your previous account with email %1 has been used to claim this invite. You may now login with your previous login name and password.
fi: Kutsu on hyväksytty aikaisemmalla tunnuksella, jonka sähköpostiosoite on %1. Voit nyt kirjautua aikaisemmalla tunnuksellasi ja salasanallasi.

source: Add an additional message to the invite...
fi: Liitä vapaavalintainen viesti kutsuun...

source: Add these users to the group immediately.
fi: Lisää heti nämä käyttäjät ryhmään.

source: All groups
fi: Kaikki ryhmät

source: Customize the title to the invite...
fi: Muokkaa kutsun otsikkoa...

source: Invited users will have the following user level
fi: Kutsutut käyttäjät saavat seuraavan käyttäjätason

source: Invite existing users...
fi: Kutsu olemassa olevia käyttäjiä...

source: Invite users by email
fi: Kutsu käyttäjiä sähköpostin perusteella

source: Invite users to group '%1'
fi: Kutsu käyttäjiä ryhmään '%1'

source: Send an invitation to these users
fi: Lähetä kutsu näille käyttäjille

source: separate email addresses by commas
fi: erota sähköpostiosoitteet pilkuilla

source: user(s) selected
fi: käyttäjä(ä) valittuna

source: %1 added to area
fi: %1 lisätty alueelle

source: Invite to %1 has been accepted.
fi: Kutsu hyväksytty alueelle %1.

source: Privacy Policy
fi: Rekisteriseloste

source: Remember me on this computer
fi: Muista minut tällä koneella

source: Service Description
fi: Palvelukuvaus

source: Terms of Usage
fi: Käyttöehdot

source: You have been invited to join %1. Please log in to claim this invite if you are already registered. Otherwise you can create a new account by pressing the register button.
fi: Sinut on kutsuttu alueelle %1. Jos olet jo rekisteröitynyt, kirjaudu sisään vastaanottaaksesi kutsun. Muussa tapauksessa rekisteröidy järjestelmään uudella tunnuksella.

source: Invite users to %1
fi: Kutsu käyttäjiä alueelle %1

source: Register with Facebook
fi: Rekisteröidy Facebookilla

source: Message
fi: Viesti

source: separate email addresses by commas (,) or semicolons (;)
fi: erota sähköpostiosoitteet pilkuilla (,) tai puolipisteillä (;)
